{
  "books": [
    {
      "bookId": 1,
      "bookName": "Tarix",
      "status": "tavsiya",
      "bookImage": "assets/svg_icon/img.png",
      "classes": [
        {
          "classId": 5,
          "classLevel": 11,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": " Jahon tarixining 1991-yildan boshlangan davrida dunyoning ijti- moiy-siyosiy va iqtisodiy tizimida katta o‘zgarishlar yuz berdi. Bu davrda jamiyat hayotining barcha jabhalariga kuchli ta’sir ko‘rsatgan omil ilmiy-texnik inqilobning  yangi  bosqichi – kompyuter-axborot  inqi- lobi bo‘ldi. Bu inqilob ta’siri ostida rivojlangan mamlakatlarda sivi- lizatsiyaning industrial bosqichidan postindustrial, axborot bosqichiga o‘tish boshlandi. Mazkur  darslik shu davr voqealarini bayon qilish  bilan   birga, jamiyat taraqqiyotining hozirgi bosqichini tahlil qilish va mustaqil hayotga qadam qo‘yish arafasida  turgan  Siz  o‘quvchilarga  o‘z  hayo- tiy istiqbolingizni belgilab olish imkonini beruvchi bilimlarni shakl- lantiradi.  Bu bilimlar jahon  xalqlari   madaniyatining   har   biri   o‘ziga xos noyob ekanligini, gumanizm va vatanparvarlik tamoyillari, fuqa- rolik jamiyati va huquqiy davlat g‘oyalariga asoslangan umuminsoniy qadriyatlarni anglashga ko‘maklashadi. Jamiyat taraqqiyotining muhim qonuniyatlarini bilib  olish,  rivojlanishning  o‘ziga  xos  yo‘llarini  tushu- nish va istiqbollari haqida tasavvurlarga ega bo‘lish imkonini beradi. Shuningdek, olgan  bilimlaringiz  ilg‘or  mamlakatlarning  tarixiy  tajriba- sini O‘zbekistonda ijodiy qo‘llashga yordam beradi."
            },
            {
              "id": 2,
              "page": 4,
              "title": "1-MAVZU. XX ASR OXIRI – XXI ASR BOSHLARIDA XALQARO MUNOSABATLAR",
              "desc": "Jahon tarixi eng yangi davrining uchinchi bosqichi 1991-yildan boshlanib, hozirgi kungacha bo‘lgan voqealarni o‘rganadi. Bu davrda sotsialistik tizimning barbod bo‘lishi, SSSRning tarqalib ketishi jahon miqyosida kuchlar nisbatiga, qudratli davlatlar o‘rtasida shakllangan muvozanatga katta ta’sir ko‘rsatdi.Bu davrda iqtisodiy va madaniy hayotning globallashuvi, ekologiya muammolarining keskinlashuvi, jahonning juda katta qismida moder- nizatsiya jarayonlarining tugallanmaganligi bilan bog‘liq ziddiyatlarning kuchayishi xalqaro barqarorlikka jiddiy xavf sola boshladi, ko‘plab mamlakatlardagi murakkab muammolarning manbayiga aylandi.XX  asrning   90-yillari   oxirida   xalqaro   munosabatlar.   Ikkinchijahon urushidan so‘ng jahondagi kuchlar nisbatini belgilab kelgan kapitalistik va sotsialistik harbiy-siyosiy bloklar o‘rtasidagi qarama- qarshilik  1990-yillarda barham topdi.  Ammo,   ayni   paytda,   mintaqa- viy mojarolar va «kichik urushlar» xavfi kuchayib, shaxs hamda xalqlarning huquq va xavfsizligini himoya qilish, gumanitar-huquqiy, madaniy aloqalarni ta’minlash, obyektiv axborot tarqatish masalalari jahon siyosatining dolzarb muammolariga aylandi.1990-yillar  boshlarida  xalqaro  munosabatlar  tizimida    tub    buri- lish yuz berdi. Avval Markaziy va Sharqiy Yevropa mamlakatlarida sotsializmning  barbod bo‘lishi,  keyin   esa   SSSRning   tarqalib   ketishi va «ikki qutbli  dunyo»  modelining  barham  topishi  natijasida  dunyoda bitta  qutb,  ya’ni  AQSH  boshchiligida  G‘arb  davlatlarining  hukmron- ligi o‘rnatildi. Sobiq sotsialistik lager mamlakatlaridagi qiyinchiliklar, Germaniyaning birlashishi va G‘arb davlatlaridagi integratsiyalashuv jarayonlari XX asr oxiri – XXI asr boshlaridagi xalqaro munosabat- larning muhim omiliga aylandi."
            },
            {
              "id": 3,
              "page": 10,
              "title": " MAVZU. SHARQIY YEVROPA MAMLAKATLARIDA DEMOKRATIK INQILOBLAR VA SOTSIALISTIK LAGERNING PARCHALANISHI",
              "desc": " Sotsialistik tuzumning parchalanishi. Sharqiy Yevropa mamlakatla- rida sotsialistik tuzumning ag‘darilishi turlicha ko‘rinishda amalga oshirildi. Qayta qurish davrida faol islohotlar olib borgan, mafkuraviy plyuralizmni o‘rnata  olgan  va  rahbarlari  o‘zgarishlarning  muqarrarligini his qilgan mamlakatlarda sotsializmning qulashi ancha silliq kechdi.Polshada aholining mamlakatdagi sotsialistik tuzumdan norozilik namoyishlari 1988-yildan boshlab kuchayib bordi va ular siyosiy islo- hotlarni, Lex Valensa boshchiligidagi «Birdamlik» kasaba uyushma- sining erkin faoliyat yuritish huquqini talab qildi.1989-yili bo‘lib o‘tgan saylovlar hukm- ron  Polsha birlashgan ishchi  partiyasi- ning  (PBIP) obro‘yi tushib  ketganligi, ayni paytda, muxolifatdagi «Birdamlik» kasaba uyushmasining ommalashib bo- rayotganini ko‘rsatdi. Yangi tarkibdagi parlament  konstitutsiyaga o‘zgarish  kiri- tib, Polshani demokratik huquqiy dav-lat deb  e’lon  qildi.  PBIP  o‘z  faoliyatini to‘xtatdi.  1990-yili  navbatdan  tashqari  prezidentlik  saylovlarida  Lex Valensa g‘alaba qozondi. Ruminiyada kommunistik rejimning qulashi jiddiy harbiy to‘qnashuv oqibatida yuz berdi.  1989-yil  de- kabrda Timishoara shahrida aholining N. Chaushesku rejimiga qarshi tinch namoyishi Ruminiya maxfiy xiz- mati xodimlari tomonidan o‘qqa tutilishi mamlakat bo‘ylab qo‘zg‘olonning boshlanishiga olib keldi."
            },
            {
              "id": 4,
              "page": 15,
              "title": " MAVZU. SOVET DAVLATINING PARCHALANISHI VA SOBIQ SOVET RESPUBLIKALARIDA MUSTAQILLIKNING E’LON QILINISHI",
              "desc": " MDHning  tashkil topishi. 1991-yilning oxiriga  kelib   barcha   so- biq  respublikalar SSSR tarkibidan  chiqqanligini   e’lon   qildilar.   1991- yil 8-dekabrda  Rossiya,  Ukraina  va  Belarus  rahbarlari  yig‘ilib, SSSR siyosiy birlik sifatida tugatilganligini va Mustaqil Davlatlar Hamdo‘stligi (MDH) tuzilganligini tasdiqladilar.1991-yil 25-dekabr kuni SSSR prezidenti M. Gorbachyov davlat boshlig‘i vakolatlarini o‘zidan soqit qilganligi to‘g‘risida bayonot berdi.1991-yil dekabrda Turkmaniston poy- taxti Ashxobod shahrida  beshta  Marka- ziy Osiyo respublikalari rahbarlarining uchrashuvi bo‘lib, unda a’zo davlat- larning  tengligi  va  barchasining  MDHta’sischisi sifatida ittifoqqa qo‘shilishi ma’lum  qilindi.  1991-yil  dekabrda  Qo-zog‘istonning  Olmaota  shahrida  bo‘lib o‘tgan  uchrashuvda  Deklaratsiya  qabulqilinib,  SSSR xalqaro huquq subyekti  va   geosiyosiy   reallik   sifatida o‘z faoliyatini tugatganligi ta’kidlandi. Shu yil oxirigacha Boltiqbo‘yi respublikalari – Latviya,  Litva,  Estoniyadan  tashqari  barcha  sobiq sovet respublikalari MDH tarkibiga kirdi. Ammo Gruziya 2008-yili, Ukraina  esa 2014-yildan MDH faoliyatida qatnashmasligini  ma’lum qildi. Mo‘g‘uliston MDHning bir qator tuzilmalarida kuzatuvchi si- fatida ishtirok etib kelmoqda. 2008-yili Afg‘oniston MDHga kirish istagini  bildirib,  hozir  MDH  parlamentlararo  assambleyasida  kuzatuv- chi sifatida ishtirok etmoqda. MDHning tuzilishi SSSR parchalangandan so‘ng sobiq sovet respub- likalari o‘rtasida iqtisodiy va gumanitar aloqalarni saqlab turishda, ijtimoiy va gumanitar halokatlarning oldini olishda, paydo bo‘lgan muammolarni hamkorlikda hal etishda muhim rol o‘ynadi."
            },
            {
              "id": 5,
              "page": 19,
              "title": " MAVZU. 1991 – 2017-YILLARDA ROSSIYA FEDERATSIYASI",
              "desc": "Iqtisodiy islohotlar. 1991-yilgi avgust inqirozidan so‘ng  Rossiyada asosiy lavozimlarga demokratik kuchlar vakillari emas, kommunistik partiya faollari keldi. Qayta qurish yillarida bu faollarning ko‘pchiligi kommunistik partiya bilan aloqalarini uzgan bo‘lsa-da, ularning is- lohotchilik  imkoniyatlari cheklangan edi. B. Yelsin tomonidan  Bosh vazir lavozimiga taklif qilingan Y. Gaydar Rossiyadagi islohotlarning«arxitektori» bo‘ldi.Islohotlar juda og‘ir kechdi. Milliy daromad  va  sanoat  ishlab  chi- qarishi pasayib ketdi. 1992-yil 1-yanvardan erkin qo‘yib yuborilgan narxlar  keskin ko‘tarildi.  Ko‘pchilik   oilalarda   oziq-ovqat   xarajatlari oila daromadining asosiy qismini tashkil qildi. Oqibatda urushdan keyingi davrda birinchi marta Rossiya aholisi kamaya boshladi.Inflatsiya va siyosiy beqarorlik investitsiyalarning kirib kelishiga to‘sqinlik qildi. 1999-yilga kelib Rossiyaning tashqi qarzi 130 mlrd dollardan oshib ketdi. Xalqaro moliya tashkilotlari qarz bermay qo‘ydi. Mamlakatning iqtisodiy ahvoli ijtimoiy holatga ham ta’sir ko‘rsatdi. Ish- sizlar, qochoqlar, qashshoqlar va boshpanasizlar soni keskin ko‘paydir"
            },
            {
              "id": 6,
              "page": 23,
              "title": "1991 – 2017-YILLARDA UKRAINA, BELARUS VA MOLDOVA RESPUBLIKALARI ",
              "desc": " Ukraina. 1991-yil 24-avgustda Ukraina o‘z mus- taqilligini e’lon qildi. 1991-yil dekabrda o‘tkazilgan referendumda mutlaq ko‘pchilik aholi Ukraina mus- taqilligi uchun ovoz berdi.Referendum bilan birga Ukraina prezidentligiga o‘tkazilgan saylovlarda Leonid Kravchuk  Ukraina- ning birinchi prezidenti etib saylandi.Mustaqillik  e’lon  qilindi.  Ammo  yuqori  samara- li,  barqaror  milliy    iqtisodni    tashkil    qilmasdan real siyosiy mustaqillikni qaror toptirish mumkinemasdi. SSSRni qamrab olgan iqtisodiy inqiroz, umumittifoq iqtisodiy kompleksining barbod bo‘lishi  boshqalar  qatori  Ukrainaga  ham  jiddiy ta’sir ko‘rsatdi. Mustaqillik e’lon qilinishi paytida Ukraina iqtisodiyoti kuchsiz holatda edi.Inqiroz sanoat va qishloq xo‘jaligini qamrab oldi. Inqirozdan  chi- qishning  ko‘plab dasturlari  ishlab   chiqildi,   ammo   ulardan   birortasi ham oxirigacha amalga oshirilmadi.XX asr 90-yillarining ikkinchi yarmidan ish haqidan qarzdorlikni bartaraf  qilish,  chet  el  kreditlari  va   valuta   bozorini   tartibga   so- lish hisobiga iqtisodiy holat o‘zgardi, 1996-yili milliy valuta – grivna muomalaga kiritildi. Ammo kutilganidek, chet  el  investitsiyasi  mam- lakatga oqib kelmadi, grivna tez qadrsizlanib bordi."
            },
            {
              "id": 7,
              "page": 29,
              "title": " MAVZU. 1991 – 2017-YILLARDA BOLTIQBO‘YI DAVLATLARI",
              "desc": " Boltiqbo‘yi respublikalari deganda, odatda, Latviya, Litva va Es- toniya tushuniladi.Mustaqillik e’lon qilingandan  boshlab  Boltiqbo‘yi  respublikalari jadal ravishda bozor iqtisodiyotini joriy qilishga, o‘zlarining G‘arb davlatlari bilan munosabatlarini  mustahkamlashga  kirishdi.  Uchala davlat ham 2004-yilda NATOga, shu yili YIga a’zo bo‘ldi.Mustaqillik yillarida obro‘li xalqaro tashkilotlarga a’zo bo‘lgan bu davlatlar shiddat bilan iqtisodiy rivojlanish yo‘liga kirdi. Shu jadal rivojlanish tufayli ular «Boltiq yo‘lbarslari» deb ataldi. Ammo bunday shiddatli rivojlanish 2008 – 2009-yillardagi inqirozgacha davom etdi.Latviya. 1988-yili tuzilgan Latviya Xalq  fronti  mustaqillik  uchun kurash boshladi. Natijada 1990-yil 4-mayda  Latviya  o‘z  mustaqilligini e’lon qildi.Mustaqillik yillarida Latviya sovet davrida qurilgan yirik sanoat korxonalarini, jumladan, elektrotexnika buyumlarini ishlab chiqaruvchi eng yirik VEF, mikroavtobuslar ishlab  chiqaruvchi  RAF  zavodlarini yopdi. Bu  ko‘plab  tajribali  ishchi-mutaxassislarning  qisqarishiga,  ishsiz- lar sonining keskin oshishiga olib keldi."
            },
            {
              "id": 8,
              "page": 33,
              "title": " MAVZU. 1991 – 2017-YILLARDA KAVKAZORTI DAVLATLARI",
              "desc": " Ozarbayjon  Respublikasi  1991-yil  18-oktabr  kuni  o‘z  mustaqilli- gini e’lon qildi. Ozarbayjon 1991-yildan beri o‘tgan vaqt davomida o‘zining mustaqil yo‘liga ega davlat ekanligini isbotlab  kelmoqda.  U mintaqa  siyosatida  muhim   rol   o‘ynaydi.   Ozarbayjon   katta   neft   va gaz zaxiralariga egaligi, strategik joylashuvi bois Rossiya va G‘arb manfaatlari  orasida  mohirlik  bilan  muvozanatni  saqlab,  o‘z  manfaatla- rini ta’minlab kelmoqda.Ammo, tashqi siyosatdagi  muvaffaqiyatlarga  qaramasdan,  bir  qator ichki  muammolar saqlanib qolmoqda. Bular qatoriga, birinchi  nav- batda, Tog‘li Qorabog‘ muammosini kiritish mumkin.XX asrning 80-yillari ikkinchi yarmida Ozarbayjon bilan Ar- maniston o‘rtasidagi azaliy  muammo – Tog‘li  Qorabog‘  muammosi yana ko‘tarildi. Tog‘li Qorabog‘ Ozarbayjon  hududida  joylashgan  va asosan  arman millatiga  mansub   aholi   yashaydigan   avtonom   viloyat edi. Tog‘li Qorabog‘ avtonom viloyati rahbarlarining  viloyatni  Arma- niston tarkibiga qo‘shishini so‘rab qilgan murojaati mintaqadagi milliy muammolarni chigallashtirib yubordi.1990-yili Boku shahrida muxolifatchi siyosiy  tashkilot – Ozarbayjon Xalq  frontining  namoyishi   boshlandi.   Xalq   fronti   Abulfayz   Elchi- bey boshchiligida  Milliy  mudofaa  kengashi  tuzilganligini  e’lon  qildi. Xalq frontining millatchilik ruhidagi mitinglari Bokudagi armanlar qirg‘iniga bevosita turtki  bo‘ldi.  Bunga  qarshi  Bokuga  Sovet  armiya- si qo‘shinlari kiritildi. Mamlakatda favqulodda holat e’lon qilindi. Armiyaning kiritilishi Ozarbayjon uchun katta fojia bo‘ldi.  To‘qnashuv- larda yuzlab kishilar halok bo‘ldi."
            },
            {
              "id": 9,
              "page": 38,
              "title": " MAVZU. 1991 – 2017-YILLARDA MARKAZIY OSIYO DAVLATLARI",
              "desc": " Markaziy  Osiyo  mamlakatlariga,  odatda,  O‘zbekistondan  tashqariQozog‘iston, Turkmaniston,  Tojikiston  va  Qirg‘iziston  kiradi.Qozog‘iston Respublikasi. 1991-yil 16-dekabrda Qozog‘iston o‘z mustaqilligini e’lon qildi.  Shu  yili  bo‘lib  o‘tgan  prezidentlik  saylov- larida Nursulton Nazarboyev Qozog‘istonning birinchi prezidenti etib saylandi. 1993-yil Qozog‘istonning yangi  konstitutsiyasi  qabul  qilindi. Unda eng katta vakolatlar prezidentga berildi. Hukumat iqtisodiy is- lohotlarni boshlab yubordi.1993-yil  noyabrda  milliy   valuta – tenge   muomalaga   kiritildi.   Shu yil dekabrda Qozog‘iston  hukumati  yirik  neft  konsernlari  bilan Kaspiy dengizining shimoliy qismida qidiruv  o‘tkazish  to‘g‘risida  keli- shuv  imzoladi. Yirik korxonalarni xususiylashtirish  amalga   oshirildi. Shu yili parlament mamlakat poytaxtini Akmola shahriga ko‘chirish to‘g‘risida qaror qildi. U 1998-yildan «Ostona» deb ataladigan bo‘ldi.O‘tgan davrda Qozog‘iston iqtisodiyotining asosiy sohalari neft, gaz  va  metallurgiya bo‘lib qoldi. Aynan shu sohalarning hisobiga iqtisodiyotning boshqa sohalarida ham jadal o‘sishga erishildi."
            },
            {
              "id": 10,
              "page": 44,
              "title": " MAVZU. G‘ARB MAMLAKATLARIDA INTEGRATSIYALASHUV JARAYONLARINING JADALLASHUVI. YEVROPA ITTIFOQI VA AQSH MUNOSABATLARI",
              "desc": " Integratsiyalashuv jarayonlari va ularning natijalari. XX asrning ikkinchi yarmida bosh- langan kapital, tovarlar,  xizmat  ko‘rsatish  va ishchi kuchining erkin harakatlanishi G‘arbiy Yevropa mamlakatlarida rivojlanish va yashash darajasini bir-biriga yaqinlashtirdi. Ishchi kuchlarining rivojlangan mamlakatlarga  mav- sumiy  yoki  shartnoma   asosida   ishga   borishi kam rivojlangan mamlakatlarda ishsizlik muam-Yevropada integratsiyalashuv jarayonimosini  hal  qilishga  ko‘maklashdi.  Qoloq mintaqalarni rivojlantirish umumyevropa dastur-lari  ham   bu   mintaqalarning   iqtisodiy   o‘sishiga   yordam   berdi.Integratsiya ta’sirida rivojlangan Yevroatlantika mamlakatlarida asta- sekin  yagona iqtisodiy siyosat modeli shakllanib bordi. Ular  o‘rta- sidagi  asosiy farq  iqtisodiyot   ustidan   davlat   nazoratining   darajasi, unga ta’sir ko‘rsatish usullari bilan bog‘liq edi.1990-yillardan  boshlab  Yevropa  integratsiyasining  keyingi  rivojlani- shi ikki  yo‘nalish  bo‘yicha  bordi.  Birinchidan,  yangi  a’zolarni  qabul qilish yo‘nalishi bo‘lib, 1996-yili a’zolar soni 15 taga yetdi. 2002-yili Kopengagenda (Daniya) bo‘lib o‘tgan uchrashuvda Yevroittifoqqa yangi a’zolar – Vengriya, Kipr, Latviya, Litva, Malta, Polsha, Slovakiya,  Slo- veniya, Chexiya, Estoniya qabul qilindi.  Albatta,  yangi  a’zolar  uchun o‘tish davri ko‘zda tutilgan bo‘lib, bu davr mobaynida ular o‘z qo- nunchiligini,  moliyaviy  va  iqtisodiy  tizimini  yagona  Yevropa  talabla- riga moslashtirishi lozim edi. Ularga  o‘zlarining  ichki  muammolarini hal qilish uchun Yevroittifoq budjetidan subsidiyalar berildi."
            }
          ]
        },
        {
          "classId": 4,
          "classLevel": 10,
          "mundarija": [
            {
              "id": 1,
              "page": 2,
              "title": "Kirish",
              "desc": " Insoniyat tarixining Birinchi jahon urushining yakuni – 1918-yildan boshlanib, hozirgi kungacha bo‘lgan davri «Eng yangi tarix» deb ataladi.«Eng yangi tarix» kishilik jamiyati rivojlanishida industrial sivili- zatsiyadan postindustrial sivilizatsiyaga o‘tish davri sifatida qaraladi. Eng yangi davr tarixida nisbatan mustaqil bo‘lgan uchta bosqichni ajratib ko‘rsatish mumkin. Birinchi bosqich 1918 – 1945-yillar – indus- trial jamiyat ijtimoiy-siyosiy tizimi inqirozining boshlanishi davri. Bu inqirozjahonurushlarida,sotsialistikvamilliy-ozodlikinqiloblarida, Germaniya,Italiya,Yаponiya,SSSRdatotalitar tuzumlarningqaror topishida, ijtimoiy ziddiyatlarning keskinlashuvida namoyon bo‘ldi. Bu bosqichningmazmuninijamiyattaraqqiyotiningikkiasosiy model- lari – liberal-demokratikvatotаlitartuzumlar o‘rtasidagikurashtashkil  qiladi.Ikkinchi bosqich 1945 – 1991-yillarni o‘z ichiga oladi. Bu bos- qich  mazmunini  mustamlaka  tizimining  qulashi  va  ko‘plab  mus- taqil davlatlarning tashkil topishi, «sovuq urush», dunyoni yadroviy halokat yoqasiga olib kelgan qurollanish poygasi tashkil qiladi. Ik- kinchi jahon urushidan keyin shakllangan sotsialistik lager bilan G‘arb mamlakatlari o‘rtasidagi global qarama-qarshilik bu davrning xarakterli jihati hisoblanadi."
            },
            {
              "id": 2,
              "page": 4,
              "title": " MAVZU. 1918 – 1939-YILLARDA XALQARO MUNOSABATLAR",
              "desc": " Birinchi jahon urushi xalqaro munosabatlarga va dunyoning si- yosiy xaritasiga katta ta’sir ko‘rsatdi. Germaniya, Avstriya-Vengriya va Usmoniylar imperiyalari tarqalib ketdi, Yevropada yangi davlatlar vujudga keldi, Rossiyada monarxiya ag‘darildi. Urush tugashi bilan g‘olib davlatlar xalqaro munosabatlarda yangi tartib o‘rnatish, urush- dan keyingi dunyoning qiyofasini belgilash uchun Parijga yig‘ildilar. Millatlar Ligasining tashkil qilinishi. Mandat tizimi. AQSH prezidenti Vudro Vilson tashabbusi bilan Parij tinchlik konferensiya- sida xalqaro tashkilot – Millatlar Ligasi tashkil qilindi. Jahonda tinch- lik uchun kurash, xalqlar o‘rtasida hamkorlik va xavfsizlik masalalari Millatlar Ligasining asosiy vazifalari qilib belgilandi. Dastlab mag‘lub davlatlar va Sovet Rossiyasi unga qabul qilinmadi."
            },
            {
              "id": 3,
              "page": 9,
              "title": " MAVZU. 1918 – 1939-YILLARDA ILMIY-TEXNIK TARAQQIYOTNING JADALLASHUVI,ILM-FANDAGI YUTUQLAR",
              "desc": " Bu  davrda  dunyoning  ijtimoiy-iqtisodiy  qiyofasini  o‘zgartirgan eng muhim omillardan biri ilmiy-texnik taraqqiyot bo‘ldi. Fanni ish- lab chiqaruvchi kuchga aylantirishning uzoq davom etgan jarayoni yakunlanib, XX asr boshlarida ilmiy-texnik inqilobga olib keldi.Aniq  va  tabiiy  fanlardagi  inqilob.  Nazariy  bilimlarning  amaliyahamiyatga ega ekanligi yadro energiyasining kashf qilinishida yaqqol namoyon bo‘ldi. Amerikalik Enriko Fermi va fransuz Frederik Jolio- Kyuri uranning parchalanishi jarayonida yuz beradigan zanjirli reak- siya natijasida juda katta energiya ajralib chiqishi to‘g‘risidagi g‘oyani shakllantirdi Shu davrda fizikaning alohida yo‘nalishi atom fizikasi ham shakl- landi. 1938-yili nemis olimlari uran yadrolari ajralib chiqishining zanjirli reaksiyasini kashf etdilar. Insoniyat oldida atom energiyasidan foydalanishning murakkab muammosi paydo bo‘ldi.Atom bombasini yaratish ustida izlanishlar Germaniya, sobiq Sovet Ittifoqi va boshqa bir qator davlatlarda ham davom ettirildi. Ammo AQSH o‘z raqiblaridan ancha oldinlab ketdi. 1942-yili Chikagoda En- riko Fermi ilk atom reaktorini yaratdi. Birinchi atom bombasi 1945-yil AQSHning Nyu-Meksiko shtatidagi poligonda portlatildi."
            },
            {
              "id": 4,
              "page": 13,
              "title": " MAVZU. 1918 – 1939-YILLARDA BUYUK BRITANIYA",
              "desc": " Iqtisodiy rivojlanish va ijtimoiy harakatlar. Birinchi jahon urushi Buyuk Britaniyaning hukmron doiralariga katta siyosiy g‘alaba va obro‘ olib keldi, mustamlaka imperiyasi yanada kengaydi, katta reparatsiya olindi. Ammo bu g‘alaba Buyuk Britaniya uchun juda qimmatga tush- di. Urushdan oldin kreditor (qarz beruvchi) bo‘lgan Buyuk Britaniya AQSHdan va o‘z dominionlaridan qarzdor bo‘lib qoldi. Iqtisodiy o‘sish sur’atlari juda past bo‘lib, inqiroz va turg‘unlik odatiy holga aylandi.Ish tashlash harakati jiddiy tus oldi. Ishchilar ish haqining oshirilishi va ish kunining qisqartirilishini talab qildilar. Shunday sharoitda shaxtyor- lar ish haqining kamaytirilishi Bu- yuk Britaniya tarixidagi eng katta ijtimoiy mojarolardan biri – 1926-yil mayda ishchilarning umumiy ish tashlashini keltirib chiqardi.Jahon iqtisodiy inqirozi Buyuk Britaniya iqtisodiyotiga juda katta ta’sir qilmadi. 1934-yildan boshlab mamlakat inqirozdan chiqa bosh- ladi. 1937-yili Buyuk Britaniya sa- noatning asosiy sohalari bo‘yicha jahon iqtisodiy inqirozidan oldingi ko‘rsatkichlarga yetib oldi.Sanoat mahsulotlari ishlab chiqa- rishning o‘sishi, asosan, uy-joy quri- lishining keskin oshishi va sanoat- ning  avtomobilsozlik,  samolyotsozlik,dvigatellar  va  radioapparaturalar  ishlab  chiqarish  kabi  yangi  sohalario‘sishi  hisobiga  yuz  berdi.Buyuk  Britaniya  iqtisodining  tiklanishida  harbiy  sanoatning  jadal rivojlanishi ham katta rol o‘ynadi."
            },
            {
              "id": 5,
              "page": 17,
              "title": " MAVZU. 1918 – 1939-YILLARDAFRANSIYA",
              "desc": " Iqtisodiy rivojlanish. Birinchi jahon urushini Fransiya g‘alaba bilan yakunladi. U o‘zining ashaddiy dushmani bo‘lgan Germaniyani tor-mor qildi, qit’ada boshqa jiddiy raqibi qolmadi. Ammo bu g‘alaba fransuz xalqiga juda qimmatga tushdi. Bevosita urush harakatlari bo‘lib o‘tgan Fransiyahududininguchdanbirqismidagisanoatkorxonalarivayron qilindi. Pul keskin qadrsizlandi, Fransiya AQSHdan qarzdor bo‘lib qoldi. Urush qishloq xo‘jaligi, sanoat va kredit tizimiga jiddiy zarar yet- kazdi, Fransiya dunyodagi kreditorlik pozitsiyasini qisman yo‘qotdi. Kapi- talning katta qismi kredit sohasidan ishlab chiqarish sohasiga ko‘chdi. Versal shartnomasiga binoan Fransiya Elzas va Lotaringiyani qayta- rib oldi, 15 yilga Saar ko‘mir havzasini egalladi, Germaniya mustamla- kalari hisobiga o‘z imperiyasini kengaytirib oldi. Germaniya Fransiyagakatta  reparatsiya  to‘ladi.Bularning hammasi 1920-yillari sanoatning o‘sishi uchun qulay sharoit yaratdi. Sanoatning avtomobilsozlik, samolyotsozlik, neftni qayta ishlash, kimyo sanoati kabi yangi turlari paydo bo‘ldi. Ayni paytda qishloq xo‘jaligi turg‘unlik holatini boshdan kechirayotgan bo‘- lib, mahsulot yetishtirish urushdan oldingi holatida edi."
            },
            {
              "id": 6,
              "page": 21,
              "title": " MAVZU. 1918 – 1939-YILLARDAAMERIKA QO‘SHMA SHTATLARI",
              "desc": "Iqtisodiy rivojlanish va ijtimoiy muammolar. Urushga boshqa davlatlardan keyin qo‘shilgan, harbiy harakatlardan uzoqda joylash- gan AQSH ancha kam qo‘shin yo‘qotdi, ammo urushda ishtirok etish Amerika biznesi uchun juda katta foyda keltirdi.Dunyo xaritasida Amerika Qo‘shma Shtatlari.Urushdan oldin Yevropadan qarzdor bo‘lgan AQSH endi uning kreditoriga aylandi. Urushdan keyin AQSH qashshoqlashgan va vay- ron bo‘lgan Yevropadan olimlar va ilmiy kashfiyotlarni yig‘ib oldi, yangi ixtirolarni ishlab chiqarishga joriy qildi, yangi texnika va texnologiyalarning ajoyib muvaffaqiyatini namoyish etdi. 1924 – 1929-yillari jadal rivojlangan AQSH iqti- sodiy jihatdan dunyoning eng rivojlangan mamlakati- ga aylandi. AQSHda iqtisodning eng yangi soha- lari: elektrotexnika, kimyo, aviatsiya, neft sanoati, avtomobilsozlik, kino sanoati, radiotexnika jadal rivojlandi. Kir yuvish mashinalari, sovitkichlar, foto- apparatlar, patefon va radiopriyomniklar ommaviy ishlab chiqarila boshlandi. 1920-yillar oxiriga kelib har  ikki  amerikalikning  bittasida  radiopriyomnik  boredi. Shu yillari yo‘lovchi aviatsiyasi davri boshlandi."
            },
            {
              "id": 7,
              "page": 26,
              "title": " MAVZU. 1918 – 1939-YILLARDAGERMANIYA",
              "desc": " Germaniya inqilobi. Germaniya Bi- rinchi jahon urushida mag‘lubiyatga uch- radi. Urushdan keyin bu yerda inqilobiy voqealar sodir bo‘ldi. Inqilob harbiy dengizchilarning Kil shahridagi qo‘zg‘o- lonidan boshlandi. 1918-yil noyabrga kelib g‘alayonlar Germaniyaning barcha yirik shaharlarini qamrab oldi. Noyabr inqilo- bi g‘alaba qozonib, Germaniya respublika deb e’lon qilindi. Fridrix Ebert boshchili- gida yangi hukumat tuzildi.Ta’sis majlisiga o‘tkazilgan saylovlarda asosiy o‘rinlarni liberal va konservativ partiyalar vakillari egalladi.1919-yil 31-iyul kuni Veymar shahrida Ta’sis majlisi inqilobiy om- maning demokratik talablarini qoniqtiruvchi konstitutsiyani qabul qildi. Germaniya tarixida yangi – Veymar respublikasi davri boshlandi.Rur inqirozi. 1923-yili fransuzlar Germaniyaning Rur viloyatiga bostirib kirdi. Rur inqirozi Germaniyaning o‘zida ham siyosiy norozi- liklarni keltirib chiqardi. 1923-yil oxirida Yevropa mamlakatlari ichi- da eng qadrsiz pul Germaniyada edi.Rur inqirozidan so‘ng reparatsiya va Yevropa qarzlari muammosini hal qilishning yechimi si- fatida «Daues rejasi» qaralayotgan edi. 1924-yili amerikalik bankir Charlz Daues boshchiligidagi qo‘mita xalqaro moliya-kredit va savdo munosa- batlarini tiklashning strategik rejasini qabul qildi. Bu reja kapitalistik dunyoda iqtisodiy va siyosiy barqarorlikni ta’minlash uchun asos bo‘ldi. Charlz Dauesga Nobel mukofoti berildi."
            },
            {
              "id": 8,
              "page": 31,
              "title": "MAVZULAR.  1918 – 1939-YILLARDA  SSSR ",
              "desc": "1917-yil noyabrda Vladimir Lenin boshchiligida bolsheviklar huku- mati – Xalq komissarlari soveti tuzilgandan so‘ng Rossiyaning boshqa hududlarida ham sovet hokimiyatini o‘rnatish boshlandi.Joylarda  mahalliy  hokimiyatlar  tarqatib  yuborildi,  boshqaruv to‘liq sovetlar qo‘liga o‘tdi. Yangi hokimiyatning muhim jihati shunda ediki, u partiyaviy rahbarlik asosida shakllandi va bolshe- viklar partiyasining har qanday qarori sovet qarori sifatida qabul qilinishi mumkin bo‘ldi. Partiya va davlat tashkilotlarining birikib ketishi  shakllanayotgan  bolsheviklar  totalitar  tuzumining  muhim belgisi edi.1918-yil martida Brest-Litovsk shahrida Germaniya bilan sulh tuzildi. Sulh natijasida bolsheviklar vaqtincha nafasni rostlash imko- niyatiga ega bo‘lsa-da, Rossiya 56 mln. kishi yashaydigan juda katta hududidan va Qora dengiz flotidan ayrildi, Germaniyaga katta kon- tributsiya to‘lash majburiyatini oldi. Tarixchilarning ta’kidlashicha, sulh Rossiyaning butun tarixi davomidagi eng sharmandali shartnoma bo‘ldi.Fuqarolar urushi. Ko‘pchilik ta- rixchilar Rossiyada Fuqarolar urushi 1917-yil oktabrda bolsheviklar hoki- miyatga kelishi bilan boshlandi va 1922-yil kuzda Uzoq Sharqda «Oq gvardiya»ning tor-mor qilinishi bilan yakunlandi, deb hisoblaydi."
            },
            {
              "id": 9,
              "page": 38,
              "title": "1918 – 1939-YILLARDA ITALIYA VA ISPANIYA ",
              "desc": " Italiya Birinchi jahon urushida uncha katta talafot ko‘rmadi. Aksin- cha u Avstriya-Vengriya yerlarining bir qismini egallab, o‘z hududini anchakengaytiriboldi.Ammoshungaqaramasdan,urushdanso‘ng mamlakat ichki ziddiyatlar girdobida qoldi. Bu ziddiyatlarning asosini ko‘p sonli ishsizlar va iqtisodiy inqiroz tashkil qildi. O‘ta dolzarb is- lohotlarni amalga oshirish uchun hukumat yetarli kuchga ega emasdi. Fashistlarninghokimiyatgakelishi.Umumiyinqiroz sharoitida BenitoMussolini boshchiligida1919-yilningmart oyidatuzilgan fashistlarpartiyasifaollashibketdi.1921-yilifashistlarharakatibir qadar rasmiy tus olib, davlatning siyosiy qudratini mustahkamlashga qaratilganmillatchiliktashviqotiniolib bordi.Ularnimamlakatdagi jiddiy  kuchlar  qo‘llab-quvvatladi,  aholining  ham  katta  qismi  xayrixoh-lik  bildirdi.Fashistlar 1921-yilgi parlament saylovlarida 36 ta o‘ringa ega bo‘ldi. 1922-yil oktabrda fashistik guruhlarning mashhur Rimga yurishidan so‘ng qirol Viktor Emmanuil III Mussolinini hukumat boshlig‘i etib tayinladi. Ispaniya. Bu yerda voqealar rivoji boshqacha yo‘ldan bordi. Dast- lab Ispaniya o‘zining Birinchi jahon urushidagi neytraliteti bilan boshqa Yevropa davlatlaridan keskin ajralib turdi. Shunga qaramas- dan, Ispaniya urushdan keyin ham ancha vaqt G‘arbiy Yevropaning eng qoloq davlatlaridan biri bo‘lib qolaverdi. Dunyoni larzaga keltir- gan Rossiyadagi inqilobiy voqealar bu davlatga ham ta’sir ko‘rsatdi. Kataloniya va boshqa viloyatlarda boshlangan ish tashlashlar huku- matni islohotlar o‘tkazishga, 8 soatlik ish kuni, ijtimoiy sug‘urta, ish haqi va pensiyalarning oshirilishi to‘g‘risida qonunlar qabul qilishga majbur qildi."
            },
            {
              "id": 10,
              "page": 43,
              "title": "1918 – 1939-YILLARDA LOTIN AMERIKASI MAMLAKATLARI ",
              "desc": " Janubiy Amerikada va Shimoliy Amerikaning janubiy qismida joylashgan davlatlar, shuningdek, Karib dengizidagi orollar Lotin Amerikasi mamlakatlari deb ataladi. Bu nom yevropaliklar bosqini- dan keyin mahalliy aholi lotin tilidan kelib chiqqan ispan, portugal, fransuz tillarida so‘zlasha boshlaganlari uchun berilgan.Bugun xalqaro hujjatlarda bu hudud «Lotin Amerikasi va Karib havzasi mamlakatlari» deb yuritiladi.1920-yillarda mintaqadagi holat. Birinchi jahon urushi Lotin Amerikasi mamlakatlarida kapitalizm rivojlanishi jarayonini yanada jadallashtirdi.Yevropadan keladigan tovarlar va kapital oqimi vaqtincha kamaydi. Ja- hon bozorida mintaqa mamlakatlarida ishlab chiqarilgan oziq-ovqat va xom ashyo mahsulotlarining narxi, xususan, Kuba shakarining narxi 11 marta osh- di. Bu kapitalning jamg‘arilishi, ma- halliy ishlab chiqarishning rivojlanishi, iqtisodning nisbatan barqaror sur’atlar bilan o‘sishi uchun imkoniyat yaratdi. Agroeksport, tog‘-kon va yengil sanoat tarmoqlari   jadal   rivojlandi.   Ammo1920-yillar oxiriga kelib ekstensiv asosda iqtisodni samarali rivojlan- tirishning imkoniyatlari tugadi."
            }
          ]
        },
        {
          "classId": 3,
          "classLevel": 9,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "Aziz o‘quvchilar! Siz mustaqil O‘zbekistonning farzandlarisiz. Jahon tarixini o‘r- ganishda davlatimiz rahbari Islom Karimovning o‘z tarixini bilish jahon tarixi, umumbashariy taraqqiyot qonuniyatlarini o‘rganish- ning asosi ekanligi haqidagi fikrini yodda tutishingiz zarur. Siz o‘rta umumta’lim maktabining oxirgi, 9-sinfiga qadam qo‘ydingiz. Maktabni bitirgach, akademik litsey yoki kasb-hunar kollejiga kirib o‘qiysiz. Siz 8-sinfda „Jahon tarixi“ bo‘yicha XVI asr boshlaridan XIX asrning ikkinchi yarmigacha bo‘lgan davrni o‘rgandingiz. Endi jahon tarixining eng qiziqarli, shu bilan birga, murakkab davrini o‘rganasiz. Chunki bu davrda dunyoda katta o‘zgarishlar yuz berdi. Bu davrning asosiy belgisi — ishlab chiqa- rishda monopolistik kapitalizm qaror topdi. Turli xil sindikatlar, kartellar, konsernlar yuzaga keldi. Ishlab chiqarish markazlashdi, xorijga kapital chiqarish boshlandi. Bir qator davlatlar oldingi 100 yillarda erisha olmagan taraqqiyotga erishdilar. Bozor iqtisodi jamiyati taraqqiyotiga xos bo‘lgan bunday o‘zgarishlarni hozirda bizning mamlakatimiz o‘z boshidan kechirmoqda. Jamiyat taraqqiyotining tarixiy tajribalari- dan bugungi kunda foydalanish, yo‘l qo‘yilgan xatolarni takrorlamaslik mamlakatimizda buyuk jamiyat qurishni va jahon hamjamiyatida munosib o‘rin egallashimizni tez- lashtiradi. Shu sababli rivojlangan mamlakatlar tarixini chuqur o‘rganib, uning ijobiy tomonlaridan respublika- miz ravnaqi uchun foydalanish har birimizning muqad- das burchimizdir. Ushbu darslik tarixni yangi davrlashtirish asosida tayyorlangan bo‘lib, XIX asrning 70-yillaridan 1918-yilgacha bo‘lgan davrni o‘z ichiga oladi. Darslikda tarixni yangi davrga moslab, sinfiy hamkorlikni mus- tahkamlashga, insonparvarlashtirishga, gumanitar g‘oyalarni ken- gaytirishga, urushlarning insoniyat dushmani ekanligini ko‘r- satishga, tinchlik va ijtimoiy taraqqiyot dunyo xalqlarining oso- yishta yashashi uchun zarurat ekanligini ochib berishga harakat qilindi."
            },
            {
              "id": 2,
              "page": 4,
              "title": "XIX asr oxiri — XX asr boshlarida kapitalizm tarqqiyotida yuz bergan o’zgarishlar",
              "desc": "XIX asr oxiri — XX asr boshlarida kapi- talizm taraqqiyotida yangi bosqich — mo- nopolistik kapitalizm deb ataluvchi bosqich qaror topdi. Monopolistik kapitalizm — bu kapitalizmning iqtisodiy hayotida monopoliyalar vujudga kelgan, moliya oligarxiyasi shakl- langan, siyosiy hayotda esa ularning jamiyat hayoti ustidan hukm- ronligi o‘rnatilgan bosqichidir. Kapitalizmning bu bosqichi erkin kapitalizm bosqichidan quyi- dagi asosiy belgilari bilan ajralib turadi: 1. Ishlab chiqarish sohasida monopoliyalarning vujudga kel- ganligi. Monopoliya — ishlab chiqarish yoki savdoning bir sohasida yakka hukmronlikni egallab olgan ulkan korxona yoki shunday korxonalar birlashmasidir. Monopoliyalar industrial davlatlarning barchasida vujudga kelgan edi. Ular kartel, sindikat, trest va konsern shaklida mamlakat xo‘jaligining u yoki bu sohasida hukmron edilar. Masalan, 1893- yilda Germaniyada tashkil topgan Reyn-Vestfaliya ko‘mir sindikati mamlakatda qazib olinadigan va sotiladigan ko‘mirning asosiy qis- mini o‘z qo‘lida to‘plagan. XIX asr oxirida Germaniyada monopoliyalar soni 250 tadan ortiq bo‘lgan bo‘lsa, AQSHda esa 185 ta monopoliya faoliyat ko‘rsatgan."
            },
            {
              "id": 3,
              "page": 11,
              "title": "Industrial sivilizatsiya",
              "desc": "„Industrial sivilizatsiya“ atamasi o‘rnida „industrial jamiyat“atamasi ham ishlatiladi va ular bir xil ma’noni anglatadi.Industrial sivilizatsiyaning belgilaridan biri — shaharlarningjuda tez o‘sishi bo‘ldi. Bu, birinchidan, qishloq xo‘jaligida texnikaniqo‘llash natijasida bir qism qishloq aholisining ortiqcha kuch bo‘lib, ishsiz qolishi, ularning ish izlab shaharlarga kelishi hisobiga yuzberdi.Ikkinchidan, kichik shaharlarda mayda savdogarlar va hunar-mandchilik ishlab chiqarishining pasayib ketishi, shuningdek, trans-portdagi o‘zgarishlar, temiryo‘llar qurilishi, sanoat markazlariningyirik shaharlarga ko‘chishi hisobiga yuz berdi. Odamlar ish axtaribva kun ko‘rish uchun turar joylarini o‘zgartirishga majbur bo‘ldi.Yuz yillar davomida o‘z yerlarida yashab kelgan aholi harakatgakeldi. Endi ular o‘z yerlarini tashlab shaharlarga keta boshladi.Qishloqdan ketish immigratsiyani ham vujudga keltirdi. Endi odamlarboshqa mamlakatlarga ham keta boshladilar. Lekin ko‘chishning kat-ta qismini o‘z mamlakatlari ichidagi migratsiya tashkil etdi.Industrial rivojlanish jarayonida shaharlaralohida ahamiyat kasb eta boshladi. Sanoa"
            },
            {
              "id": 4,
              "page": 16,
              "title": "Fransiya—Prussiya urushi va uning yakunlari",
              "desc": "XIX asrning 60-yillari ikkinchi yarmidan boshlab Fransiya imperatori Napoleon III mavqeyiga putur yetdi. Bunga sabab—Fran- siyaning iqtisodiy taraqqiyot bo‘yicha o‘z qo‘shnilari bo‘lgan Buyuk Britaniya va Germaniyadan tobora orqada qolayotganligi bo‘ldi. Ayni paytda, Fransiya tashqi siyosatda ham muvaffaqiyatsiz- likka uchray boshladi. Chunonchi, u Prussiyaning Germaniyani birlashtirishiga to‘sqinlik qila olmay qoldi. Germaniya yagona dav- latga birlashadigan bo‘lsa, Fransiyaning xalqaro maydondagi obro‘- siga jiddiy zarar yetar va Yevropadagi ikkinchi davlatdek mavqeyi barham topar edi. Fransiya hukmron doiralari 1860-yildagi Buyuk Britaniya-Fran- siya savdo shartnomasidan ham norozi edi. Chunki, ingliz tovarlari- ning Fransiyaga ko‘plab kiritilishi fransuz tovarlari bilan raqobatni kuchaytirmoqda edi. Bundan tashqari, mamlakatda ishsizlik, qim- matchilik mehnatkashlarning doimiy yo‘ldoshi bo‘lib qolgandi. Bu hodisa ishchilarning keskin noroziligini vujudga keltirdi. Bunday sharoitda, Napoleon III uchun Prussiyaga qarshi g‘o- libona urush zarur edi. Bu urush Fransiyaning, shuningdek, Napoleon III ning ham mavqeyini tiklagan bo‘lardi. Buning uchun esa urushda g‘alaba qozonish, Germaniyaning birlashishiga yo‘l qo‘ymaslik va Germaniyaning ba’zi hududlarini bosib olish zarur edi."
            },
            {
              "id": 5,
              "page": 18,
              "title": "Fransiyada Uchinchi Respublika va 1871-yil 18-mart davlat to‘ntarishi",
              "desc": "XIX asr so‘nggi choragida Fransiyaning iqtisodiy taraqqiyoti sekinlashdi. Chunon- chi, dunyoda sanoat ishlab chiqarish hajmi bo‘yicha ikkinchi o‘rindan to‘rtinchi o‘ringa tushib qoldi. Xo‘sh, Fransiya iqtisodiy taraqqiyoti sekinlashuvining asosiy sabablari nimalardan iborat edi? Avvalo, Fransiyaning hamon mayda tovar ishlab chiqaruvchi- lar davlati bo‘lib qolayotganligi import hajmining eksportdan ortiq bo‘lishiga olib kelgan. Bu esa, o‘z navbatida, ichki bozorning Frankfurt sulh shartnomasi Iqtisodiy ahvol cheklanishiga sabab bo‘lgan. Ikkinchidan, Fransiya tabiiy boyliklari kam davlat edi. Uchinchidan, Prussiya bilan bo‘lgan urush Fran- siyaga juda katta moddiy talafot yetkazdi. Urushda Fransiya 13 mlrd. frank zarar ko‘rdi. Ayni paytda, Germaniyaga 5 mlrd. frank tovon to‘lashga majbur bo‘ldi. Òo‘rtinchidan, ichki siyosiy vaziyatning beqarorligi mamlakat iqtisodiy ahvoliga katta salbiy ta’sir ko‘rsatdi. Beshinchidan, dehqonlar xarid quvvatining pastligi sanoat ishlab chiqarishi o‘sishiga salbiy ta’sir ko‘rsatayotgan edi. Oltinchidan, Fransiya chetga ko‘p kapital chiqarib yuborgan edi. Bu sarmoya- dorlarga katta foyda keltirardi. Shuning uchun ham sarmoyadorlar (kapitalistlar) o‘z sarmoyalarini (kapitallarini) mamlakat ishlab chiqarishiga emas, balki chetga (katta foiz evaziga, albatta) chiqa- rishni afzal ko‘rgan. Prussiya bilan urush tugagach, hukmron doiralar o‘rtasida hokimiyat uchun kurash kuchayib ketdi. Ularni shartli ravishda ikki guruhga bo‘lish mumkin edi. Birinchisi — monarxiya tarafdorlari, ikkinchisi — respublika tarafdorlari edi. 1873-yilda Germaniyaga tovon to‘lab bo‘lindi. Nihoyat, Ger- maniya o‘z qo‘shinlarini Fransiyadan olib chiqib ketdi. Respublikachilar mamlakat parlamentida (Milliy Majlis) ozchi- likni tashkil etganlar. Biroq, Fransiya aholisining katta qismi monar- xiyaga qarshi bo‘lganligi ularga madad bo‘lardi. Milliy Majlisda ko‘pchilikni tashkil etgan monarxiyachilar o‘z nomzodlarini ikki marta prezidentlikka saylagan bo‘lsalar-da, monarxiyani tiklashga urinishi natijasiz tugadi. Keskin ichki siyosiy kurashda oxir-oqibatda respublikachilar g‘alaba qozondi. 1875-yil Uchinchi Respublika Konstitutsi- yasi qabul qilindi. Unga ko‘ra, prezident- lik lavozimi saqlab qolindi. Ayni paytda ikki palatali (Deputatlar palatasi va Senat) parlament (Milliy Majlis) tashkil etildi. Uning vakolat muddati 4 yil etib belgilandi. Parlament har ikki palatasining qo‘shma yig‘ilishi 7 yil mud- datga mamlakat prezidentini saylar edi. Ijroiya hokimiyat prezi- dentga va hukumatga tegishli edi. Prezident vazirlarni tayinlash, respublika nomidan tashqi siyosat yuritish, shuningdek, urush e’lon qilish va sulh tuzish, umumiy afv e’lon qilish kabi vakolat- larga ega edi. "
            },
            {
              "id": 6,
              "page": 21,
              "title": "XIX asr so‘nggi choragida Fransiyaning iqtisodiy taraqqiyoti sekinlashdi. Chunon- chi, dunyoda sanoat ishlab chiqarish hajmi bo‘yicha ikkinchi o‘rindan to‘rtinchi o‘ringa tushib qoldi. Xo‘sh, Fransiya iqtisodiy taraqqiyoti sekinlashuvining asosiy sabablari nimalardan iborat edi? Avvalo, Fransiyaning hamon mayda tovar ishlab chiqaruvchi- lar davlati bo‘lib qolayotganligi import hajmining eksportdan ortiq bo‘lishiga olib kelgan. Bu esa, o‘z navbatida, ichki bozorning Frankfurt sulh shartnomasi Iqtisodiy ahvol cheklanishiga sabab bo‘lgan. Ikkinchidan, Fransiya tabiiy boyliklari kam davlat edi. Uchinchidan, Prussiya bilan bo‘lgan urush Fran- siyaga juda katta moddiy talafot yetkazdi. Urushda Fransiya 13 mlrd. frank zarar ko‘rdi. Ayni paytda, Germaniyaga 5 mlrd. frank tovon to‘lashga majbur bo‘ldi. Òo‘rtinchidan, ichki siyosiy vaziyatning beqarorligi mamlakat iqtisodiy ahvoliga katta salbiy ta’sir ko‘rsatdi. Beshinchidan, dehqonlar xarid quvvatining pastligi sanoat ishlab chiqarishi o‘sishiga salbiy ta’sir ko‘rsatayotgan edi. Oltinchidan, Fransiya chetga ko‘p kapital chiqarib yuborgan edi. Bu sarmoya- dorlarga katta foyda keltirardi. Shuning uchun ham sarmoyadorlar (kapitalistlar) o‘z sarmoyalarini (kapitallarini) mamlakat ishlab chiqarishiga emas, balki chetga (katta foiz evaziga, albatta) chiqa- rishni afzal ko‘rgan. Prussiya bilan urush tugagach, hukmron doiralar o‘rtasida hokimiyat uchun kurash kuchayib ketdi. Ularni shartli ravishda ikki guruhga bo‘lish mumkin edi. Birinchisi — monarxiya tarafdorlari, ikkinchisi — respublika tarafdorlari edi. 1873-yilda Germaniyaga tovon to‘lab bo‘lindi. Nihoyat, Ger- maniya o‘z qo‘shinlarini Fransiyadan olib chiqib ketdi. Respublikachilar mamlakat parlamentida (Milliy Majlis) ozchi- likni tashkil etganlar. Biroq, Fransiya aholisining katta qismi monar- xiyaga qarshi bo‘lganligi ularga madad bo‘lardi."
            },
            {
              "id": 7,
              "page": 23,
              "title": "Fransiyaning ichki siyosati",
              "desc": "Respublika hukumati ichki siyosatda bir qator muhim tadbirlarni amalga oshirdi. Chunonchi, 1881—1882-yilarda ta’lim to‘g‘risida qonun qabul qilindi. Unga ko‘ra, maktab cherkovdan ajratildi. Òa’limning dunyoviyligi ta’minlandi. 13 yoshgacha bo‘lgan bolalar uchun majburiy bepul ta’lim joriy etildi. Maktablarda ta’lim maxsus davlat dasturlari asosida olib boriladigan bo‘ldi. Oliy pedagogik bilim yurtlarida o‘qituvchi kadrlar tayyorlash yo‘l- ga qo‘yildi. Majburiy ta’lim dasturida o‘g‘il bolalar uchun gimnastika predmeti majburiy deb belgilandi. Bundan o‘smirlarni bo‘lajak harbiy xizmatga jismonan yetuk qilib tayyorlash maqsadi ko‘zda tutilgan edi. Qiz bolalar uchun litseylar ochildi. Maxsus oliy o‘quv yurtlarida ayol o‘qituvchilar tayyorlana boshlandi. 1884-yilda kasaba uyushmalarining erkin faoliyatiga hamda ish tashlashga ruxsat etuvchi qonun qabul qilindi. Ishchilar o‘z kasaba uyushmalari va mehnat birjalarini tuzdi. Bu birjalar ishsizlar haqida, ularning turmushi haqida g‘amxo‘rlik qila boshladi. "
            },
            {
              "id": 8,
              "page": 26,
              "title": "Fransiyaning tashqi siyosati",
              "desc": " XIX asrning 70-yillaridan boshlab, Fran- siyaning xalqaro maydondagi ahvoli zaif- lashdi. Prussiya bilan bo‘lgan urushdagi qaq- shatqich mag‘lubiyatdan so‘ng Fransiyaning kontinental Yev- ropadagi yetakchi davlat mavqeyi yo‘qqa chiqdi. Endi Fransiya Germaniya hujumidan xavfsirab yashaydigan davlatga aylandi. Ayniqsa, 1879-yilda Germaniya va Avstriya-Vengriya o‘rtasida tuzilgan ittifoqchilik shartnomasi Fransiyaning xalqaro mavqeyini yanada yomonlashtirib yubordi. Shunday bo‘lsa-da, Fransiya boshqa buyuk davlatlar o‘rtasidagi nizolardan ustalik bilan foydalanib, o‘z mustamlakachilik imperiyasini tobora kengaytirish imkoniga ega bo‘ldi. Mamlakatning xalqaro ahvoli XIX asrning 70-yillari oxiridan boshlab mustamlakachilik siyosatining yo‘nalishi av- val bosib olingan mustamlaka hududlarini o‘zlashtirish va yangi mustamlakalar bosib olishga qaratildi."
            },
            {
              "id": 9,
              "page": 29,
              "title": "XIX asr oxiri — XX asr boshlarida Germaniya. Imperiyaning tashkil topishi",
              "desc": "Yuqorida aytilganidek, Fransiya—Prussiya urushi davom etayotgan bir paytda, ya’ni 1871-yilning 18-yanvarida barcha german davlatlarining monarxlari Versalda to‘planib, Prussiya qiroli Vil- gelm I ni Germaniya imperatori deb e’lon qildilar. Bu Ger- maniyaning ikkinchi marta imperiya deb e’lon qilinishi edi. (Eslang: Germaniya qachon 1-marta imperiya deb e’lon qilingan edi?) Shunday qilib, butun Germaniya hududining 2/3 qismida joy- lashgan, aholisining esa 60%i yashayotgan Prussiya monarxiyasi yetakchiligida Germaniyaning birlashuvi tugallandi. Yagona va yaxlit Germaniya imperiyasi barpo etildi. 1871-yil imperiya reyxstagi umumgerman konstitutsiyasini qabul qildi. Germaniya imperiyasi ittifoqchilar davlati bo‘lib qoldi. Elzas-Lotaringiya imperiya tarkibiga hokim (shtatgalter) tomoni- dan idora qilinadigan „maxsus imperiya viloyati“ bo‘lib kirdi. Ho- kimni imperatorning o‘zi tayinlardi. Imperiyaga kirgan ayrim dav- latlar o‘z konstitutsiyalari va parlamentlarini (landtaglarini) saqlab qoldi."
            },
            {
              "id": 10,
              "page": 32,
              "title": "Imperiyaning ichki siyosati",
              "desc": "German hukumati ichki siyosatda Germa- niyani prusslashtirish masalasiga alohida e’tibor berdi. Imperiya konstitutsiyasida Prussiya qirollarigina Ger- maniya imperatori bo‘la olishining qayd etilganligi buning yorqin dalili edi. Polsha va Fransiyaning Germaniyaga o‘tgan hududlarida ham prusslashtirish siyosati yuritildi. Polyak tilida o‘qitiladigan maktablar yopib qo‘yildi. Bunga javoban 1906-yilda 100 mingdan ortiq polyak bolalari maktabga borishdan bosh tortdi. Bismark hukumati katolik cherkovining ta’sirini kamaytirishga qaratilgan qator tadbirlarni amalga oshirdi. Bu o‘rinda 1872-yilda qabul qilingan maxsus qonun muhim ahamiyatga ega bo‘ldi. Unga ko‘ra, maktab cherkovdan ajratildi. Ruhoniylarning siyosiy tashviqot olib borishi taqiqlandi. Ruhoniy kadrlar tayyorlash, ularni vazifalarga tayinlash ishlarini davlat o‘z qo‘liga oldi. Fuqarolik holati aktlarini qayd etish ishlari ham (tug‘ilish, nikoh, vafot etganlik) davlat idoralari ixtiyoriga o‘tkazildi. Bismarkning ka- tolik cherkovi ta’siriga qarshi qo‘llagan tadbirlari „ Kulturkampf“ (Madaniyat uchun kurash) degan nom oldi."
            },
            {
              "id": 11,
              "page": 35,
              "title": "Imperiyaning tashqi siyosati",
              "desc": "Buyuk Britaniya va Fransiya juda katta mustamlakalarga ega bo‘lgan holda Germa- niya bunday mustamlakalarga ega emas edi. Germaniya hukmron doiralari „quyoshning hammaning yelkasiga birday nur sochishi“ talabi bilan chiqdilar. Bismark Germaniyaning xalqaro maydondagi ta’sirini ku- chaytirishni o‘z oldiga vazifa qilib qo‘ydi. Yangidan tashkil etilgan fransuz qo‘shinini qasos oluvchi qo‘shin, deb hisoblay boshladi. Shu tufayli, Fransiya hali batamom mustahkamlanib olmasdan, u bilan urush qilishga shoshilmoqda edi. Biroq, Rossiya bilan Buyuk Britaniya Germaniyaning kuchayib ketishini istamas edi. Bismark esa ikki frontda urush qilishdan qo‘rqardi. Shunday sharoitda u o‘ziga ittifoqdosh izladi va tez orada uni topdi ham. Bu Avstriya-Vengriya imperiyasi edi. 1879-yilda Germaniya Avstriya- Vengriya bilan ittifoq tuzdi. 1882-yilda Avstriya-Vengriya-Germaniya ittifoqiga Italiya qo‘shildi. Bunga Italiyaning Fransiya bilan muno- sabati keskinlashishi sabab bo‘ldi. Chunonchi, Fransiya 1881-yilda Italiya da’vo qilib yurgan Òunisni bosib olgan edi. Avstriya-Vengriya imperiyasi esa bu vaqtda Bolqon yarimorolida Rossiya bilan raqobatlashmoqda edi. Shunday qilib, uchta maslakdosh kuchlar birlashib, 1882-yili harbiy ittifoq — „Uchlar ittifoqi“ni tuzishga erishdi. Shu tariqa Germaniya Fransiya va Rossiyaga qarshi qara- tilgan koalitsiyaga bosh bo‘lib oldi. Bismark Rossiyani o‘z siyosiy rejalarini amalga oshirish yo‘lidagi asosiy g‘ov deb bilardi."
            },
            {
              "id": 12,
              "page": 39,
              "title": "XIX asr oxiri — XX asr boshlarida Buyuk Britaniyaning siyosiy va iqtisodiy ahvoli",
              "desc": "Buyuk Britaniya bu davrda ham konsti- tutsiyaviy monarxiya edi. Biroq, Germa- niyadan farqli o‘laroq, bu davlatda qirol hokimiyati asosiy rol o‘ynamasdi. Buyuk Britaniya qirollari davlat boshlig‘i edi, xolos. Ular davlatni amalda boshqarmaganlar. Davlatning ichki va tashqi siyosatini boshqarish parlament tuzadigan hukumat qo‘lida edi. Buyuk Britaniyada qaysi partiya parlament saylovida g‘olib chiq- sa, shu partiya hukumat tuzar edi. Mamlakatda kuchli ikki partiya- viy tizim qaror topgan bo‘lib, ularning biri Konservatorlar, ikkinchisi esa Liberallar partiyasi deb atalardi. Konservatorlar partiyasining asosiy tayanchi yirik zamindorlar va anglikan cherkovi, Liberallar partiyasining asosiy tayanchi esa o‘rta sinf vakillari edi."
            }
          ]
        },
        {
          "classId": 2,
          "classLevel": 8,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": " Kirish",
              "desc": " Aziz  o‘quvchi!  Siz  VII   sinfda   O‘rta   asrlar   tarixini   o‘rgandingiz. O‘rta asrlarda ham kishilar qishloq xo‘jaligiga tayangan  iqtisodiyot  va jamiyatda  shakllangan  an’analar  asosida  hayot  kechirishni  davom   et- tirdilar.  Shu  sababli   insoniyat   tarixining   bu   davri   agrar   sivilizatsiya yoki an’anaviy jamiyat deb ataladi. Bu  jamiyatda  kishilar  tabaqalarga bo‘linib yashaydi va qadimdan saqlanib  kelayotgan  an’anaviy  urf- odatlar, diniy tasavvurlar ushbu sivilizatsiyaning xarakterli tomonlari hisoblanadi. Agrar sivilizatsiya insoniyat tarixida neolit davridan boshlanib,  XVIII  asrning   60-yillaridagi   sanoat   inqilobi   va   uning   aso- sida yangi jamiyat shakllanguncha davom etdi.Yangi davr boshlariga kelib, buyuk davlatlar o‘rtasida Yevropada hukmronlik uchun kurash qizib ketdi. Ayni paytda G‘arbiy Yevropa mamlakatlarida agrar jamiyatning yemirilishi,  yangi  sivilizatsiyaning shakllanish  jarayoni  kuzatildi.   Bu   jarayon   qariyb   to‘rt   asr   davom   etdi va Yangi davrning oxiriga kelib,  inson  o‘z  dunyoqarashi,  tasavvurlar olamining asosiy jihatlari bilan biz hozir  ko‘nikib  qolgan  holatga  keldi. Yuz  bergan  o‘zgarish  juda  ulkan  bo‘lib,  uni  insoniyat   tarixidagi   inqi- lobiy to‘ntarish – ibtidoiy  jamoadan  sivilizatsiyaga  o‘tish  bilan  teng- lashtirish mumkin."
            },
            {
              "id": 2,
              "page": 7,
              "title": "1-mavzu: BUYUK GEOGRAFIK KASHFIYOÒLAR VA ULARNING ÒARIXIY AHAMIYATI",
              "desc": " Geografik kashfiyotlarning sabablari. XV–XVII asrlarda yevropalik sayyohlar tomonidan Afrika, Amerika, Osiyo va  Okeaniyaga  dengiz yo‘llarining  ochilishi  va  bu  hududlarda  yangi  yerlarning  kashf  etilishi tarixda Buyuk geografik kashfiyotlar nomini olgan. Bu davrda fan va texnika taraqqiyotida yevropaliklar erishgan yutuqlar ularga yangi yerlarni ochish  va  o‘zlashtirish  imkonini  berdi. XV asr oxiriga kelib, okean to‘lqinlariga bardosh beruvchi, sha-molga qarshi suza oladigan yelkanli kema –  karavella  yaratildi,  ke- malarni boshqarish asboblari va san’ati ancha rivojlandi. Karavellalar Atlantika okeanidan xavfsiz suzib o‘ta oladigan ilk kemalar edi. Endi takomillashgan kompas, usturlob va dengiz xaritalariga ega bo‘lgan tajribali dengiz sayyohlari bu kemalarda uzoq masofalarga suzish im- koniyatiga ega bo‘ldi."
            },
            {
              "id": 3,
              "page": 13,
              "title": " YANGI DAVR BOSHLARIDA G‘ARBIY YEVROPA MAMLAKAÒLARIDA INDUSÒRIAL JAMIYATNING SHAKILLANISHI",
              "desc": " Yangicha iqtisodning shakllanishi. Buyuk  geografik  kashfiyotlardan so‘ng Amerikadan oltin, kumush va boshqa qimmatbaho metallar Yevropa bozorlariga ko‘plab keltirildi. Qirollar mamlakatda ishlab chi- qarilgan  mahsulotga nisbatan ancha ko‘p oltin va  kumush   tangalar zarb qildilar. Pul ko‘paygan sharoitda hunarmandlar va savdogarlar kasodga uchramaslik uchun o‘z tovarlarining  narxini  oshirishga  maj- bur bo‘ldi. Shu tariqa yuz  yillar  davomida  o‘zgarmasdan  kelgan  narx- navo  shiddat bilan o‘sa boshladi. Bu  jarayon   «narx-navo   inqilobi» deb ataldi. Yevropa mamlakatlarida odamlar yashash uchun pul topishning yangi yo‘llarini izlashga tushdi. Ko‘plab  oilalar  endi  ilga- rigidek natural xo‘jalik yurita olmasdan, mahsulotning bir qismini bozorda sotishga majbur bo‘ldi. Natijada, Yevropada tovar ishlab chiqaruvchi xo‘jaliklar, ya’ni bozorda sotishga mo‘ljallangan  mah- sulot ishlab chiqaruvchi xo‘jaliklar soni ko‘payib boradi Kapitalistik munosabatlarning paydo  bo‘lishi.  Bozor  munosabatlari jadal rivojlanayotgan Angliya, Niderland qirolligi va Fransiya kabi mamlakatlarda  savdogarlar  ulgurji  savdoga  katta   ehtiyoj   seza   boshladi. Ular  endi  vaqt-vaqti  bilan  o‘tkaziladigan  yarmarkalarga  mahsulot   olib borish o‘rniga, yirik  shaharlarda  tashkil  qilingan  va  birja  deb  atalgan maxsus joylarda o‘z mahsulotlarini  e’lon  qila  boshladi.  Shu  yerda xaridorlar   bilan   oldi-sotdi   shartnomasi   tuzilib,   mahsulot    kelishilgan joyga jo‘natilar edi.Birjalar  bilan   bir   qatorda,   zamonaviy   banklarning   paydo   bo‘lishi ham Yangi davr sivilizatsiyasining buyuk yutug‘i  bo‘ldi.  O‘rta  asrlarda banklar  rolini  pul   maydalaydigan  sarroflik  do‘konlari  bajarar  edi. XV asrda zamonaviy ko‘rinishdagi ilk bank  –  Genuyadagi  Avliyo Georgiy banki paydo bo‘ldi. "
            },
            {
              "id": 4,
              "page": 18,
              "title": " YEVROPADA    REFORMATSIYA ",
              "desc": " Reformatsiya  arafasida  Yevropa  jamiyati.  O‘rta  asrlarda  din  G‘ar- biy Yevropa jamiyati hayotida  kuchli  ta’sirga  ega  edi.  Ammo  davr oxiriga kelib, odamlar orasida mavjud diniy tartiblardan norozilik kuchaydi. Endi cherkov tartiblari ko‘plab yevropaliklarni qanoatlan- tirmay qo‘ydi. Cherkov marosimlari lotin tilida o‘tkazilib, bu til oddiy odamlar uchun tushunarsiz edi. Shuningdek,  ular  xristianlarning  mu- qaddas kitobi – Injilni ham  tushunmasdi.  Kun  kechirish  og‘ir  bo‘lib qolgan Yangi davr boshlarida dehqonlar va shaharlik kambag‘allar qiyinchilik bilan ishlab topgan  hamda  oilasini  boqishga  zo‘rg‘a  yeta- digan  pullarining bir qismini cherkov-u ruhoniylarga berishni  ista- masdi. Ruhoniylarning qimmatbaho kiyimlari va taqinchoqlari, cher- kovni bezashda qo‘llanilgan haykal hamda rasmlar pulning qadrini biladigan tejamkor tadbirkorlarning jahlini chiqarar edi. Ruhoniylar to‘plagan juda katta boyliklarning bir qismini indulgensiyalar – gu- nohlarni afv etganlik to‘g‘risida Rim papasining maxsus yorlig‘ini sotishdan  tushgan pullar tashkil  qilardi.   Puldor   kishilar,   hatto   hali qilib  ulgurmagan gunohlari uchun ham indulgensiyalar  sotib   olardi. Papa va kardinallar turli xil hiyla va nayranglar bilan Yevropa  davlat- larining ichki  ishlariga  aralashar,  bundan  esa  hukmdorlar  ham  norozi edi."
            },
            {
              "id": 5,
              "page": 22,
              "title": "4-mavzu: G‘ARBIY YEVROPADA YANGI DAVR MADANIYAÒINING SHAKLLANISHI ",
              "desc": " Uyg‘onish davri madaniyati. Yangi davr boshlarida Yevropaning ko‘pgina  mamlakatlari misli ko‘rilmagan madaniy  yuksalishni   boshi- dan kechirdi. Fan taraqqiyotidagi yutuqlar kishilarning olam haqidagi  tasavvurlarini  o‘zgartirib   yubordi,   madaniy   aloqalarni   kengayti- rishga imkon beradigan yangi ufqlar ochildi.  Fan  va  san’atda  ulkan o‘zgarishlar yuz berdi. Olimlar, ijodkorlar ideal va  namuna  izlab  Antik davr madaniyatiga murojaat qildilar.Ilgari fan  va  adabiyot  tili  bo‘lgan  lotin  tili  o‘rniga  italyan,  ispan, fransuz  kabi  xalq  tillari   rivojlandi.   XVI   asrda   yashagan   fransuz   shoiri bu jarayonni o‘z she’rida shunday ifoda etadi:Men o‘tmishni o‘rganib, o‘zligimga yo‘l topdim, Nutqim bo‘ldi tartibli, so‘zlarim ko‘p  ma’nolik. Men she’riyatdan tartib, musiqadan zavq topdim, Rimlik va yunon kabi fransuz bo‘ldi buyuk.Shu tariqa, XIV asrga  kelib,  avval  unutib  yuborilgan  antik  ma- daniyat qayta tiklana boshladi va bu jarayon Renessans  –  Uyg‘onish nomini oldi. Uyg‘onish Yangi davr bo‘sag‘asida turgan jamiyatning ma’naviy  yangilanishida katta  rol   o‘ynadi.   Insonning   bu   dunyodagi o‘z o‘rnini qayta anglashi, taqdirdan  in’om  kutib  emas,  faol  yaratuv- chi bo‘lib yashash  hissi  yangi  industrial  sivilizatsiyaning  shakllanishi- da asosiy omillardan biri bo‘ldi."
            },
            {
              "id": 6,
              "page": 28,
              "title": "5-mavzu:    ANGLIYADA    QIROL    HOKIMIYAÒINING KUCHAYISHI.   XVII   ASRDAGI   ANGLIYA   BURJUA   INQILOBI ",
              "desc": " Qirol hokimiyatining kuchayishi. Absolutizm. Savdo va sanoatning rivojlanishi Angliyada soliqlar tushumini keskin oshirdi. Endi davlatdan maosh oladigan amaldorlar va  muntazam  armiya  qirolning har qanday buyrug‘ini bajarishga tayyor edi. Bu qirolni boy zodagonlar ta’siridan xalos qildi. Natijada, qirolning cheklanmagan hokimiyati to‘g‘risidagi g‘oya shakllandi. Shu g‘oya asosida G‘arbiy Yevropa mamlakatlarida shakllangan hokimiyat mutlaq monarxiya yoki absolutizm deb ataldi. Absolutizm Angliyada XVI asrda shakllandi.  Shu  davrda  qirol  ho- kimiyati kuchayib, Genrix VIII Òyudor faqat cherkovni emas, toifalar vakillaridan iborat parlamentni ham o‘ziga bo‘ysundirdi,  ayrim  mustaqil  shimoliy  grafliklar va Uels ham qirol hokimiyatini tan oldi. 1558-yili hokimiyatga kelgan Yelizaveta I o‘zining 45  yillik  hukmronligi  davrida  Angliya- ning jadal rivojlanishi, dunyoning yetakchi davlatiga aylanishiga katta hissa qo‘shdi. Mam- lakatda Reformatsiya o‘z nihoyasiga yetdi. Davlat  qudratli   bo‘ldi,   xo‘jalikni   rivojlantirishda va dengiz savdosida muvaffaqiyatlarga erishildi. Angliya asta-sekin kuchli dengiz davlati – «dengizlar    malikasi»ga    aylandi."
            },
            {
              "id": 7,
              "page": 34,
              "title": "6-mavzu: XVI–XVIII ASRLARDA XALQARO MUNOSABAÒLAR",
              "desc": " Yangi davrga kelib, Yevropaning siyosiy xaritasi zamonaviy  ko‘ri- nishga ega bo‘lib bordi. XVII–XVIII asrlarda Yevropa davlatlarining jahonda ta’sir doirasiga ega bo‘lish va hududlar uchun  kurashlari keyingi davrlar uchun muhim ahamiyatga ega bo‘ldi. Yevropa sivi- lizatsiyasi  jahon  hamjamiyatining  iqtisodiy,  texnologik  va  harbiy-siyo- siy  yetakchisiga  aylandi.  Yevropa  sivilizatsiyasining  qadriyatlarini  bu- tun dunyoga yoyish uchun  uzoq  davom  etgan  kurash  boshlandi.  Bu kurash davomida jahon  bozorini  vujudga  keltirgan  va  o‘z  mustamlaka- lari  hamda yarimmustamlaka mamlakatlar  xalqlarini   bu   jarayonlarga jalb etgan Yevropa  sivilizatsiyasi  ilk  umumjahon  sivilizatsiyasiga  ay- lanib bordi. Aynan shu jarayonlar XVI–XVIII asrlardagi xalqaro mu- nosabatlarning ham mazmunini tashkil qildi. XVI–XVIII asrlardagi xalqaro mojaro va urushlarning bir qancha sabablari  bor edi. Birinchidan,  Yevropaning   kelajagi   to‘g‘risida   ikki xil qarash mavjud bo‘lib, Avstriyadagi  hukmron  gabsburglar  sulolasi katolik imperator boshchiligida yagona imperiya bo‘lishi lozim  desa, Angliya va Fransiya  Yevropada  mustaqil  milliy  davlatlar  mavjud  bo‘- lishi kerak, deb hisoblardi.Ikkinchidan, XVI asrda Yevropa katolik va protestant diniy maz- hablariga bo‘linib ketgan edi. Ular o‘rtasidagi ziddiyatlar Yevropa miqyosidagi diniy urushlarga olib keldi.Uchinchidan, iqtisodiy qarama-qarshiliklar – mustamlakalar, bo- zorlar va dengiz savdo yo‘llarida hukmronlik uchun kurash ham urushlarga sabab bo‘ldi."
            },
            {
              "id": 8,
              "page": 37,
              "title": " mavzu: FRANSIYADA MUÒLAQ MONARXIYA. BUYUK FRANSUZ BURJUA INQILOBI",
              "desc": " XVII asrda Fransiyaning iqtisodiy, ijtimoiy-siyosiy taraqqiyoti ziddiyatli  xarakterga  ega  edi.  Kapitalistik  munosabatlarning  kirib  ke- lishi natijasida yuz bergan iqtisodiy o‘sish, absolutizmning mustah- kamlanishi,  soliqlarning oshishi, xalq ommasi  ahvolining   yomonla- shuvi va doimiy xalq  qo‘zg‘olonlari  bilan  qo‘shilib  ketdi.  Yangi  iqti- sodiy  munosabatlar, ayniqsa, qishloqda juda qiyinchilik  bilan   o‘ziga yo‘l ochib bordi. XVI asr oxiri – XVII asr boshlarida Fransiya jadal iqtisodiy o‘sish davrini boshdan kechiradi. Bunga qirolning soliqlarni kamaytirishi, manufakturalar  uchun  qulay  moliyaviy  sharoit   yaratishi,   ishlab   chi- qarishni rag‘batlantiruvchi boj soliqlarini joriy qilishi, texnik  yan- giliklarni qo‘llab-quvvatlashi orqali erishildi. Qirol  bilan  burjuaziya o‘rtasidagi ittifoq mustahkamlanib, xalqning noroziligi ham pasaydi. Ichki bozorning kengayishi aholining o‘sishiga olib keldi. Inqilob arafasida  Fransiya  aholi  soni  bo‘yicha  Yevropaning  eng  katta  davlati edi. Shu davrda boshlangan islohotlarning amalga oshmay qolishi siyosiy va iqtisodiy islohotlarning absolutizm bilan sig‘ishmasligini ko‘rsatdi. Jamiyatda ijtimoiy ziddiyatlar kuchayib, mamlakat inqilob yoqasiga kelib qoldi. Buyuk fransuz burjua inqilobining boshlanishi. 1789-yil 5-may  kuni qirol Lyudovik XVI General shtatlar  majlisini  ochdi.  U  o‘z  nutqida aholiga yangi soliqlar joriy qilishni  so‘radi.  Qirolning  nutqi  uchinchi tabaqa vakillarining noroziligiga sabab bo‘ldi. Parijlik aholi ham depu- tatlardan qat’iy qarorlar talab  qilib,  Versal  tomon  kela  boshladi.  Shun- dan  so‘ng  uchinchi  tabaqa  deputatlari  o‘z  yig‘ilishini  Milliy  kengash deb e’lon qildi. Birinchi va ikkinchi tabaqa deputatlaridan islohot tarafdorlari bo‘lganlar ularga qo‘shildi. Milliy kengash absolutizmni tugatishga qaror qildi. "
            },
            {
              "id": 9,
              "page": 43,
              "title": " mavzu: BUYUK FRANSUZ BURJUA INQILOBINING YAKUNLANISHI VA ÒARIXIY AHAMIYATI",
              "desc": "1795-yilgi xalq qo‘zg‘oloni. Òermidorchilar (fransuz kalendaridagi termidor oyining 9-kuni  hokimiyatga  kelganlar  shunday  ataldi)  mulk va erkin tadbirkorlikni himoya qiladigan respublika tarafdori edi. Ular savdodagi  cheklashlarni  bekor  qildi.  Savdo  erkinligi  boshlandi,  narxlar bir necha bor ko‘tarilib ketdi, pul keskin qadrsizlandi. Mehnatkash xalq och qolayotgan bo‘lsa, «yangi boylar» o‘tayotgan vaqtni boy bermaslikka va hayot zavqini surishga oshiqardi. Burjua jamiyatining  yuqori qatlamida asilzodalar axloqi qayta tug‘ila  bosh- ladi. Inqilobiy o‘zgarishlar davri tugadi. Konvent deputatlarini endi xalqning ahvoli qiziqtirmas edi. Parijliklar Konvent ishiga ta’sir ko‘r- satishga urinib ko‘rdi. Parij atrofida  norozilik  kuchayib  bordi.  Aholi orasida «Xalq, uyg‘on! Payt keldi!», degan shiorlar tarqaldi. Shu tariqa 1795-yil aprelda qo‘zg‘olon boshlandi. Minglab qurolsiz kishilar Konvent tomon kelishdi. Kechga borib,  Milliy  gvardiya  Kon- ventni o‘rab olib, xalqni quvib yubordi. Parij qamal holatida deb  e’lon qilindi.  May oyida bu voqealar takrorlanib,  qo‘zg‘olonchilar   Kon- ventni egallab oldi.  Odamlar  oqimi  barcha  binolarni  to‘ldirib  yubordi. Ikki kun davomida g‘azab alangasi avj oldi. Ikkinchi kun oxiriga kelib, qo‘zg‘olonchilar tor-mor qilindi va qurolsizlantirildi, ularning yo‘l- boshchilari – so‘nggi yakobinchilar gilotinada qatl qilindi. Ko‘plar qamoqqa tashlandi, surgun  qilindi.  Bu  qo‘zg‘olon  Buyuk  fransuz  inqi- lobi davrida aholining so‘nggi ommaviy chiqishi edi. "
            },
            {
              "id": 10,
              "page": 45,
              "title": " mavzu: XVI–XVIII ASRLARDA GERMANIYA IMPERIYASI",
              "desc": " Iqtisodiy ahvol. Germaniya iqtisodiy taraqqiyotda Angliya, Gol- landiya va Fransiya kabi davlatlardan orqada edi. Hatto, XVI  asrning ikkinchi yarmidan iqtisodiy tushkunlik ham boshlandi. Bu, avvalo, Germaniyaning 300 dan ortiq mayda-mayda knyazlik (davlat)larga bo‘linib ketganligi  oqibati  edi.  Siyosiy  tarqoqlik  yagona  ichki  bozor- ning vujudga kelishiga imkon bermadi.Bundan tashqari, bu davrda dengiz savdo yo‘llarining Atlantika okeaniga ko‘chganligi oqibatida Germaniya orqali o‘tadigan savdo yo‘llari o‘z ahamiyatini ham yo‘qotdi. Holbuki, XVI asr o‘rtalarigacha Shimoliy Italiya va uning vositachiligida butun Sharqning G‘arbiy Yevropa bozorlari bilan aloqalari Germaniya yerlaridan o‘tardi.Germaniyaning xalqaro miqyosdagi iqtisodiy roli  –  uning  mis ishlab  chiqarish  bo‘yicha  dunyoda  birinchi  o‘rinni  egallab  kelganligi bilan belgilanar edi. Mis savdoda asosiy vosita hisoblanardi. Biroq Amerikadan  Yevropaga oltin va kumushning katta miqdorda  keltiri- lishi Germaniya misining ahamiyatiga jiddiy putur yetkazdi. Shu- ningdek, nemis sanoat  mahsulotlari  chet  davlatlar  sanoat  mahsulotlari bilan raqobat qila olmadi. Chunki Germaniyada manufaktura ishlab chiqarishi faqat shahar bilan cheklanib qolgan  edi.  "
            },
            {
              "id": 11,
              "page": 50,
              "title": " XVI–XVIII   ASRLARDA   ROSSIYA   IMPERIYASI ",
              "desc": " Rus yerlarining birlashishi. Oltin O‘rdaga qaramlikdan ozod bo‘lgan Rus yerlarining Moskva atrofida birlashish jarayoni XVI asr boshlarida  nihoyasiga  yetdi.  Markazlashgan  davlat  tashkil  topdi  va  u endi «Rus», «Rossiya» deb ataldi. 1547-yili  taxtga  o‘tirgan  Ivan  IV  Rossiya  tarixida  birinchi  bor podsholik tojini kiydi va «sar» deb ataldi. Rusda hukmdorlar ilgari «Buyuk knyaz» deb  atalar  edi.  Ivan  IV  ga  podsholik  unvonining berilishi   uni   G‘arbiy   Yevropa   qirollari   bilan   tenglashtirdi.   Ivan    IV ichki  siyosatining  asosiy   maqsadi   dvoryanlar   tabaqasini   kuchaytirish orqali boyarlar mavqeyini zaiflashtirishga qaratildi. Shu maqsadda 1549-yili  u  birinchi  bor  erkin  aholi  turli   toifalari   vakillarining   yig‘i- lishini – Zemstvo soborini chaqirdi. Ivan IV Zemstvo soborida  boyarlar  hokimiyatini  keskin  qoraladi. Sobor yangi qonunlar to‘plami –  Sudebnik  tuzish  haqida  qaror  qabul qildi. Unga ko‘ra, bundan buyon dvoryanlarni jinoyat va nojo‘ya  qil- mishlari uchun boyarlar sudiga berish taqiqlandi. Dvoryanlardan ming nafariga Moskva uyezdidan  yer-mulk  ajratib  berildi.  Davlat  lavozim- larini faqat  zodagon  naslidan  bo‘lgan  kishilar  egallashi  tartibiga  ham chek qo‘yildi. "
            }
          ]
        },
        {
          "classId": 1,
          "classLevel": 7,
          "mundarija": [
            {
              "id": 1,
              "page": 5,
              "title": "Kirish",
              "desc": "Ma’lumki, o‘rta asrlar tarixi qadimgi va yangi zamon o‘rtasida o‘tgan butun boshli o‘n asrni, ya’ni milodiy V asrning so‘nggi qismidan to XV asrning so‘ngiga qadar davom etgan juda ulkan va qiziqarli davrni qamrab oladi. Unda feodal jamiyatning qanday vujudga kelgani, qay tariqa rivoj topgani, xalq ommasi qanday yashagani va mehnat qilgani, ular o‘z ozodliklari uchun olib borgan urushlarda o‘z mustaqilliklarini qanday himoya qilganliklari haqida hikoya qilinadi. O‘rta asrlar jamiyati haqida. O‘rta asrlar kishilik jamiyati Yevropada feodal, Osiyoda esa yer egaligi jamiyati deb ataladi. «Feodal» atamasi lotincha «feod» so‘zidan olingan. Ma’lum xizmat evaziga qirol tomonidan berilgan va meros bo‘lib qoladigan yer-mulkka feod deyilgan. Feod egasi esa feodal deb aytilgan. Feodal jamiyati yer egaligiga asoslangan jamiyatdir. Yevropada yer-mulk egasi feodal deb atalgan. Feodal o‘z yerining bir qismini dehqonlarga chek yer qilib bo‘lib bergan. Buning evaziga dehqonlar feodalning yerlarini ishlab berganlar. Dehqonlar o‘zlariga berilgan chek yerlarida yetishtirgan hosildan ma’lum qismini feodalga soliq sifatida to‘laganlar. Feodal davri turli xalqlarda turlicha vaqtlarda tashkil topgan. Masalan, G‘arbiy Yevropada V asr oxirlarida zaiflashgan G‘arbiy Rim imperiyasi 476-yilda «varvarlar»ning qaqshatqich zarbasidan qulaganidan so‘ng feodal davri vujudga kelgan. Turli mamlakatlarda feodal davri hukm surgan davrlar ham turlicha bo‘lgan. Osiyoda yer egaligi jamiyati. Osiyoda (xususan, Vatanimiz hududida ham) yer egaligi Yevropadagidan farq qilgan. Osiyoda davlat hukmdori yerning oliy egasi hisoblangan. Yer maydonlarining ma’lum qismi bevosita davlat 5 mulki bo‘lgan. Davlat hukmdorlari va katta yer egalari yerlarini dehqonlarga ishlash uchun ijaraga bo‘lib berganlar. Ijarachilar o‘sha yerlarda yetishtirgan hosilning belgilab qo‘yilgan ma’lum bir qismini yer egalariga topshirganlar. Osiyoda Yevropadagidek yer egasining yerini ishlab berish majburiyati bo‘lmagan. Yevropada yog‘ingarchilik ko‘p bo‘lganligi uchun dehqonchilik rivojlangan. Osiyoda esa bunday imkoniyat bo‘lmagan, yog‘ingarchilik tanqisligi sababli yerlarning namlik miqdori ancha past bo‘lgan. Bunday sharoitda sun’iy sug‘orishga ehtiyoj tug‘ilgani tabiiy. Shu boisdan ham Osiyoda yer egalari uchun yerlarining hammasini dehqonlarga ijaraga bo‘lib berish foydali bo‘lgan. Negaki bu bilan sug‘orish inshootlarini doimiy tozalab turish majburiyati ham dehqonlar zimmasiga yuklangan. Osiyo va Afrika mamlakatlarida o‘troq dehqon hamda ko‘chmanchi qabilalar, xalqlar orasidagi munosabatlar muhim o‘rin tutgan. Sababi, ushbu mamlakatlarda ko‘chmanchi chorvachilik xo‘jaligi asrlar davomida saqlanib kelgan. Agar dehqonlar bilan chorvadorlar o‘rtasida ayirboshlash bo‘lsa, jamiyat yuksalgan. Lekin ko‘chmanchilar bosqini va talonchiliklari sun’iy sug‘orish inshootlarining vayron etilishi, ko‘plab aholining qirilishi va asirlikka olib ketilishi bilan tugagan. Xususan, ko‘p oylik qamaldan so‘ng Urganchni egallagan mo‘g‘ullarning har bir askariga 24 nafardan asir to‘g‘ri kelgan."
            },
            {
              "id": 2,
              "page": 8,
              "title": "1-§. German QABILALARI VA RIM IMPERIYASI",
              "desc": "Milodning ilk asrlarida Osiyodagi xunn, Yevropadagi german qabilalarida mulkiy tabaqalanish kuchayib, ular zaiflasha boshlagan Rim imperiyasiga bosqinlarini kuchaytirishgan. Õàlqlàrning buyuk ko‘chishlàri. Milîdiy IV–VI àsrlàrdà Yevropani õunn qàbilàlàri bîshlàb bårgàn «Õàlqlàrning buyuk ko‘chishlàri» jàràyoni qàmràb îlàdi. Ushbu jarayonning o‘ziga xos bir qancha sabablari bo‘lgan. Avvalo, german qabilalarida ahîli sînining ko‘payib bîrishi nàtijàsidà yangi yårlàrgà bo‘lgàn tàlàbning îshishi, mulkiy tàbàqàlànish kuchàyishi German qabilalarini yangi hududlàrni egàllàshgà undàdi. Bundan tashqari, xunnlàrning IV àsrdàn Shàrqdàn ko‘chishlari va hujumlàri ko‘plàb vàrvàr qàbilàlàrini o‘z yerlàridàn siljishgà màjbur qilgan. Yevropadà II àsrdàn iqlimning sîviy bîshlàshi keyingi asrlarda ekinzorlarni qo‘riqqa, suv hàvzàlàri và ulàrgà yaqin yårlàrni esa bîtqîqliklàrga àylàntirdi. Ushbu omillar xalqlarning yashàsh và õo‘jàlik yuritish uchun yangi qulày hududlàrni izlashiga turtki bo‘lgan. IV–VI àsrlàr Yevropa xalqlari tarixi uchun buyuk kochishlar davri hisoblanadi. "
            },
            {
              "id": 3,
              "page": 12,
              "title": "2-§. FRANKLAR. FRANKLAR DAVLATINING TASHKIL TOPISHI",
              "desc": "Frànk qàbilàlàri. Buyuk ko‘- chishlar boshlanishiga qadar german qabilalariga mansub franklar Reyn daryosi quyi oqimidagi hududlarda yashaganlar. Ularda urug‘chilik tuzumi mavjud bo‘lib, qàbilà yo‘lbîshchilàri hàrbiy ishdà àlîhidà jàsîràt ko‘rsàtgàn kishilàrdàn sàylàb qo‘yilgàn. Rim-gallar bilan yaqin qo‘shnichilik munosabatlarida bo‘lgan franklarning tashqi ko‘rinishi ham boshqa german qabilalaridan ancha farqlangan. Franklar gotlar va langobardlar kabi hayvon terisidan emas, matodan kiyim-bosh kiyishgan va soch-soqollarini olib yurishgan. Franklarda faqat qirol oilasiga mansub kishilargina uzun soch bilan yurishlari mumkin bo‘lgan. G‘àrbiy Rim impåriyasining inqirîzidàn kåyin Gàlliyadà rim nîibi Egidiy mustàqil knyazlik tuzàdi. Xuddi shu dàvrdàn frànklàrning Gàlliyagà hujumlàri yanàdà kuchàyadi. Ulàrgà frànk qàbilàlàridàn biri, mårîvinglàr sàrdîri Õlîdvig bîshchilik qilàdi. Õlîdvig tåz îràdà o‘z ràqiblàrini yångib, bàrchà frànk qàbilàlàri ustidàn hukmrînligini o‘rnàtàdi. 486-yilda Õlîdvig frànklàr dàvlàtigà àsîs sîlàdi."
            },
            {
              "id": 4,
              "page": 17,
              "title": "3-§. FRANKLAR IMPERIYASI",
              "desc": "Xlodvigning o‘g‘illari davrida Frank qirolligi chegaralari ancha kengaygan. Lekin keyinchalik sulola vakillari orasida kelishmovchiliklar boshlanib, oxir-oqibat yangi sulola taxtga kelgan. Buyuk Kàrl. Kàrl sulîlà àsîschisi Frànklàr qirîlligini (800-yildan imperiyasini) 46 yil (768–814) bîshqàrgàn. «Buyuk» nîmi ungà tàriõchilàr tîmînidàn ko‘plab hàrbiy yurishlargà bîshchilik qilib, yirik sàltànàt tuzgàni, bu dàvlàtdà yangi qînunlàr, màîrif và màdàniyatgà àsîs sîlgàni uchun bårilgàn. Kàrl hàqidà ko‘plab tàriõiy àsàrlàr, àfsînàlàr, rivîyatlàr và qo‘shiqlàr yaratilgan. Uning ismidàn «kîrîl», ya’ni «qirîl» unvîni kålib chiqqàn. Itàliya và Ispàniya urushlàri. Kàrl tàõtgà o‘tirishi bilàn istilîchilik urushlàrini îlib bîrgàn. Uning dàstlàbki hàrbiy yurishlàridan biri germanlarning làngîbàrd qabilasi Itàliyadà tuzgàn dàvlàtigà qàrshi 773-yilda bîshlànàdi. Urushda g‘olib bo‘lgan Karl Itàliya yårlàrini gràfliklàrgà bo‘lib, Frànk qirîlligigà qo‘shib îlàdi."
            },
            {
              "id": 5,
              "page": 21,
              "title": "4-§. BRITANIYADAN ANGLIYAGA",
              "desc": "Rim imperiyasi Britaniya orollarini istilo qilganida orol janubida kelt, britt, shimolida – hozirgi Irlandiya va Shotlandiyada – skot, pikt qabilalari yashagan. Rim legionlari 407-yilda Britaniyani tashlab Italiyaga qaytadi. Ularning ketidan qolgan rimliklar ham Yevropaga keta boshlaydi. Shu tariqa orolning kelt aholisi o‘z holicha qoldiriladi. Kelt qabila boshliqlari esa o‘zaro urushlarga kuch beradi. Ayni paytda shimoldan pikt va skott qabilalari hujumlari boshlanadi. 13-rasm. Britt jangchilari 22 I BOB. O‘RTA ASRLARNING ILK DAVRI Xavfli himoyachilar. Piktlardan himoyalanish uchun mahalliy brittlar ilk marotaba germanlarning yut, angl va saks qabilalaridan yollanma drujinalarni taklif etgan. Bu qabilalar Germaniyaning shimoli va Yutlandiya yarimorolida yashardi. Dastlab germanlar uchta kemada kelishadi. Lekin ko‘p o‘tmay ularning ortidan ko‘plab qabiladoshlari yo‘lga chiqadi. Germanlarning keltlardan tobora yuqori to‘lov talab qilishi, doimiy isyonlari, mamlakatni talashlari va tahdidlari kuchayib boradi. Yutlar V asr o‘rtalarida Kent viloyatini bosib oladi. Ularning izidan angl-sakslar ham keltlarga hujum boshlab, qattiq qarshilik bo‘lmaganidan mamlakatni istilo qilishga kirishadilar. Angl-sakslar mahalliy aholining bir qismini qirib, ayrimlarini qullik asoratiga soladilar. Shaharlar katta talafot ko‘radi, majusiy germanlar ibodatxona va monastirlarni talab, yondirib yuboradilar. Istilo dahshatidan ko‘pgina keltlar qit’aga, Armorika viloyatiga ko‘chib o‘tadi. Fransiyaning shimoli-g‘arbidagi bu hudud brittlarning ommaviy ko‘chishidan so‘ng Bretan nomini olib, bu nomni hozirga qadar saqlab qolgan."
            },
            {
              "id": 6,
              "page": 27,
              "title": "5-§. MUQADDAS RIM IMPERIYASI",
              "desc": "Xalqlarning buyuk ko‘chishlari davrida german qabilalari G‘arbiy Yevropa bo‘ylab joylashib, qabila harbiy sarkardalari yurtlaridan uzoq o‘lkalarda davlatlar tuzishgan va ularga qirollik qilishgan. Lekin Germaniyaning o‘zida kuchli mustaqil qirollik nisbatan kech vujudga kelgan. Yangi qirollik. Franklar imperiyasi 843-yilda uchga bo‘linib ketganida, dastlab ularning hammasini Buyuk Karlning avlodlari boshqargan. Lekin 919-yili Sharqiy Frank qirolligida (bo‘lajak Germaniya) mahalliy zodagonlar knyazlardan eng qudratlisi bo‘lgan Saksoniya gersogi Genrixni qirollikka saylaydilar. Natijada, franklarning karolinglar sulolasi o‘rniga mahalliy saksoniyaliklar sulolasi hokimyatga keladi. Shu tariqa yangi davlat – Germaniya qirolligi vujudga keladi. Gånrix I uzoqni ko‘zlab, aql bilan ish boshlab mamlakatni kuchaytirish yo‘lini tutadi. Vångerlar bilan 9 yilga tinchlik sulhi tuzgan qirol mamlakat mudofaa qudratini yuklasaltirish maqsadida qator tadbirlarni amalga oshiradi. Gånrix qishloqda yashaydigan har 9 kishidan bittasini tanlab, uni burg (qal’a)ga ko‘chiradi. To‘planganlar burgda o‘z birodarlari uchun ham uy-joy qurishga kirishadilar. Qishloqda qolgan sakkiz kishi o‘zlarining jangchilikka tayinlangan shåriklari uchun ham dåhqonchilik qilganlar. Gånrix barcha yig‘inlar, chårkov soborlarini, bazmlarni burgda o‘tkazishni buyuradi. Qurilish kåcha-yu kunduz davom etgan, sulh muddati tugaguniga qadar aholining asosiy mulki burglarda bo‘lishi lozim bo‘lgan."
            },
            {
              "id": 7,
              "page": 30,
              "title": "6-§. VIZANTIYA: G‘ARB VA SHARQ ORASIDA",
              "desc": "Impåriyaning tàshkil tîpishi. Vizantiya – Rim imperiyasi vorisi bo‘lib, imperiyaning sharqiy hududlarida vujudga kelgani uchun u Sharqiy Rim imperiyasi deb ham ataladi. Vizantiyaga ham Yevropa, ham Osiyo hududlari kirganligi bois uni G‘arb va Sharq orasidagi mamlakat deyish ham mumkin. Ma’lumki, Impåràtîr Feîdosiyning o‘g‘illàri 395-yilda Rim impåriyasini ikki mustàqil dàvlàtgà: G‘àrbiy Rim impåriyasi – pîytàõti Rim và Sharqiy Rim impåriyasi (Vizàntiya) – pîytàõti Kînstàntinîpîlgà bo‘lib îlishàdi. Kînstàntinîpîl shàhri o‘rnidàgi yunonlarning Megara shahri koloniyasi Vizàntiy nîmidàn ko‘pinchà Vizàntiya dåb ham atashgan. 19-rasm. Otton I rafiqasi bilan 30 I BOB. O‘RTA ASRLARNING ILK DAVRI Vizàntiya tàrkibigà Bîlqîn yarimîrîli, Kichik Îsiyo, Kàvkàz, Suriya, Fàlàstin, Misr, shuningdek, Krit va Kiðr îrîllàri kirgàn. Sharqiy Rim imperiyasida yunonlar son jihatidan ko‘p bo‘lganidan davrlar o‘tib, yunon tili lotin tilini surib chiqarib, davlat tiliga aylanadi. Sharqiy Rim imperiyasi aholisini yevropaliklar grek (yunon)lar deyishgan. Lekin imperiya fuqarolari o‘zlarini rimliklar (yunoncha, romeylar), davlatlarini esa Rim (Romey) imperiyasi deb hisoblashgan. Ularni Sharq xalqlari ham rimliklar deb bilishgan. Vizàntiyadà qulchilik sàqlànib qîlsà-dà, àhîlining kàttà qismini erkin dåhqînlàr tàshkil etishi, sun’iy sug‘îrishgà àsîslàngàn sårmàhsul zirîàtchilikning bo‘lishi uning iqtisîdiy bàrqàrîrligini ta’minlàgan. Shuning uchun impåriyadà VI àsrdà hàm Kînstàntinîpîl, Àlåksàndriya, Àntiîõiya, Edåssà shaharlàri yirik savdo va hunarmandchilik markazlari sifatida gullàb-yashnàgàn."
            },
            {
              "id": 8,
              "page": 33,
              "title": "7-§. SLÀVYANLAR VA ULARDA DÀVLÀTLÀRNING TÀSHKIL TÎPISHI",
              "desc": "Slàvyanlàr. Yozmà mànbàlàrdà vizàntiyalik tàriõchilàr tîmînidàn «slàvyanlàr» àtàmàsi VI àsrdàn boshlab ishlàtilgàn. Låkin slàvyan qàbilàlàri yunîn-rim tàriõchilàri àsàrlàridà, gårmànlàr bilàn bir pàytdà, milîddàn àvvàlgi II–I àsrlàrdà tilgà îlinàdi. VI–VII àsrlàrga kelib, slàvyanlàr g‘àrbdà Elbà dàryosidàn, shàrqdà Vislà dàryosigà qàdàr, shimîldà Bîltiq dångizidàn, jànubdà Dunày dàryosigà qàdàr cho‘zilgàn hududlàrdà yashàgànlàr. Kåyingi àsrlàrdà ulàr uch guruhgà: g‘àrbiy, jànubiy và sharqiy slàvyanlàrgà bo‘lingàn. 3 — Jahon tarixi 7 34 I BOB. O‘RTA ASRLARNING ILK DAVRI 26-rasm. Knyaz Vatslav G‘àrbiy slàvyanlàr – chåõlàr, pîlyaklàr và slîvàklàr. Jànubiy slàvyanlàr – bîlgàrlàr, sårblàr, õîrvàtlàr, slovenlàr, chårnîgîrlàr, makedonlar va bosniyaliklar. Sharqiy slàvyanlàr – ruslàr, ukràinlàr, bålîruslàrdàn tàshkil tîpgàn. Slàvyanlàrning màshg‘ulîtlàri. Slàvyanlàr qàdimdàn dåhqînchilik bilan shug‘ullangan. Vizàntiya tàriõchisi Màvrikiyning yozishichà, dehqonlàr bîshîqli ekinlàrdàn ko‘prîq àrpà và tàriq ekkanlàr. Ulàr yig‘ilgan g‘àllàni àlîhidà îmbîrlàrdà sàqlàgànlàr. Milîdiy àsr bîshlàridàn slàvyanlàr uy chîrvàchiligi va hunàrmàndchilik bilàn ham shug‘ullànà bîshlàganlàr. Vislà, Dnåpr, Dunày, Elbà dàryolàri bo‘ylàridà yashàgàn àhîli õo‘jàligidà bàliqchilik hàm muhim o‘rin tutgàn."
            },
            {
              "id": 9,
              "page": 37,
              "title": "8-§. SHARQIY SLAVYANLAR. KIYEV RUSI",
              "desc": "Sharqiy slavyanlar joylashuvi, ijtimoiy tuzumi. Sharqiy slavyan qabilalari: drevlyanlar, rodimichlar, tiverlar, dregovichlar, vyatichlar, sevoryanlar va hokazolar ilk o‘rta asrlarda Dnepr daryosi havzasida yashaganlar. Keyinchalik aynan shu qabilalar birlashuvidan Kiyev Rusi davlati vujudga kelgan. Arxeologlar slavyanlarning dehqonchilik va chorvachilik bilan shug‘ullanganliklarini qazishmalardan topilgan mehnat qurollari, kulolchilik buyumlari, jez va kumushdan yasalgan zeb-ziynatlar orqali aniqlashgan. Vizantiyada VIII asrda yozilgan «Ziroatchilik qonunlari»ga ko‘ra, qishloq jamoasining a’zolari – erkin dehqonlarning yerlari alohida bo‘lib, ular bug‘doy, tariq, arpa va boshqa donli ekinlar yetishtirganlar. Qabilalar hayotiga oid muhim masalalar xalq yig‘ini – «veche»da muhokama etish bilan hal qilingan. Slavyanlar yo‘lboshchilari – otliq drujinachilar faqat o‘z hududlarini himoya qilibgina qolmay, qo‘shni o‘lkalarga yurishlar ham uyushtirishgan. 28-rasm. Aka-uka Ryurik, Sineus va Truvorlarning Rusga kelishi 38 I BOB. O‘RTA ASRLARNING ILK DAVRI Davlatning tashkil topishi. Yilnomalarda yozilishicha, Sharqiy slavyan qabilalari varyaglarga (skandinaviyalik normannlarga) elchi jo‘natib, ulardan o‘zlariga knyaz yuborishlarini so‘raydi. Bu taklifga binoan uch aka-uka: Ryurik, Sineus va Truvorlar Rusga kelib, Ryurik Novgorodda, Sineus Beloozeroda, Truvor Izborskda knyazlik qiladilar. Ko‘p o‘tmay ukalari vafot etib, Ryurik yakka hukmronlik qila boshlaydi."
            },
            {
              "id": 10,
              "page": 41,
              "title": "9-§. YEVROPA XALQLARI MÀDÀNIYATI",
              "desc": "Franklar imperiyasida madaniyat. Buyuk Kàrl o‘z davlatida yangi màîrif tizimini yaràtàdi. Qirîl farmoniga ko‘ra xalq màktàblàri jîriy etiladi. Ungà binîàn, màktàblàr ibîdàtõînàlàr qîshidà tàshkil etilib, ruhîniylàrgà îddiy õàlq fàrzàndlàrini båpul o‘qitish buyurilgàn. Sàrîydà hàm màktàb tashkil etilib, undà Kàrlning yaqin do‘stlàri, olimlar – sàrîy àkàdåmiyasi a’zîlàri saboq bårishgàn. Saroy àkàdåmiyasi àntik dàvr muàlliflàri àsàrlàrini o‘rgànish, shå’rlàr bitish bilàn shug‘ullangàn. Ulàrdàn biri tàriõchi-rîhib Eyngàrd àsàridàn biz Buyuk Kàrl hàyoti và fàîliyati hàqidàgi ma’lumîtlàrni îlàmiz. Eyngàrdni zamondoshlari ilmgà chànqîqligi và tirishqîqligi tufayli «måhnàtsåvàr chumîli» dåb àtàgànlàr. Sàrîy àkàdåmiyasining yanà bir a’zîsi Àlkuin và uning shîgirdlàri màîrifni yoyishdà kàttà õizmàt qilgàn. Vizàntiya màdàniyati. O‘rtà àsrlàr dàvridà Vizàntiya o‘zigà õîs yuksàk màdàniyati bilàn Yevropaning eng ilg‘îr màmlàkàti bo‘lib qoladi. Sababi, gårmàn qàbilàlàri istilîsi nàtijàsidà inqirîzgà uchràgàn G‘àrbiy Rimdàn fàrqlirîq, Vizàntiyadà àntik màdàniyat àn’ànàlàri sàqlànib, vizàntiyaliklàr hàyotidà yunîn hàmdà Sharq màdàniyatlàri qîrishmàsi — ellinizm muhim o‘rin tutgàn. Ilm-fàn eng rivîjlàngàn shahar, «fànlàr înàsi» – Àfinà edi. Plàtîn (mil. àv. IV àsrdà) Àfinà àkàdåmiyasigà àsîs sîlgan. «... Platon asos solgan bu ilmiy maskan ming yildan ziyod davr davomida nafaqat yunon, balki butun Sharq-u G‘arb olamining rivojiga kuchli ta’sir o‘tkazadi, insoniyat taraqqiyotining istiqbolini belgilab beradi. Shu bois ham Platon Sharq ilm-fanida «ustodi avval», ya’ni 33-rasm. Alkuin 42 I BOB. O‘RTA ASRLARNING ILK DAVRI birinchi muallim degan sharafli nom bilan shuhrat qozonadi» ."
            },
            {
              "id": 11,
              "page": 47,
              "title": "10-§. ARABISTON ILK O‘RTA ASRLAR BOSHIDA",
              "desc": "Àràbistîn. Àràb qàbilàlàri Àràbistîn yarimîrîli và ungà tutàsh hududlàrdà yashàgànlàr. Ulàr sîmiy (såmit) xalqlaridàn bo‘lib, sîmiylàrgà arablardan tashqari: yahudiylàr, îssuriylàr, finikiyaliklàr và oromiylàr hàm mànsub bo‘lishgàn. Bu õàlqlàr Qàdimgi Shàrqning mashhur dàvlàtlàri: Àkkàd, Bîbil, Isrîil pîdshîliklàrini tashkil etgàn. Ko‘chmànchi àràblàr – bàdàviy (sàhrîyi)làr tuyachilik, qo‘ychilik và yilqichilik bilàn shug‘ullànib kelgànlàr. Badaviylàr cho‘l va yaylovlàrdà mîl bîqib, ko‘chib yurgànlàr. Àràbistînning jànubi và g‘àrbidàgi o‘trîq dåhqînchilik bilan shug‘ullanuvchi àhîlisi sîy và jilg‘àlàr, quduqlàr bo‘ylàridà õurmî bîg‘làri và uzumzîrlàr bàrpî etgànlàr. Õuddi shu yårlàrdàn Vizàntiyadàn jànubgà, Àfrikàgà và Hindistîngà bîràdigàn kàrvîn yo‘li o‘tàrdi. Buyuk Ipàk yo‘li o‘tgan màmlàkàtlàrdà nîtinchlik bo‘lgan pàytlàridà kàrvîn yo‘llàri Àràbistîngà siljirdi. Zàmînlàr o‘tib bu kàrvîn yo‘llàri bo‘yidà àhîli qo‘rg‘înlàri và shaharlàr vujudgà kålgan. Ulàrdà yashagan àhîli esa kàrvîn yo‘llàridàgi sàvdîgàrlàr, sàyyohlàrgà õizmàt qilish bilàn shug‘ullangan. Bu qo‘rg‘înlàrdàn eng yirigi Màkkà shàhri bo‘lgàn. Ko‘chmànchilàr mîllàrini shaharlàrgà kåltirib, màhàlliy àhîlidàn dîn, gàzlàmà, qurîllàrgà àyirbîshlàgànlar. Àràbistînning eng tàràqqiy etgàn vilîyatlàri – Yaman và Hijîz edi. Yaman yårlàri unumdîrligi bilàn nîm chiqàrgàn. Undà suv yåtàrli bo‘lganidan måvàli dàràõtlàr o‘stirilgan õurmîzîr bog‘lar barpo etilgan. «Yaman» àràbchà «hàq», «bàõtli» ma’nîsini bildirgàn. Rim tàriõchilàri Yamanni «Bàõtli Àràbistîn» (Arabia felix) dåb nîmlàgànlàr."
            }
          ]
        }
      ]
    },
    {
      "bookId": 2,
      "bookName": "Geografiya",
      "bookImage": "assets/svg_icon/img.png",
      "status": "tavsiya",
      "classes": [
        {
          "classId": 1,
          "classLevel": 8,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "O‘zbekiston iqtisodiy va ijtimoiy geografi yasi nimani o‘rganadi? Siz endi oldingi sinflarda olgan bilimlaringiz asosida Yer yuzi, shu jumladan, mamlakatimiz tabiati haqida boshqalarga ham ma’lumot bera olasiz. Ulardan tashqari shunday bilimlar ham borki, ular kishilar faoliyati, hayot tarzi va ishlab chiqarishning hududiy farqlanishi kabi insoniyat, jamiyat hayoti bilan bevosita bog‘liqdir. Ana shu bilimlarni o‘rganadigan fan iqtisodiy va ijtimoiy geo gra fi ya deb yuritiladi. U aholi faoliya tining hududiy tashkil etilishi bilan bog‘liq iqtisodiy va ijtimoiy masalalarni muayyan mamlakat bo‘yicha ham, butun jahon miqyosida ham o‘rganadi. Ushbu o‘quv yilida jonajon Vatani - miz – O‘zbekiston ning iqtisodiy va ijtimoiy geografi yasini o‘rganasiz. Darhaqiqat, zavod, fabrika, firma, shifo maskan i, ta’lim muassasasi yoki maishiy xizmat korxonalari puxta o‘ylan masdan duch kelgan joyda barpo qilinsa, kishilarni sarsongarchilikka, mehnat va mablag‘ni behuda sarfl ashga majbur qiladi. Oxir-oqibatda bu ijtimoiy mehnat unumdor ligining oshishiga salbiy ta’sir etadi. Ijtimoiy mehnat unum dorligi – moddiy ishlab chiqarishda band bo‘lgan har bir ishlovchi hisobiga hosil qilingan milliy daro mad miqdori. Mehnat unumdorligi ishlab chiqa rish ning mashinalar, malakali ishchilar, elektr energiya, tabiiy boyliklar bilan ta’minlan ganiga, korxona va aholi punktlarining kishilarga qulay hamda tabiiy muhit toptalmaydigan joyda barpo etilganiga, mehnatkashlar ning yashash sharoitlari, dam olishi hamda ularga madaniymaishiy xizmat ko‘rsatili shiga ham bog‘liq. Agar xomashyo, yoqilg‘i, energiya manbalari va ishchilar o‘zaro yonma-yon joylashsa, ishlab chiqarishda yuqori samaradorlik ta’minlanadi. Biroq bunday qulay joylashish kamdan kam uchraydi. Ba’zi joylarda xomashyo yetishmasa, boshqa joyda yoqilg‘i, energiya tanqisligi kuzatiladi. Ana shuning uchun ham mamlakatni rivojlantirishning milliy dasturlarida aholini, ishlab chiqarishni joylashtirish hamda tabiat boyliklaridan foydalanish masalalarini hududiy yaxlit tashkil etishga alohida e’tibor beriladi.Bu fan xulosalari uchun asos bo‘lgan ma’lumotlar – daliliy ashyolar zamon bilan hamnafas o‘zgarib boradi. Darslikda keltirilgan raqamli ma’lumotlar, rasm, xarita-sxemalardagi ma’lumotlar va, hatto, joy nomlari ham ertaga bugungi dan farqlani shi mumkin. Iqtisodiy va ijtimoiy geografi yaga xos bu jihat kundalik voqea va hodisalardan muntazam xabardor bo‘lib turishni taqozo etadi. Yurtimizda bozor iqtisodiyotiga o‘tish dek murakkab va keng qamrovli jarayon kechmoqda. Bunday paytda mamlakatda, har bir shahar yoki qishloqda muayyan muammolar vujudga kelishi tabiiy. Darslik sizni shunday muammolar bilan tanish tiradi hamda ularning yechimini topishga o‘rgatadi. "
            },
            {
              "id": 2,
              "page": 5,
              "title": "O‘ZBEKISTONNING GEOGRAFIK O‘RNI",
              "desc": "Muayyan mamlakat, hudud, viloyat, shahar, tuman, mahalla va, hatto, hovlining o‘ziga xosliklaridan biri ularning Yer yuzidagi betakror o‘rnidir. Bular geografik o‘rin deb ataladi. Geografi k o‘rin mohiyatan tabiiy geografi k o‘rin, iqtisodiy geografi k o‘rin va siyosiy geografi k o‘rin tarzida guruhlanadi. Tabiiy geografi k o‘rin, asosan, okean, dengiz, daryo, tog‘, cho‘l, o‘rmon, adir singari yirik tabiiy obyektlarga nisba tan joy lash gan o‘rniga ko‘ra belgilansa, iqtiso diy geo gra fi k o‘rin jahon ning erkin iqtisodiy mintaqa lari, jahon savdo yo‘llari, yirik sav do- sanoat markaz lari va tabiiy boyliklardan foy da lanish imkoniyatlari bilan belgi la nadi. Siyosiy geografi k o‘rin esa muayyan davrda alo hida davlatning harbiy mojarolar ro‘y berayotgan yoki ro‘y berishi mumkin bo‘lgan hudud va davlatlarga nisbatan qanchalik aloqa dorligiga ko‘ra baholanadi. Geografi k obyektlar o‘zaro aloqador bo‘ladi. Ana shu aloqadorlik ko‘lamiga muvofi q geografi k o‘rin mikro, mezo, makro miqyosda namoyon bo‘ladi. Endi Vatanimiz O‘zbekistonning geografi k o‘rnidagi o‘ziga xos jihatlar, uni belgilovchi omillarni ko‘rib chiqaylik. Tabiiy geografi k o‘rni. O‘lkamiz ob-havosi yilning talay qismida ochiq va quruq bo‘ladi. E’tibor qilinsa, O‘zbekiston Respublikasining Davlat madhiyasi «Serqu yosh hur o‘lkam...» deya boshlanadi. Tabiiy geografi k o‘rin sharofati ila serquyosh va issiq kunlarning uzoq davom etishi mamlakatimiz qishloq xo‘jaligi, transport va maishiy hayotda mehnat va moliyaviy sarf-xarajatlarning tejalishiga imkon beradi. Bulutsiz osmonimiz astronomik tadqiqotlarda ham qo‘l keladi. Abu Rayhon Beruniy, Ahmad al-Farg‘oniy, Mirzo Ulug‘bekdek koinot bilimdonlari bizning yurtdan chiqqani bejiz emas. Iqtisodiy geografi k o‘rni. Har qanday davlatning rivojlanishini tashqi iqtisodiy aloqalarsiz tasavvur etib bo‘lmaydi. Tashqi iqtisodiy aloqalar miqyosi esa xalqaro mehnat taqsimoti, qolaversa, iqtisodiy geografik o‘rin imko niyatlariga bog‘liq. Insoniyat taraq qiyotining muayyan bosqichlarida yirik xalqaro savdo yo‘llari muhim omil bo‘lgan."
            },
            {
              "id": 3,
              "page": 8,
              "title": "O‘ZBEKISTONNING TABIIY SHAROITI VA TABIIY BOYLIKLARI",
              "desc": "O‘zbekiston yerusti tuzili shi betakrordir. Shunga monand tabiati ham, boyliklari ham xilma-xil. Qulay tabiiy sharoit ishlab chiqarish samaradorligining muhim tabiiy omilidir. Tabiiy sharoit, ayniqsa, qishloq xo‘jaligi, foydali qazilmalar qazib chiqarish va transport harakatida yaqqol bilinadi. Tog‘ relyefi, sho‘rxoklar, cho‘llar, taqirlar, jarliklar hududni xo‘jalik jihatdan o‘zlashtirishni qiyinlashtiradi. Qurg‘oqchil yillarda daryo suvlari kamayib, ekinlarni suv bilan ta’minlash og‘ir kechadi. Lekin fan-texnika taraqqiyoti tufayli ishlab chiqarishning tabiiy sharoitga bog‘liqligi yengib kelinmoqda. Ayni vaqtda insonning tabiatga ta’siri kuchayib, salbiy oqibatlarga ham olib kelmoqda. Tabiiy boyliklar tabiiy sharoitdan farq qilib, ishlab chiqarishga bevosita aloqador, ya’ni uning xomashyo va energetika bazasini tashkil etadi. Eng muhim tabiiy boyliklardan biri — bu yerosti boyliklari (mineral va yoqilg‘ilar). Ulardan sanoatda, maishiy ehtiyojlarda keng miqyosda foydalaniladi (2-rasm). O‘zbekiston katta yerosti boyliklariga ega bo‘lgan mamlakatdir. Ammo mamlakat iqtisodiyotining xomashyoga va yoqilg‘iga bo‘l gan ehtiyoji to‘xtovsiz ortib bormoqda. Hozirda ta biiy boyliklarning yarmiga yaqinidan foydalanilmoqda. Shunday bo‘lsa-da, tabiiy boyliklar zaxirasidan tejab foydalanishimiz zarur. Chunki yerosti boyliklari tugaydigan va tiklanmaydigan boylikdir. Eng muhim tabiiy boyliklardan yana biri – suv. Qishloq xo‘jaligida ko‘p miqdorda suv sarflanadi. Sanoat korxonalari uchun ham ko‘p suv talab qilinadi. Kor xonalar eng katta shaharlar aholisi iste’mol qiladigan suvdan ko‘proq suvni «ichib» qo‘ymoqda. Suv – tiklanadigan tabiiy boylikdir. Qishloq xo‘jaligida foydalaniladigan unumdor tuproq (yer), aholi ehtiyoji uchun zarur o‘simlik va hayvonot dunyosi (baliq, yovvoyi hayvonlar), inson hayoti uchun zarur bo‘lgan havo ham tugaydigan va tiklanadigan tabiiy boylikka mansubdir. Toshkent, Farg‘ona, Navoiy kabi shaharlar, ayrim sanoat rayonlari hududida havo tarkibidagi kislorod aholi ehtiyojini qondira olmayapti. Holbuki, kislorod manbayi bo‘lgan o‘simliklar o‘nlab yillarda tiklanadi. Unumdor tuproq esa undan ham sekin tiklanadi. O‘lkamiz hududi qishloq xo‘jalik mahsulotlarini yetishtirish uchun qulay iqlim sharoitiga ega. Bu agroiqlim boyligi tugamaydigan tabiiy boylikdir. Mamlakatimiz hududi bitmas-tuganmas quyosh energiyasi boyligiga ega. Quyosh energiyasi tugamaydigan tabiiy boylikdir. Quyoshdan kelayotgan issiqlikni elektr energiyaga aylantirish istiqbollari juda kattadir. "
            },
            {
              "id": 4,
              "page": 13,
              "title": "AHOLI VA INSON OMILI",
              "desc": "O‘zbekiston kelajakda buyuk davlat bo‘lishi uchun qulay tabiiy sharoit ham, xilma-xil tabiiy boyliklar ham yetarlidir. Ammo bu boyliklar odamlarning aqliy va jismoniy mehnati orqaligina kishilar ehtiyojiga, jamiyat ravnaqiga xizmat qilishi mumkin. Millionlar mehnatini oqilona tashkil etish uchun aholi soni, tarkibi va mamlakat bo‘ylab joylashishi hisobga olinishi lozim. O‘zbekiston aholi va inson omili (mehnat resurs lari)ni takror ishlab chiqaruvchi mamlakatlardan biri hisob lanadi (4-rasm). O‘zbekiston aholi soni bo‘yicha jahon da gi 240 ga yaqin davlatlar ichida dastlabki 41 ta mamlakat orasida turadi. Aholi o‘lganlar soniga nisbatan tug‘ilgan lar sonining ortiqligi hisobiga doimo ko‘payib boradi. Bunday ko‘payish aholining tabiiy ko‘payishi deyiladi. Aholi migratsiya hisobiga ham ko‘payadi. Buni aholining mexanik ko‘payishi deyiladi (5-rasm). Migratsiya ko‘chish degan ma’noni bildiradi. Migratsiya ichki migratsiya va tashqi migratsiyaga bo‘linadi. Ichki migratsiya — aholining mamlakat ich ka ri sida, uning rayonlari o‘rtasida yoki qishloq joylardan shaharlarga ko‘ chib yurishi. Tashqi migratsiya — mamlakatdan ko‘chib ketish (emigrat siya) yoki mamlakatga ko‘ chib kelish (immigratsiya). Hozirda O‘zbekiston aholisining soni 30 million kishidan oshdi. Ammo ularning hammasi mehnatga yaroqli hisoblanmaydi. Erkaklarning 16 yoshdan 60 yoshga cha, ayol larning 16 yoshdan 55 yoshgacha bo‘lganlarigina mehnatga yaroqli hisoblanadi. Ishlab chiqarishning ba’zi sohalarida 50 yosh, hatto 40 yoshdan nafaqaga chiqariladi. Ayni vaqtda nafaqa yoshidagilar xohlasa ishlashlari ham mumkin. Shuningdek, 15 yoshga to‘lgan o‘quvchilar o‘qishdan bo‘sh vaqtlarida ishlashlariga ruxsat etilgan. Mehnatga yaroqlilar mamlakat jami aholisining yarmidan ortig‘ini tashkil etadi. Mehnatga yaroqlilarning asosiy qismi sanoatda, qishloq xo‘jaligida, qurilishda band. Ular foydali qazilmalar, mashinalar, oziq-ovqat va sanoat mahsulotlarini ishlab chiqaradi, paxta, g‘alla, kartoshka, uzum yetishtiradi, binolar bunyod etadi, ya’ni moddiy boylik yaratishadi. Ta’lim, fan, mada niyat, tibbiyot xodimlarining mehnat natijalari boshqacharoq. Ularning mehnat natijalari ham foydali va zaruriydir (6-rasm). Aholining jinsiy tarkibi. Aholi tarkibiga jins va yosh jihatdan yondashish katta ahamiyatga ega (7-rasm). Chunki aholini va inson omilini takror ishlab chiqarish xuddi ana shu jihatlarga bog‘liq. Ikkinchi jahon urushining asorati tufayli 1945–1960-yillarda O‘zbekiston aholisi tarkibida erkaklar soni ayollar sonidan ancha kam edi. Yillar o‘tishi bilan bu tafovut qisqara bordi. 1959-yilga kelib ayollar 52 foizni, erkaklar 48 foizni tashkil etdi. Hozirgi vaqtda aholi tarkibida erkaklar va ayollar soni deyarli o‘zaro tenglashdi. "
            },
            {
              "id": 5,
              "page": 27,
              "title": "YOQILG‘I SANOATI",
              "desc": "Gaz sanoati. Yoqilg‘i sanoatining eng yosh tarmog‘i bo‘lgan gaz sanoati keyingi yillarda jadal rivojlanmoqda. Gaz – yoqilg‘ining juda arzon turi. Gazdan sanoatda ham, maishiy hayotda ham foydalaniladi. Gaz qimmatbaho kimyoviy xomashyo hamdir. Yoqilg‘ining boshqa turlariga qaraganda gaz havoni eng kam ifl oslantiradi. Mamlakatimizda ko‘mir va neftga nisbatan tabiiy gaz ancha ko‘p (19-rasm). Aniqlangan gaz zaxiralari 2 trillion kub metrga yaqin. Gaz konlari neft konlari bilan yonma-yon joylash gan. Gazning ozroq qismi (yo‘l dosh gaz) neft bilan birga qazib chiqariladi, lekin gazning asosiy qismi sof gaz konlaridan olinadi. Respublikamizda o‘tgan asrning o‘rtalarida dastlab Far g‘ona vodiysidagi neft konlarida uchraydigan yo‘ldosh gazdan sanoatda va aholining maishiy ehtiyojida foydalanila boshlandi. 1950-yillarda O‘zbekistonda jami 9 mln kub metr tabiiy gaz qazib chiqarilgan bo‘lsa, endilikda yiliga qazib olinayotgan gaz 60 mlrd kub metrdan ortadi. Tabiiy gazdan foydalanish tufayli mamlakat yoqilg‘i balansida jiddiy o‘zgarish yuz berdi. Farg‘ona vodiysidan tashqari Buxoro, Surxondaryo va Qash qadaryo viloyatlari hamda Qoraqalpog‘iston Respublikasi hududidan boy tabiiy gaz konlari 10-dars 10-dars foydalanish imkoniyatiga, qazib chiqarish xarajatiga ham bog‘liq. Eng tejamli yoqilg‘i neft va gazdir, chunki ularni qazib chiqarish va ishlatiladigan joyga quvurlar orqali yuborish arzon tushadi. Shunga ko‘ra turli xil yoqilg‘ini qazib chiqarish va undan foydalanish ko‘lami davriy o‘zgarib turadi (18-rasm). Turli xil yoqilg‘ilarni qazib chiqarish va ishlab chiqarilgan energiya (kirim) hamda ulardan iqtisodiyotda foydalanish (sarf qilish) nisbati yoqilg‘i–energetika balansi deyiladi. 1. Energetika boy lik larining asosiy turlarini aytib bering. 2. Yoqilg‘i–energetika balansi deganda nimani tushunasiz? 3. O‘zbekiston yoqilg‘i–energetika balansida qanday o‘zgarishlar bo‘lmoqda va ? bunga sabab nima? 28 topilishi natijasida O‘zbekiston gazni eksport qila boshladi. Gaz quvurlar orqali yuborilishi sababli transport xarajati har qanday yoqilg‘ini tashishdan arzon tushadi. Gaz quvurlari ning uzunligi tez oshib bormoqda. Dastlabki tabiiy gaz quvurlari Farg‘ona vodiysida qurilgan edi. O‘zbekistonda issiq kunlar ko‘pligidan faqat qish kunlari gaz ko‘p talab qilinadi. Gazni ko‘p iste’mol qiladigan Toshkent, Farg‘ona, Andijon kabi shaharlarda yozda tejalgan gazni yerosti omborlariga yig‘ib qo‘yib qishda foydalaniladi. Gaz sifatli yoqilg‘igina emas, balki kimyo sanoatining qimmatli xomashyosi hamdir. Gazga bo‘lgan talab kimyo, issiqlik elektr stansiyalari va maishiy xo‘jalikda tobora ortib bormoqda. Shunga ko‘ra qo‘shimcha gaz chiqarish yo‘llari izlanmoqda, gaz quvurlarining gaz o‘tkazish imkoniyati oshi rilmoqda. Neft sanoati. Neftsiz hozirgi zamon iqtisodiyotini yuritish mumkin emas. Neft xom holida ishlatilmaydi. Qayta ishlash natijasida undan turli xil yoqilg‘i, ya’ni kimyoviy mahsulotlar olinadi. Neftni qazib chiqarish xarajati ko‘mirni qazib chiqarish xarajatidan o‘rta hisobda 4 barobar kam. Milliy iqtisodiyotda neftdan keng foydalanish juda ko‘p mablag‘ni tejashga imkon beradi. Mahsulot birligini olish (aytaylik, 1 t neft qazib chiqarish) uchun ketadigan pulda ifodalangan hamma xarajat mahsulot tannarxi deyiladi. Neftning tannarxi u qanday chuqurlikdan olinayot ganligidan ko‘ra konning neftga qanchalik boyligiga bog‘liq. Neft qazib olishning eng arzon usuli fontan usuli bo‘lib, bunda neft quduqlardan kondagi bosim tufayli otilib chiqadi. Bosim kamaygan holda uni turli usullar bilan ko‘tarib turiladi. Neftni nasoslar yordamida chiqarib olish ham keng tarqalgan. Gaz singari neftni ham quvurlar orqali yuborish uni tashishning eng arzon va xavfsiz usulidir (temiryo‘lda tashish ga nisbatan 4 barobar arzonga tushadi). Qu vur transporti neftni iste’mol chilarga bir maromda yetkazib be rishni ta’ min laydi. Tur li trans port vosita la ri ga ortishtushirish dagi muqarrar isrof gar chi lik ka barham beriladi."
            },
            {
              "id": 6,
              "page": 36,
              "title": "KIMYO SANOATI",
              "desc": "Kimyo sanoatining shakllanishi 1932-yilda Sho‘rsuv oltingugurt koni ishga tushirilishi bilan boshlandi. Uning mahsuloti ko‘proq mashinasozlik (plastmassa, oyna), to‘qimachilik sanoati (tola, bo‘yoqlar), qishloq xo‘jaligi (o‘g‘itlar, zaharli ximikatlar), transport (motor yoqilg‘isi, surtish moyi, sintetik kauchuk), qurilish (yopishqoq plyonka, oyna, plastik) kabilarda ishlatiladi. Kimyo sanoati tarkibida mineral o‘g‘itlar ishlab chiqarish salmoqli o‘rin egallaydi. Shuningdek, qishloq xo‘jalik zararkunandalariga qarshi defoliantlar ham ishlab chiqariladi. U ko‘plab tarmoqlarni xomashyo va materiallar bilan ta’minlar ekan, o‘z navbatida boshqa tarmoqlardan energiya, jihozlar va transport vositalarini oladi. Kimyo sanoati gaz hamda paxta sanoati xomashyosini va rangli metallurgiya chiqindilarini qayta ishlaydi. Demak, kimyo sanoati tarmoqlararo ikki tomonlama aloqadorlikda bo‘lib, ko‘plab tarmoqlarning rivojlanishi va hududiy joylashishiga ta’sir ko‘rsatadi (27-rasm). Kimyo sanoati sifat jihatdan tabiiy mahsulotlardan ustun turuvchi sun’iy materiallar yaratadi. Bunday materiallar tufayli kishilar mehnati ham, qishloq xo‘jaligi xomashyosi ham tejaladi. Masalan, kapron ishlab chiqarish uchun tabiiy ipak tayyorlashga qaraganda 20 barobar kam mehnat sarf qilinadi. Shuningdek, kimyo sanoati tufayli ishlab chiqarishni kombinatlashtirish istiqbollari yaratildi. Chunonchi, ko‘mir, neft, gaz singari yoqilg‘i xomashyolaridan energiya hosil qilishda ham, kimyo mahsulotlari (benzin, parafin) olishda ham foydalanilishi energetika-kimyo kombinatlari qurishga olib keldi. Kombinatlashtirish – sanoatning texnologik jarayon jihatidan o‘zaro bog‘langan, ba’zan turli tarmoqlarga taalluqli bo‘l gan bir qancha ishlab chiqarish korxonalarining bir korxonaga birlash tirilishidir. Kimyo sanoatining xomashyo bazasi boy va xilma-xil. U turli foydali qazilmalardan, ishlab chiqarish chiqindilaridan, yog‘och, suv, hatto havodan foydalanadi. Turli xil xomashyolardan foydalanish imkoniyatining cheksizligi kimyo sanoati korxonalarini hamma joyda qurishga imkon beradi. Biroq kimyo korxonalari energiya va suvni ko‘p ishlatishi, ayniqsa, tabiatga jiddiy salbiy ta’sir ko‘rsatishi sababidan ularni hamma joyda ham qurish maqbul bo‘lavermaydi. Kimyo sanoatining yirik korxonasi – Chirchiq elektr-kimyo kombinati 1940-yilda ishga tushgan. Chirchiq elektr-kimyo kombinati dastlab havo tarkibidagi azotdan elektr energiyasi vositasida azotli o‘g‘it ishlab chiqargan. Buxoro viloyatida topilgan tabiiy gaz quvur orqali Chirchiqqa keltirilgach, kombinat gazdan xomashyo o‘rnida foy da la na digan bo‘ldi. Bu mahsulot ishlab chiqarishning keskin ko‘payishi va tannarxning arzonla shishiga olib keldi. Kom binatda azotli o‘g‘itdan tashqari, mag niy xlorit (g‘o‘za bargini to‘kishda qo‘llaniladigan kimyoviy modda) hamda plastmassa va sintetik tola olish uchun organik sin tez mahsulotlari ishlab chiqarilmoqda. Tabiiy gazdan azotli o‘g‘it va kimyoviy tola ishlab chiqaradigan zavodlar Farg‘ona va Navoiy sha har larida ham barpo etildi. 1946-yilda Qo‘qonda, 1957-yilda Samar qandda superfosfat zavodi ishga tushdi. 1998-yilda Qizilqum fosforit kombinati ishga tushirildi. Unda 2,7 mil lion tonna fosforit konsentrati olinadi."
            },
            {
              "id": 7,
              "page": 43,
              "title": "QIMMATBAHO VA OG‘IR METALLAR",
              "desc": "Oltin – noyob metall. U yer ostida ham, namlikda ham o‘z xususiyatini yo‘qotmaydi. Ammo uni izlab topish va tog‘ jinslaridan ajratib olish juda ko‘p mehnat, mablag‘ talab etadi. Oltin siz bilgan zargarlikdan tashqari elektro nika, kompyuter ishlab chiqarishda, kosmik kemalarda, atom reaktorlarida ko‘p qo‘llaniladi. Bitta atom reaktorining ichki devori 16 kg oltin bilan qoplanadi. O‘zbekiston oltin qa zib chiqarish bo‘yicha dunyo da yettinchi, MDH davlatlari ichida esa ikkin chi o‘rinda turadi. Samarqand bilan Buxoro oralig‘idagi tog‘lardan ikki ming yil burun ham oltin qazib olingan. X–XIII asrlarda kon sanoati o‘z zamonasiga xos yuksak rivojlangan. XIX asrda Rossiya imperiyasi Turkistonni bosib olgach, mavjud konlarni xaritalarga tushirdi. Oltin qidiruv ishlarini barcha joylarda kuchaytirdi. XX asr o‘rtalaridan o‘zbek olimlarining izlanishlari asosida Muruntov, Chodak, Zarmitan, Qo‘shbuloq, Qizilolma, Marjonbuloq oltin konlari aniqlandi. 1969-yilda dastlabki oltin yombisi quyildi. Shu vaqtdan oltin qazib olish sanoati shakllandi. Mamlakatimizda oltin qazib olish sanoatining yana bir yirik markazi – Navoiy kon-metallurgiya kombinatidir. Zarafshonda tashkil etilgan oltin qazib olish bo‘yicha O‘zbekiston–AQSH «Zaraf shon–Nyumont» qo‘shma kor xonasi 1995-yildan mahsulot ishlab chiqara boshladi. Muruntov koni O‘z bekistondagina emas, Yevrosiyodagi oltin konlari ichida eng kattasi bo‘lib, ruda qazib olingan joy hajmi 2×4 km va chuqurligi 400 metrdan ortiq afsonaviy o‘rani eslatadi (32-rasm). Oltindan keyin turadigan qimmatbaho metall – bu kumushdir. Qurama tog‘ tizmalarida yirik kumush konlari topilgan. Toshkent oldi rayonida kumush katta miqdorda ajratib olinmoqda. Qizilqumda kumush ishlab chiqarishni ko‘paytirish borasida keng ko‘lamli tadbirlar amalga oshirilmoqda. Hozirgi kunga kelib tarkibida oltin va kumush bo‘lgan 30 dan ortiq ruda konlari aniqlangan. 16-dars 16-dars QIMMATBAHO VA OG‘IR METALLAR 32-rasm. Muruntov oltin koni. 44 ? Metallar iqtisodiyotda turli maqsadlarda ishlatiladi. Mis sof holida ham, qalayi bilan (bronza), nikel bilan (melxior), aluminiy bilan (duraluminiy), rux bilan (latun) qotishma holda ham elektrotexnikada va mashinasozlikda keng foydalaniladi. Qo‘rg‘oshin akkumulatorlar, elektr kabellari ishlab chiqarishda ishlatiladi. Temir buyumlar zanglamasligi uchun rux bilan sirlanadi. Qalaydan oq tunuka va podshipnik lar yasashda foydalaniladi. Mamlakatimizda kumush, uran, volfram va boshqa qimmatbaho ruda konlari ham bor. Mеtallurgiyaning atrof-muhitga ta’siri. Mеtallurgiya majmuasi mamlakatimizda tеz rivojlanayotgan sohalardan biri bo‘lishi bilan birgalikda atrofmuhitga salbiy ta’sir ko‘rsatuvchilardan ham hisoblanadi. Mеtallurgiya tabiiy majmualarning barcha tarkibiy qismlariga ta’sir etadi. Tog‘-kon sanoati tuproq qatlamini buzib, landshaftlarning «yo‘qolishiga» sabab bo‘ladi. Mazkur sanoat tufayli katta karyеrlar va yеr ostida g‘orlar paydo bo‘lmoqda. Ular bosib qolish va antropogеn yеr silkinishi хavfi ni tug‘diradi. Ko‘p yеrlarni mеtallurgiya chiqindilari egallab yotibdi. Boyitish fabrikalarida ishlatilgan suvni oqar suvlarga tashlash, ushbu suvlarni yaroqsiz holga olib kеlmoqda. Mеtallurgiya zararli moddalarni ko‘p miqdorini atmosfеraga chiqaradi. Jumladan, gaz qoldiqlari (oltingugurt va boshqalar) tarkibida mеtall bo‘lgan chang va boshqa elеmеntlar juda хavfl idir. Bularning barchasi atrof-muhitda tеmir, qo‘rg‘oshin, mis, simob miqdorining ko‘payishiga olib kеladi. Ular tuproq, o‘simlik va hayvonlar tanasida yig‘ilib, inson a’zosiga o‘tganidan kеyin asta-sеkin uni zaharlay boshlaydi. "
            },
            {
              "id": 8,
              "page": 49,
              "title": "QISHLOQ XO‘JALIK MASHINASOZLIGI",
              "desc": "O‘zbekiston iqtisodiyoti uchun an’anaviy ixtisosli sohalar hisoblangan paxta, pilla, kanop yetishtirish va ularni qayta ishlash qo‘l mehnatini ko‘p talab qiladi. Shu sababli qishloq xo‘jaligining ixtisoslashgan sohalarini mexanizatsiyalashni ta’minlovchi, ya’ni yer haydash, ekin ekish va ishlov berish, hosilni yig‘ib olish hamda tayyor xomashyoni qayta ishlashda qo‘llanadigan mashina va asboblar ishlab chiqaradigan ma shinasozlik tarmoqlari vujudga keldi. Toshkentdagi «Toshqishloqmash», «O‘zbekqish loqmash» va Chirchiqdagi «Chirchiqqishloqmash» kabi zavodlar qishloq xo‘jaligi mashinasozligining asosiy korxonalaridir. Bu zavodlar paxtachilik uchun traktor seyalkalari, kultivatorlar, g‘o‘zapoya yuladigan, ko‘rak teradigan va chuviydigan, o‘g‘it aralashtira digan, qishloq xo‘jaligi zararkunandalarini yo‘qotishda zaharli moddalarni purkaydigan mashinalar ishlab chiqaradi. 1994-yilda O‘zbek–Isroil qo‘shma korxonasida paxta teradigan mashinaning yangi modeli yaratildi (37-rasm). Suv omborlari, kanallar qurilishi va ularni loyqadan tozalashda, suvni yuqoriga ko‘tarishda, umuman, irri gatsiyada qo‘llaniladigan mashinalar ishlab chiqaruvchi irrigatsiya mashinasoz ligi ham agrosanoat majmuasi ehtiyojiga ko‘ra vujudga keldi. Irrigatsiya mashinasoz ligining markazi Andijon viloyati hisob lanadi. Paxtachilik rivojlangani sayin trak tor lar ga, paxta tashiydigan mashina va me xanizmlarga ehtiyoj orta bordi. Shuning uchun Toshkent traktor zavodi – TTZda universal traktorlar, paxtani qop-qanorsiz tashishga mo‘ljallangan ag‘darma tirkamalar ishlab chiqarila boshlandi. Toshkent, Andijon, Samarqand va Kattaqo‘rg‘onda paxta tozalash hamda yog‘ sanoati uchun mashina va uskunalar ishlab chiqaruvchi mashinasozlik zavodlari joylashgan. Milliy iqtisodiyotda, ayniqsa, qishloq QISHLOQ XO‘JALIK MASHINASOZLIGI 37-rasm. Paxta terish mashinasi. 19-dars 19-dars 50 ? Mashinasozlik majmuasining yuksalishiga hamohang korxonalar tobora alohida detallarni ishlab chiqarishga ixtisoslashmoqda. Ayni vaqtda tayyor mahsulot qiymatida xomashyo hissasi qisqarib malakali mehnat hissasi, ahamiyati ortmoqda. Bunday jarayonni mashinasozlik korxonalari qoshida kasb-hunar kollejlari, ilmiy tajriba-konstruktorlik byurolari singari ilmiy muassasalar faoliyat ko‘rsatayotganida ham kuzatish mumkin. Poytaxtimiz Toshkentdagi avia tsiya ishlab chiqarish birlashmasini o‘shanday korxonalarning namunasi deyish mumkin. Bu korxonani shahar ichidagi shahar desa bo‘ladi. Unda o‘n minglab ishchi, muhandis, ixtirochilar ishlaydi. Jahonda eng ulkan «Antey» rusumli transport samolyoti shu korxonada bunyod etilgan. 1993-yilda birlashma IL–114 rusumli 64 nafar yo‘lovchiga mo‘ljallangan yangi samolyot ishlab chiqardi. U AN–24 va YAK–40 singari eskirgan samolyotlarga qaraganda yoqilg‘ini 2 barobar kam sarfl aydi. O‘tgan asrning o‘rtalaridan boshlab elektrotexnika sanoati alohida tarmoq tarzida shakllandi. O‘ndan ortiq elektrotexnika zavodlari ishladi. EHM ishlab chiqaradigan «Algoritm» zavodiga asos solindi. EHM uchun mikroelektronika elementlari, mikro sxemalar, masofadan turib boshqarish sistemalari va boshqa mahsulotlar ishlab chiqaradigan «Zenit» zavodi ishga tushirildi. 1990-yilda konsern «O‘zeltex sanoat» uyushmasiga aylantirildi. Uyushma tarkibida 50 dan ortiq korxona faoliyat ko‘rsatmoqda. Uyushma korxonalari bilan Rossiya, Turkiya, Janubiy Koreya, AQSH, Singapur va boshqa xo‘jaligida mashina va mexanizmlar ko‘plab qo‘llanilayotganidan ularga ehtiyot qismlar yetkazib beradigan hamda sozlaydigan korxonalar deyarli barcha viloyatlarda barpo etilgan. Samarqanddagi «Paxtamash» zavodi ehtiyot qismlar ishlab chiqaradigan korxonalarning eng yirigidir. Bog‘dorchilik, uzumchilik va polizchilikda qo‘llaniladigan mashina va moslamalar «O‘rta Osiyoqishloqmash» birlashmasida ishlab chiqarilmoqda"
            },
            {
              "id": 9,
              "page": 58,
              "title": "AGROSANOAT MAJMUASI",
              "desc": "Аgrоsаnоаt mаjmuаsi O‘zbеkistоndа tаrmоqlаrаrо mаjmuаlаrning dаstlаbki vа yеtаkchisidir. U qishlоq хo‘jаligi nеgizidа shаkllаngаn. Agrosanoat majmuasi (ASM) – qishloq xo‘jalik mahsulo tini yetishtirish va uni iste’mol chiga yetka zish jarayonida aloqador barcha tarmoqlar uyg‘unligidir. Qishlоq хo‘jаligi bilаn u yеtishtirgаn mаhsulоtlаrni qаytа ishlаydigаn yеngil vаоziq-оvqаt sаnоаti tаrmоqlаri dа’fаtаn АSM tuzilmаsini tаshkil etgаn. Bulаrgа qo‘shimchа rаvishdа qishlоq хo‘jаligidа fоydаlаnilаdigаn mехаnizmlаrni ishlаb chiqаrаdigаn vа ulаrni tа’mirlаydigаn kоrхоnаlаr, minеrаl o‘g‘it hаmdа o‘simlik zаrаrkunаndаlаrigа qаrshi qo‘llаnilаdigаn mоddаlаr ish lаb chiqаrаdigаn kimyo sаnоаti tаrmоqlаri hаm АSMgа kirаdi. Bu tаrmоqlаr аslidа оg‘ir sаnоаtgа tеgishli bo‘lsа-dа, аmmо ulаr ishlаb chiqаrish ko‘lаmi vа sаmаrаdоrligining bеlgilоvchi оmili ekаnidаn АSMda birinchi guruhni, qishlоq хo‘jаligi ikkinchi, qishlоq хo‘jаligi mаhsulоtlаrini qаytа ish lаydigаn tаrmоqlаr uchinchi guruhni tаshkil etаdi (44-rаsm). Iqtisоdiyotdа bаnd аhоlining kаttа qismi АSM tаrmоqlаridа 59 mеhnаt qilаdi. Chаkаnа sаvdо ning аsоsiy qismini qishlоq хo‘ jаligi mаhsulоtlаri yoki shu mаh sulоtlаrni qаytа ishlаb tаyyor lаn gаn tоvаrlаr sаvdоsi tаshkil etаdi. Dеmаk, хаlqimiz fаrо vоnligi, dаs turхоnimiz to‘kinligi, yanа hаm muhimi, аhоlining ish bilаn bаndligi АSM hоlаtigа bоg‘liq. Аfsuski, mustаqillikkаchа bo‘lgаn dаvrdа O‘zbеkistоndа pахtа yakkа hоkimligining hukmrоnligi qishlоq хo‘jаligi tаrmоqlаrini uyg‘un rivоjlаntirish imkоnini bеrmаdi. Nаtijаdа sаnоаt mаhsulоtlаri qаtоri аyrim оziq-оvqаt mаhsulоtlаri hаm chеtdаn kеltirildi. Endilikdа bu nоmаqbulchilikni ikki yo‘l bilаn sоbitqаdаm bаrtаrаf etilmоqdа. Birinchidаn, qishlоq хo‘jаligi dа ekin mаydоnlаri tаrkibi tubdаn o‘z gаr tirildi. Ekin mаydоn lаrini оptimаllаshtirish vа qishlоq хo‘jаligi ekinlаrini rаyоnlаshtirish bоrаsidа hаr tоmоnlаmа puхtа o‘ylаngаn siyosаt оlib bо rilа yotgаni eng muhim хоm аshyo vа ekspоrtbоp mаhsulоt bo‘lmish pахtа yеtishtirishning nisbаtаn bаr qаrоr hаjmini sаqlа gаn hоldа bоshqа qishlоq хo‘jа ligi mаhsu lоtlаri yеtishtirishni bir nеchа marta ko‘pаytirish imkоnini bеrdi. Eng muhimi, хаlqimizni оziq-оvqаt mаh sulоtlаri bilаn to‘liq tа’minlаshgа zаmin tug‘dirdiIkkinchidаn, yеrgа bo‘lgаn mulk shаkli o‘zgаrtirildi. Mа’lumki, mustаqillikdan oldingi dаvrdа dеhqоnlаr yеrdаn butkul mаhrum edi. Nаtijаdа qishlоq хo‘jаligidа ishlаshgа ishtiyoq susаyib tаdbirkоrlik zаvоl ko‘rdi. Endilikdа dеhqоn хo‘jаligi, fеrmеr хo‘jаligi kаbi mulkchilikning хilmа-хil shаkllаri qаrоr tоpdi vа qishlоq хo‘jаligidа ishlаb chiqаrilаyotgаn mаhsulоtlаrning аsоsiy qismi ulаr hissаsigа to‘g‘ri kеlmоqdа (45-rаsm). "
            },
            {
              "id": 10,
              "page": 66,
              "title": "CHORVACHILIK",
              "desc": "Qishloq xo‘jaligining chorvachilik tarmog‘i: qoramolchilik, qo‘ychi lik, pillachilik, yilqichilik va parrandachilikka bo‘linadi. Unga asalarichilik, cho‘chqachilik va baliqchilik ham kiritiladi. Qishloq xo‘jalik yerlarining 2/3 qismidan chorvachilikda foydalaniladi. Mamlakatimizning dasht va cho‘llaridagi o‘tloq va butazorlar qorako‘l qo‘ylari va tuya boqish uchun qulay. Tog‘ va tog‘oldi mintaqalarida anchagina sero‘t yaylovlar bor. Bu mintaqalarda qo‘y, mayin junli echki, go‘sht-sut uchun qoramol boqiladi hamda yilqichilik rivojlangan. Chorvachilik paxtachilik bilan ko‘p tomonlama bog‘liq. Buni fermer xo‘jaliklarda paxtachilikdan olinadigan (kunjara, sheluxa singari) ozuqa yemdan foyda lanishda yaqqol ko‘rish mumkin. Paxtani beda va jo‘xori bilan almashlab ekish go‘shtsut chorvachiligini ozuqa bilan ham ta’minlaydi. Mamlakatimizda qo‘y va echkilarning umumiy soni 16 mln dan ortiq, ularning asosiy qismi qorako‘l qo‘ylardir (52-rasm). Qorako‘l qo‘y lari (Toshkent, Andijon, Farg‘ona, Namangan viloyatlaridan tashqari) barcha viloyatlarda boqiladi. Ulardan asosan teri, jun hamda go‘sht olinadi. Echkilar respublikaning deyarli barcha viloyatlarida, asosan, mayin tivit va jun uchun boqiladi (53-rasm). Qoramol ham barcha viloyatlarda boqiladi. Qoramollar go‘sht va sut mahsulotlarini olish maqsadida boqiladi. Mamlakatimizda qoramollarning jami soni 9,6 mln boshdan ortiq. Yilqilar Samarqand, Qashqa daryo, Xorazm viloyatlari va Qoraqal pog‘istonda boqiladi. Ularning soni 150 ming bosh ga yaqinlashadi. Ilgari paxtachilikdagi ko‘pgina yumush (yuk tashish, paxtaga ishlov berish va hokazo)larni bajarishda otlar dan foydalanilgan. Zero, yilqi chilik bilan paxtachilik o‘zaro aloqador bo‘lgan. Bu ishlar endilikda texnika vositasida bajarilayotganligi tufayli bugungi kunda otlar turli sport o‘yinlari, shaxsiy xo‘jalikda foydalanish, go‘sht va qimiz olish maqsadida boqilmoqda. Cho‘llarda tuya boqiladi. Tuyadan ishchi hayvon sifatida foydalaniladi, shuningdek, ulardan jun, sut olinadi. 53-rasm. O‘zbekistonning chorvachilik keng tarqalgan rayonlari. Navoiy TOSHKENT Andijon Namangan Farg‘ona Guliston Jizzax Buxoro Samarqand Qarshi Termiz 0 100 km Nukus Urganch Sug‘oriladigan yerlarda dehqonchilik Lalmi yerlarda dehqonchilik Cho‘l-yaylov zonasi Tog‘-yaylov zonasi Qo‘riqlanadigan yerlar Qishloq xo‘jaligi ixtisoslashuvi qo‘ychilik qo‘ylarini ko‘paytirish echkilarni ko‘paytirish yilqichilik tuyachilik hisor qo‘ylarini ko‘paytirish qorako‘l cho‘chqachilik parrandachilik asalarichilik ipakchilik baliqchilik Keng tarqalgan rayonlar 68 8-dars mavzusidan yеngil sa nоat ning yalpi sanоat mahsulоtidagi salmоg‘ini aniqlang. 25-dars mavzusidan ma’lumki, yengil sanoat oziq-ovqat sanoati bilan birga O‘zbekiston ASMning uchinchi guruhini tashkil etadi. U, asosan, paxtachilik va pillachilik negizida tarkib topdi. Paxta tozalash, to‘qimachilik, trikotaj, poyabzal, ko‘nchilik, ipak ishlab chiqarish yengil sanoatning muhim tarmoqlari hisoblanadi (54-rasm). Paxta tozalash sanoati ishlab chiqarish jarayoni bir-biriga 54-rasm. Yengil sanoat tarmoqlari. bog‘liq bo‘lgan paxta tozalash 29-dars 29-dars YENGIL SANOAT ? 1. Chorvachilikning qaysi tarmoqlarini bilasiz? 2. O‘zbekistonning qaysi hududlarida, asosan, qoramol boqiladi? 3. Pillachilik va parrandachilik qayerlarda rivojlanmoqda? 4. Siz yashab turgan tuman va viloyatda chorvachilikning qaysi tarmog‘i yaxshi yo‘lga qo‘yilgan? Bunga sabab nima? Pillachilik ham mamlakatimiz qishloq xo‘jaligining eng qadimgi tarmoqlaridan biri bo‘lib, paxtachilik bilan bog‘liq. Ipak qurtining ozuqasi – tut daraxti paxta paykallari chekkalarida, ariq va kanallar hamda yo‘l yoqalarida o‘stiriladi. Tut daraxti g‘o‘zani kuchli shamoldan, ariq va kanallar qirg‘og‘ini yuvilishdan saqlaydi. Pillachilikning paxtachilik bilan bog‘liqligi shu bilangina cheklanmaydi. Ma’lumki, ipak qurti aprel–may oylarida boqiladi. Bu vaqtda paxtachilikda ishlar kamayib, bo‘shagan ishchi kuchidan qurt boqishda foydalaniladi. "
            }
          ]
        },
        {
          "classId": 2,
          "classLevel": 9,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "Darslikning asosiy maqsadi – Siz, aziz o‘quvchilarga jahon va uning yi rik mamlakatlari iqtisodiy va ijtimoiy geografiyasiga doir zamonaviy bilim berish, mustaqil bilim olishga va uni amaliyotda qo‘llashga o‘rgatishdan iboratdir. Darslik ikki — «Jahonning umumiy tavsifi» va «Jahonning regional tavsifi» bo‘limlaridan iborat. Umumiy qismning asosiy vazifalari jahon ning siyosiy xaritasi, tabiiy resurslari, aholisi va xo‘jaligi haqidagi umumiy ilmiy tasavvurni shakllantirishdan iborat. Darslik hajmining deyarli 2/3 qismini egallagan regional qismida jahonning yirik mintaqalari – Yevropa, Osiyo, Afrika, Amerika va Avstraliyaning siyosiy xaritasi, tabiiy resurs lari, aholisi va iqtisodiyotining o‘ziga xos xususiyatlari ochib berilgan. Shuningdek, barcha qit’alardagi tayanch, ya’ni har tomonlama e’tiborga sazovor davlatlarning geografik tavsiflariga bag‘ishlangan mavzular ham ushbu bo‘limdan joy olgan."
            },
            {
              "id": 2,
              "page": 4,
              "title": "1-§. Jahonning siyosiy xaritasi",
              "desc": "Jahonning siyosiy xaritasida, 2018-yil holatiga ko‘ra, 240 dan ortiq mamlakat bo‘lib, jumladan jahon hamjamiyati tomonidan mustaqilligi ras man tan olingan 194 ta suveren davlat mavjud. Bulardan 193 tasi BMTning faoliyatida a’zo davlatlar sifatida, 1 tasi (Vatikan) esa kuzatuvchi-davlat bo‘lib ishtirok etmoqda. Davlatlar bir-biridan turli xususiyatlari bilan ajralib turadi. Bun day muhim jihatlaridan biri hududning kattaligi hisoblanadi. Jahondagi 29 ta mustaqil davlatning maydoni 1 mln km2 dan katta bo‘lib, jumladan 12 tasining hududi 2 mln km2 dan, 6 tasining maydoni 5 mln km2 dan kat tadir. Shu bilan birga dunyodagi davlatlar orasida bir guruh hududiy jiha tidan mayda, yoki «mitti» davlatlar ham o‘ziga e’tibor tortadi (1-jadvalga qarang). Jahonning siyosiy xaritasida maydoni 1 ming km2 ga yetmaydi gan 24 ta mustaqil davlat bor. Bunday davlatlar turli qit’alarda, xususan Yevropada (Vatikan, Monako, San-Marino, Lixtenshteyn va boshqalar), Osiyoda (Maldiv Respublikasi, Singapur, Bahrayn), Amerikada (Sent-Kits va Nevis, Grenada, Barbados va boshqalar), Okeaniyada (Nauru, Tuvalu, Marshall orollari va boshqalar) joylashgan."
            },
            {
              "id": 3,
              "page": 7,
              "title": "2-§. Jahon mamlakatlarining ijtimoiy-iqtisodiy rivojlanganligi bo‘yicha tasnifi",
              "desc": "Jahon mamlakatlarining eng muhim belgilaridan biri – ularning ij timoiy-iqtisodiy rivojlanish darajasidir. Davlatlarning ijtimoiy-iqtisodiy rivojlanganligini baholash uchun bir qancha mezonlar qo‘llaniladi. Bu mezonlardan asosiylari: – yalpi ichki mahsulot (YIM)ning umumiy va aholi jon boshiga nis batan hajmi; – milliy iqtisodiyotning tarmoqlar tarkibi; – eksportning tovar tarkibi hamda mamlakatning xalqaro ixtisoslashuvi; – turli ko‘rsatkichlar bilan belgilanadigan aholining turmush darajasi. Jahon mamlakatlari ushbu mezonlar asosida BMT tomonidan 3 ta yirik blokka bo‘linadi: rivojlangan, rivojlanayotgan va o‘tish iqtisodiyotidagi mamlakatlar. Rivojlangan mamlakatlar qatoriga, odatda Yevropadagi ko‘plab davlat lar (Sharqiy Yevropadan tashqari), AQSH, Kanada, Yaponiya, Avstraliya, Yangi Zelandiya, Isroil va Janubiy Afrika Respublikasi kabi davlatlar kiritiladi."
            },
            {
              "id": 4,
              "page": 9,
              "title": "3-§. Mamlakatlarning boshqaruv shakli va davlat tuzilishi",
              "desc": "Hozirgi vaqtda dunyoda 44 ta monarxiya davlatlari mavjud bo‘lib, ular konstitutsion va mutlaq monarxiyalarga bo‘linadi (1-rasm). Konsti tutsion monarxiyalarda davlat rahbari (qirol, amir, knyaz va h.k.)ning si yosiy vakolatlari ma’lum darajada cheklangan bo‘lib, davlat boshqaruvida parlament va hukumatning o‘rni muhim hisoblanadi. Mutlaq monarxiya boshqaruv shakliga ega bo‘lgan davlatlarda esa monarxning vakolatlari cheklanmagan bo‘ladi."
            },
            {
              "id": 5,
              "page": 12,
              "title": "4-§. Dunyoning tabiiy resurslari",
              "desc": "Insoniyat o‘z hayoti va ijtimoiy faoliyati davomida turli xil tabiiy boyliklar (resurslar)dan foydalanadi. Tabiiy resurslar deb, inson hayo ti va faoliyati davomida bevosita foydalaniladigan barcha turdagi tabiat ne’matlariga aytiladi. Sayyoramiz ko‘p va xilma-xil tabiiy resurslarga ega. Tabiiy resurslar orasida mineral, yer, suv, biologik va iqlimiy resurslarning iqtisodiy ahamiyati yuqori.Tabiiy resurslar tugaydigan va tugamaydigan guruhlarga bo‘linadi. Yer, suv, mineral, biologik resurslar tugaydigan tabiiy resurslar qatoriga kiradi. Ular, o‘z navbatida, tiklanadigan va tiklanmaydigan guruhlarga bo‘linadi. Tiklanish xususiyatiga yer, suv hamda biologik resurslar ega. Mineral resurslar, ya’ni foydali qazilmalar, tiklanmaydigan tabiiy boylik hisoblanadi."
            },
            {
              "id": 6,
              "page": 14,
              "title": "5-§. Mineral resurslar geografiyasi",
              "desc": "Tabiatda minerallar holida uchraydigan tabiiy boyliklar mineral re surslar (foydali qazilmalar) deyiladi. Inson juda qadim zamonlardanoq mavjud resurslardan foydalanib kelgan. Davrlar o‘tishi bilan esa foyda laniladigan mineral resurslar turi va hajmi tobora ortib borgan. Hozirgi vaqtda mineral resurslarning 200 ga yaqin turlaridan xo‘jalik ehtiyojlari uchun foydalanilmoqda. Ular 3 guruhga, ya’ni yoqilg‘i-energetika, rudali va noruda mineral resurslariga bo‘linadi. Tugaydigan va tiklanmaydigan tabiiy resurs hisoblanadigan yerosti qazilma boyliklaridan foydalanish hajmi yildan yilga oshib bormoqda."
            },
            {
              "id": 7,
              "page": 17,
              "title": "6-§. Tugamaydigan va tiklanadigan tabiiy resurslar geografiyasi",
              "desc": "Agroiqlimiy resurslar. Hududlarning turli ekin yetishtirish imkoniyat lari ko‘p jihatdan iqlimga bog‘liq. Qishloq xo‘jaligi tarmoqlari rivojlani shiga ta’sir ko‘rsatuvchi iqlim imkoniyatlari agroiqlimiy resurslar deyiladi. Eng muhim agroiqlimiy ko‘rsatkichlar samarali haroratlar (+10 oC dan yuqori) yillik yig‘indisi hamda namlanish koeffitsiyenti (yog‘inlar miq dorining mumkin bo‘lgan bug‘lanishga nisbati) hisoblanadi. Ma’lumki, havo harorati ekvatordan qutbiy kengliklarga tomon pasayib boradi. Ekvator atrofida samarali haroratning yillik yig‘indisi 8 000 oC dan yuqori bo‘lsa, arktika va subarktika iqlim mintaqalarida u 400 oC ga ham yetmaydi. Shuning uchun ham tropik, subekvatorial va ekvatorial iqlim mintaqalarida turli issiqsevar ekinlarni yetishtirish hamda yil davomida ikki-uch marotaba hosil olish imkoniyati mavjud."
            },
            {
              "id": 8,
              "page": 20,
              "title": "7-§. Zamonaviy ekologik muammolar",
              "desc": "Jamiyat butun tarixi davomida tabiiy muhit bilan chambarchas bog‘liq ravishda rivojlanib borgan. Tabiiy resurslardan foydalanish, ularni muho faza qilish va qayta tiklash bilan bog‘liq faoliyat sohasi tabiatdan foy dalanish deb ataladi. Tabiatdan foydalanish oqilona va nooqilona tarz da amalga oshirilishi mumkin. Tabiatdan oqilona foydalanilganda, tabiiy boyliklar me’yorida iste’mol qilinib, ularni muhofazalash va qayta tik lashga, atrof tabiiy muhitning sog‘lom holatini saqlashga kerakli daraja da e’tibor beriladi. Agar jamiyatning xo‘jalik faoliyati natijasida tabii muhit va uning resurslari holati salbiy tomonga o‘zgarib borsa, tabiatdan foydalanish nooqilona hisoblanadi. Tabiatdan nooqilona foydalanilganda,"
            },
            {
              "id": 9,
              "page": 24,
              "title": "8-§. Jahon aholisining soni, o‘sishi va joylashuvi",
              "desc": "Jahon aholisining soni, 2018-yil ma’lumotlariga binoan, 7 mlrd. 620 mln. kishidan ortiqdir. Sayyoramiz aholisi bu miqdoriy marraga yetganligining o‘ziga xos tarixi mavjud. Ilmiy manbalar ma’lumotlariga ko‘ra, insonlarning eng qadimgi ongli vakillari – Homo sapiens – bundan taxminan 50 ming yillar avval pay do bo‘lgan. Shimoli-sharqiy va Sharqiy Afrika, Janubiy Yevropa hamda Old Osiyo ilk insonlar paydo bo‘lgan va ular tomonidan birinchi bo‘lib o‘zlashtirilgan hududlar hisoblanadi. Keyinchalik qadimiy insonlarning turli mintaqalarga tomon yurishi – ilk migratsiyalar natijasida u yerlar aholi tomonidan o‘zlashtirila boshlangan."
            },
            {
              "id": 10,
              "page": 24,
              "title": "9-§. Jahon aholisining jinsiy, yosh, irqiy tarkibi",
              "desc": "Aholi tabiiy o‘sish sur‘atlari aholining yosh-jins tarkibiga ta’sir ko‘rsatadi. Aholi yosh tarkibiga ko‘ra bolalar (0–14 yosh), mehnat yoshi dagilar (15–64 yosh) hamda keksalar (65 yosh va undan yuqori) guruh lariga ajratiladi. Yosh guruhlari orasidagi nisbat o‘tgan tarixiy davrlar davomida o‘zgarib kelgan. Uzoq davrlar davomida jahon aholisi yosh tarkibida keksalar salmog‘i juda past bo‘lib, XX asrga kelib yildan yil ga ushbu guruh vakillari ulushi orta boshladi. Bunga, birinchi navbatda, tibbiy xizmatning rivojlanishi, aholi turmush darajasining o‘sishi sabab bo‘ldi. Hozirgi davrda jahon mintaqalari aholisining yosh tarkibi turlichaTabiiy o‘sish yuqori bo‘lgan Afrika va Osiyo aholisi yosh tarkibida bolalar salmog‘i qariyalarnikiga nisbatan ancha yuqoriligi ko‘zga tashlan sa, demografik inqiroz kuzatilayotgan Yevropa davlatlarida bu holatning teskarisiga guvoh bo‘lish mumkin. Bolalar salmog‘ining yuqoriligi bilan Niger (50 %), Mali (48 %), Uganda (48 %) kabi Afrika davlatlari ajralibniya (13 %), Italiya (13 %), Gretsiya (14 %) davlatlarida qayd qilingan."
            }
          ]
        },
        {
          "classId": 3,
          "classLevel": 10,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "1-§. GEOGRAFIYA FANLARI TIZIMI HAQIDA TUSHUNCHA",
              "desc": "Ma’lumki, geografi ya eng qadimgi fanlardan biri bo‘lib, o‘rganadigan hodisalarining doirasi juda keng. Dastlab, 5-sinfda Siz geografi yaga “Yer yuzi tabiati, aholisi va inson xo‘jalik faoliyatini o‘rganuvchi fan” deb berilgan ta’rif bilan tanishgansiz. Keyinchalik geografi ya fanining o‘rganish obyekti geografi k qobiq ekanligini ham bilib oldingiz. Geografi k qobiq sayyoramizdagi eng yirik geotizim, ya’ni Yerning qattiq (litosfera), suv (gidrosfera), havo (atmosfera) hamda hayot (biosfera) qobiqlarining o‘zaro tutashuvi va ta’siri doirasida vujudga kelgan va rivojlanayotgan juda murakkab yaxlit tabiiy tizimdir. Aynan geografi k qobiq insoniyatning yashash va ishlab chiqarish faoliyati muhiti, tabiiy resurslarning asosiy manbayi hisoblanadi. Geografi k qobiq, o‘z navbatida, bir-biri bilan bog‘langan ko‘plab katta-kichik tabiiy geografi k birliklarga, ya’ni quruqlik va suvlik, materiklar va okeanlar, tabiiy geografi k o‘lkalar, tabiat zonalari, provinsiyalar, tabiiy geografi k okruglar va hokazolarga bo‘linadi hamda bularning barchasi geografi ya fani tomonidan har tomonlama tadqiq etiladi. Shuningdek, geografi ya jamiyatning tarixiy rivojlanishi mobaynida paydo bo‘lgan hududiy tuzilmalar – mamlakatlar, viloyatlar, shahar va qishloqlarni ham o‘rganadi. Geografi k qobiq va uning tarkibiy qismlaridagi voqea-hodisalarni boshqa fanlar ham o‘rganadi, lekin aynan geografi ya bu obyekt va jarayonlarni o‘zaro bog‘liqlikda, ma’lum hudud chegaralarida bir butunligicha tadqiq etib, hududlar va butun Yer yuzi haqida yaxlit kompleks ilmiy tasavvurni shakllantiradi. Geografi ya fan sohasi sifatida tarkib topgandan buyon, ayniqsa, hozirgi davrda, uning uchun tabiat va jamiyat o‘rtasidagi o‘zaro aloqadorlik masalalari katta ahamiyat kasb etadi."
            },
            {
              "id": 2,
              "page": 6,
              "title": "2-§. GEOGRAFIYA FANINING TARIXI VA HOZIRGI DAVRDAGI RIVOJLANISHI",
              "desc": "Geografi ya eng qadimgi va hamisha navqiron fanlardan biri. Geografi k kashfi yotlar, g‘oya va bilimlarning rivojlanish xususiyatlariga asoslanib, bu fanning tarixida quyidagi bosqichlarni ajratish mumkin. Qadimgi yoki antik davr bosqichi. Ibtidoiy odamlarning o‘zi yasha b turgan joyni o‘rganish, yashash uchun qulay, tabiiy resurslarga boy joylarni topish va tasvirlashga bo‘lgan intilishlari asnosida dastlabki geografi k bilimlar to‘planib borgan. Er. avv. 2-ming yillikda fi nikiyaliklar O‘rta dengizdan Gibraltar bo‘g‘izi orqali suzib o‘tib, Afrika qirg‘oqlari bo‘ylab Hindistongacha suzib borganlar. Shu paytdan Osiyo va Yevropa nomlari paydo bo‘lgan. Bu davrda yunonlar va rimliklar o‘sha paytda ma’lum bo‘lgan hududlarni tasvirlab yozish bilan birga xaritalarini ham tuzdilar. Gomer er. avv. XII asrda O‘rta dengiz va uning atrofini tasvirlovchi dunyo xari tasini tuzdi. Pifagorning shogirdlari er. avv. VI asrda Yerning sharsimonligini aytdilar. Aristotel, er. avv. IV asrda, Yerning sharsimonligini, issiqlik mintaqalari mavjudligini mantiqiy 7 jihatdan isbotladi. Olamning markazida Yer turadi degan geotsentrik nazariyani ilgari surdi. Eratosfen er. avv. III asrda birinchi bo‘lib Yerning kattaligini o‘lchadi va “Geografi ka” nomli kitobini yozib, geografi - ya fanining mustaqil fan bo‘lib chiqishiga asos soldi. Eramizning II asrida Ptolemey 8 jildlik “Geografi ya” asarini yozdi va xaritalarni tuzishda kartografi ya proyeksiyalar va daraja to‘rini ixtiro qildi, dastlabki “Atlas”ni yaratdi. Shu davrda Strabon ham 17 jilddan iborat “Geografi - ya” asarini yozdi. Bu bosqichning asosiy natijalari: geografi ya fani vujudga keldi va “geografi ya” nomli kitoblar yozildi, dunyo xaritalari tuzildi, geografi k koordinatalar va daraja to‘ri ixtiro qilindi, Yerning sharsimonligi mantiqiy isbotlandi va o‘lchamlari aniqlandi. O‘rta asrlar bosqichi. Bu davrda geografi ya, umuman, ilm-fan, asosan Sharqda, xususan, O‘rta Osiyo, Misr, Eronda rivojlandi. Geografi y a fani, asosan o‘lkashunoslik, kartografi ya, geodeziya yo‘nalishida rivojlandi. Muhammad ibn Muso al-Xorazmiy IX asrda Yerning sharsimon ekanligini isbotlab, uning o‘lchamlarini nisbatan aniq o‘lchadi. “Surat-al-Arz” nomli kitob yozib, Sharq geografi yasiga asos soldi. Geografi ya fanining rivojida Abu Rayhon Beruniyning xizmati beqiyos. Uning geografi yaga oid 22 ta asari bo‘lib, shundan 12 tasi geodeziya, 4 tasi kartografi ya, 3 tasi iqlimshunoslik, 3 tasi mineralogiyaga oid va hozirgi kunda ham dolzarb hisoblanadi. U yasagan globus esa Yerning sharsimonligini isbotlash va tushuntirishda, Shimoliy yarimshar tabiatini o‘rganishda tengi yo‘q manba bo‘lgan. U yunon va rim olimlaridan farq qilib olamning geliotsentrik tuzilishi nazariyasini rivojlantirishga hissa qo‘shgan"
            },
            {
              "id": 3,
              "page": 12,
              "title": "3-§. YER YUZI TABIATI RIVOJLANISHINING FAZOVIY OMILLARI",
              "desc": "Yer boshqa osmon jismlari kabi koinotning bir qismidir. Koinot Yerni o‘rab turgan mavjud moddiy borliq. Koinot makonda cheksiz-chegarasiz va zamonda abadiydir. Koinotda osmon jismlari tuzilishi turli xil bo‘lgan tizimlarni hosil qiladi. Shulardan biri Quyosh sistemasidir. Quyosh atrofi dagi sayyoralar, yo‘ldoshlar, asteroidlar, kometalar bilan bir tizim bo‘lib galaktikamiz Somon yo‘li markazi atrofi da aylanma harakat qiladi. Somon yo‘li galaktikasi haqidagi ma’lumotlar astronomiya darsligidan Sizga ma’lum. Quyosh sistemasidan galaktika markazigacha bo‘lgan masofa 23–28 ming yorug‘lik yiliga teng. Quyosh galaktikaning chekkaroq qismida joylashgan. Bu holat Yer uchun juda qulay: u Galaktikaning nisbatan tinch qismida joylashgan va paydo bo‘lganidan buyon fazoviy halokatlarga uchramasdan rivojlanib kelmoqda. Quyosh sistemasi Galaktika markazi atrofi da 200–220 km/s tezlik bilan harakatlanib, 180–220 mln yilda bir marta aylanib chiqadi. Yerdagi 200 mln yil – tektonik siklning davomiyligi hisoblanadi. Bu Yer hayotida tektonik hodisalarning ma’lum ketma-ketligi bilan tavsifl anadigan muhim davr. Sikl boshida Yer po‘stining cho‘kishi, qalin cho‘kindi qatlamning to‘planishi, suv osti vulqonlarining otilishi ro‘y beradi. Keyin, tektonik jarayonlar kuchayadi, tog‘lar vujudga keladi, materiklarning tashqi ko‘rinishi, qiyofasi o‘zgaradi. Bu esa, o‘z navbatida, Yer tabiatining o‘zgarishiga olib keladi"
            },
            {
              "id": 4,
              "page": 17,
              "title": "4-§. YERNING ICHKI TUZILISHI VA TEKTONIK JARAYONLAR ",
              "desc": "Yerning ichki qismi qobiqlardan tuzilganligini quyi sinflardan bilasiz. Endi ana shu qobiqlarning o‘ziga xos xususiyatlari bilan tanishsiz. Yer po‘sti – Yerning eng yuzada joylashgan qattiq qobig‘i. Qalinligi o‘rtacha 35–40 km. Moddalarning o‘rtacha zichligi 2,7 g/sm3 , Yer hajmining 1 % ini, massasining 0,4 % ini tashkil etadi. Mantiyadan Moxo chegarasi orqali ajralib turadi. Yer po‘sti kimyoviy elementlar, minerallar, tog‘ jinslaridan iborat. Eng ko‘p tarqalgan kimyoviy elementlar kislorod, kremniy, aluminiydir. Siz 6-sinf darsligida yer po‘sti materik va okean yer po‘stiga bo‘linadi, deb o‘qigansiz. Endi esa, ularga qo‘shimcha holda oraliq va riftogen yer po‘stlari ham ajratilishini bilib olasiz. Sizga ma’lumki, materik yer po‘sti 3 ta, ya’ni cho‘kindi, granit va bazalt qatlamlaridan tuzilgan. Bunday qatlamlarni ajratish shartlidir. Cho‘kindi qatlam eng yuzada joylashgan bo‘lib, qalinligi 15–20 km gacha, ohaktosh, qum, gil va boshqalardan iborat. Granit va bazalt qatlamlar har birining qalinligi 10–15 kmni tashkil etadi. Okean yer po‘sti okean tubiga to‘g‘ri keladi. Qalinligi 5–10 km bo‘lib, cho‘kindili va bazaltli qatlamlardan tuzilgan. Oraliq yer po‘sti o‘rtacha qalinligi 15–30 km, 3 qismdan iborat: chekka dengiz soyligi, orollar yoyi va chuqur cho‘kmalar. Dengiz soyligi va chuqur cho‘kmalar ostida granit qatlami yo‘q, cho‘kindi va bazalt qatlamlardan iborat. Granit qatlam faqatgina orollar yoyida paydo bo‘ladi. Yevrosiyo materigining sharqiy qirg‘oqlarida, Shimoliy va Janubiy Amerikaning sharqiy va g‘arbiy qirg‘oqlarida mavjud. Riftogen yer po‘sti o‘rta okean tizmalariga to‘g‘ri keladi. Qalinligi 1,5–2 km bo‘lib, 2 qatlamli tuzilgan. Cho‘kindi qatlamning qalinligi 1–2 km, bazalt qatlam rift vodiylarida (yer yoriqlarida) asta-sekin nuraydi va unchalik qalin emas. Mantiya – yer po‘sti bilan yadro orasidagi qobiq. Moddalarning zichligi 5,7 g/sm3 , Yer hajmining 83 % ini, massasining 68 % ini tashkil etadi. Ikki qismdan iborat bo‘lib, yuqori mantiya 900 km, quyi mantiya esa 2900 km chuqurlikkacha davom etadi. Harorat 2000° C, yadro bilan chegarasida esa 3800° C ga yetadi."
            },
            {
              "id": 5,
              "page": 20,
              "title": "5-§. YER YUZI TABIATINING RIVOJLANISH TARIXI ",
              "desc": "Yerning paydo bo‘lishi haqidagi hozirgi zamon nazariyalariga ko‘ra, Yer murakkab taraqqiyot bosqichlarini o‘z boshidan kechirgan. So‘nggi yillardagi ma’lumotlarda keltirilishicha, Yer taraqqiyotining astronomik, geologik, biologik va antropogen bosqichlarini ajratish mumkin. Astronomik bosqich 5–4,6 mlrd yillar oralig‘ini o‘z ichiga oladi. Bundan 5 mlrd yil oldin koinotdagi disksimon gaz va chang massasining gravitatsion mexanik quyuqlashuvi oqibatida Quyosh sistemasidagi boshqa sayyoralar singari Yer ham sharsimon shaklga ega bo‘lgan. Yer tarkib topib borayotgan vaqtda radioaktiv elementlarning parchalanishi natijasida ajralib chiqadigan issiqlik hisobiga, uning ichki qismi asta-sekin qizib, moddalarning saralanishiga olib kelgan. Oqibatda Yerning turli qatlamlari hosil bo‘la boshlagan, vulqonlar harakatlanishi kuzatilgan. Vulqon va tektonik harakatlarning boshlanish paytidan Yerning geologik bosqichi boshlangan. Yer po‘sti yuzlab million yillar davomida doimiy ravishda o‘zgarib turgan, materiklar goh shakllanib, goh parchalangan. Materiklar doimiy harakatda bo‘lgan va ba’zida birlashib yirik materiklarni hosil qilgan. Yerda 3,8 mlrd yil avval hayot paydo bo‘lishi bilan Yer taraqqiyotining biologik bosqichi boshlangan. Yerda dastlabki odamlarning paydo bo‘lishi (3–1,5 mln yil) antropogen bosqichni boshlab bergan. Yerning geologik taraqqiyot tarixi, uning rivojlanish davrlari va rivojlanish bosqichlariga ajratish bilan ko‘plab geologlar shug‘ullanganlar. Natijada geoxronologiya paydo bo‘lgan. Geoxronologiya (geologik yilnoma) – yer po‘stidagi tog‘ jinslarining hosil bo‘lish ketma-ketligi va yoshi haqidagi ta’limot. Geoxronologiya mutlaq va nisbiy geoxronologiyaga bo‘linadi. Mutlaq geoxronologiyada Yerning yoshi yillar bilan ifodalanadi. Nisbiy geoxronologiyada esa, tog‘ jinslarining ketma-ket qatlamlanib joylanishiga asoslaniladi. Bunga ko‘ra, ustida yotgan qatlam (cho‘kindi jinslar qatlamlarining dastlabki holati buzilmaganda) ostidagidan yosh bo‘ladi."
            },
            {
              "id": 6,
              "page": 24,
              "title": "6-§. GEOGRAFIK QOBIQ VA UNING UMUMIY QONUNIYATLARI",
              "desc": "Aziz o‘quvchilar, Siz quyi sinfl arda geografi k qobiq, uning chegaralari va xususiyatlari, umumiy qonuniyatlari haqida bilib olgansiz. Bu mavzuda o‘sha bilimlaringizni yanada chuqurlashtirasiz. Yerning ichki va tashqi (koinot) omillari va jarayonlari yer po‘stining yuza qismida to‘qnashib va o‘zaro ta’sirlashib sayyoramizning boshqa 25 hech bir qismida uchramaydigan o‘ziga xos tabiiy tizim – geografi k qobiqni vujudga keltirgan. Geografi k qobiqning mohiyati shundaki, faqat undagina suv uch xil holatda uchraydi, hayvonlar va o‘simliklar yashaydi, tuproq qoplami hosil bo‘ladi, turli tog‘ jinslari va relyef shakllari vujudga keladi, quyosh energiyasi to‘planadi va xususiyatlarini o‘zgartiradi. Eng asosiysi, hayot mavjud, kishilik jamiyati faqat shu qobiqda paydo bo‘lib yashamoqda va rivojlanmoqda. Geografi k qobiq juda murakkab tuzilgan bo‘lib, unda 3 tarkibiy tuzilish darajalari ajratiladi: geokomponentli, geosferali, geotizimli. Geokomponentli eng sodda tuzilish darajasi. Geokomponentlar yer yuzidagi bir xil holatdagi (qattiq, suyuq, gazsimon) moddalardir. Bular tog‘ jinslari, tuproq, suv, havo, o‘simlik va hayvonlar. Geosferali tuzilish bitta geokomponentdan tashkil topgan geosferalardan iborat. Geosferalar geografi k qobiqning vertikal tuzilishini belgilaydi, ular solishtirma og‘irligi bo‘yicha vertikal tabaqalanib joylashgan: litosfera, gidrosfera, atmosfera va biosfera. Litosfera, gidrosfera va atmosfera deyarli bir xil moddalardan tarkib topgan va uzluksiz, yaxlit qobiqni hosil qiladi. Biosfera esa tirik moddalar tarqalgan qobiq bo‘lib, yaxlit qobiq hosil qilmaydi. U boshqa qobiqlar tarkibiga kiradi va yuqorida aytilgan qobiqlarning tutashgan joyida yupqa qatlamni hosil qiladi. Geotizimli tuzilish geografi k qobiqning gorizontal tuzilishini ifodalaydi. Geotizimlar barcha komponentlarni qamrab olib, ularning o‘zaro ta’sir va aloqalaridan hosil bo‘lgan murakkab tizimlardir. Bu haqda 9-mavzuda to‘liqroq ma’lumot beriladi. "
            },
            {
              "id": 7,
              "page": 33,
              "title": "8-§. BALANDLIK MINTAQALANISHI QONUNIYATI",
              "desc": "Sizga ma’lumki, o‘lkamizdagi baland tog‘larning tepalaridagi qorlar jazirama yoz oylarida ham erimaydi. O‘quvchilar dam olish uchun tog‘ yonbag‘irlaridagi so‘lim oromgohlarga boradilar. Xo‘sh, bularga sabab nima? Buning sababi tekislikdan tog‘larga tomon balandlik ortib borgani sari tabiiy sharoitning o‘zgarib borishidir. Ya’ni tog‘ yonbag‘irlarida yuqoriga ko‘tarilgan sayin havo haroratining pasayib borishi, namlikning ortib borishi, shunga bog‘liq holda o‘simliklarning turli-tuman bo‘lishi, tabiiy sharoitning so‘lim va xushmanzara, musaffo bo‘lib borishidir. Tabiiy sharoitning bunday o‘zgarib borishiga balandlik mintaqalanishi qonuniyati sabab bo‘ladi. Balandlik mintaqalanishi – tog‘larning etagidan suvayirg‘ich tomon tabiatning qonuniy o‘zgarib borishi. Balandlik mintaqalari tekisliklardagi tabiat zonalariga o‘xshash, lekin aynan o‘zi emas. Ularning shakllanishiga yuqoriga ko‘tarilgan sari havo harorati va bosimining pasayishi, quyosh radiatsiyasining kuchayishi, suv bug‘lari kondensatsiyasi sharoitining o‘zgarishi sabab bo‘ladi. Yog‘inlar ma’lum balandlikkacha ko‘payib, so‘ng kamayadi. Shunga bog‘liq holda tuproqlar, o‘simlik va hayvonot olami, umuman, geotizimlar o‘zgarib boradi. Balandlikka ko‘tarilgan sari o‘simliklarning, tabiiy sharoitning o‘zgarib borishi haqidagi ma’lumotlar Zahiriddin Muhammad Boburning “Boburnoma” asarida Movarounnahr, Afg‘oniston tog‘larining ta’rifi da kelti riladi. Lekin balandlik mintaqalanishi qonuniyatini ilk bor A. Gumboldt Alp va And tog‘larida o‘rganib, ilmiy asoslab bergan. Tekislikdagi tabiat zonalari ekvatordan qutblarga tomon birin-ketin almashinib borgani kabi balandlik mintaqalari ham tog‘larning etagidan suvayirg‘ich tomon almashinib boradi. Biroq tog‘larda balandlik mintaqalari ularga nisbatan tezroq aemashinadi, ayrim balandlik mintaqalarining o‘xshashi bo‘lgan tabiat zonalari tekisliklarda mavjud emas. Masalan, tog‘larda subalp va alp o‘tloqlari mintaqasi mavjud, tekisliklarda esa bunday tabiat zonasi yo‘q"
            },
            {
              "id": 8,
              "page": 36,
              "title": "9-§. GEOTIZIMLAR VA ULARNING POG‘ONASIMONLIGI",
              "desc": "Quyi sinfl arda Siz tabiat kompleksi, tabiiy hududiy kompleks, geografi k kompleks degan tushunchalar bilan tanishdingiz, ularning barchasi tabiiy geografi k kompleks atamasining sinonimi ekanligini bilib o ldingiz. Ushbu tushunchalar ancha umumiy va soddaroq bo‘lib, Sizning yoshingiz va fi krlash doirangizni inobatga olib yozilgan. Endi esa, ularga nisbatan murakkabroq bo‘lgan geotizim tushunchasi bilan tanishasiz. Har bir fan rivojlanib, takomilla shib borgani sari uning tadqiqot obyekti, predmeti va vazifalari haqidagi tushunchalar ham aniqlashib, muayyanlashib boradi. O‘tgan asrning o‘rtalariga kelib, barcha fanlarda bo‘lgani kabi geografi ya faniga ham tizimlar haqidagi ta’limot kirib keldi. Natijada geografi k tadqiqotlarda tekshirish obyektini, o‘sha vaqtlarda bo‘lganidek, kompleks deb emas, tizim deb qarash yuzaga keldi. Shu munosabat bilan 1963-yilda akademik V. B. Sochava tomonidan geotizim tushunchasi fanga kiritildi va ta’limoti yaratildi. Bu tushuncha geografi yaning obyektini aniqroq va mukammalroq ta’rifl ashi barcha tomonidan e’tirof etildi. Hozirgi paytda geografi k tadqiqotlarda tizimlar haqidagi ta’limotga amal qilinadi va o‘rganish obyekti tizim deb qaraladi. Akademik V. B. Sochava quyidagicha ta’rif beradi: Geotizim – boshqariluvchan tizimlarning alohida, o‘ziga xos sinfi ; Yer yuzasidagi komponentlari bir-biri bilan tizimli aloqada bo‘lgan hamda ma’lum yaxlitlik sifatida fazo qobig‘i va kishilik jamiyati bilan o‘zaro ta’sirda bo‘ladigan barcha o‘lchamdagi makon. Yaxlit bo‘lish bilan birga, kichik tizimlarga bo‘linadigan bu tizimlar sayyoraning yuzasini to‘liq qamrab oladi, shu bilan bir qatorda uning bir bo‘lagi sifatida uncha katta bo‘lmagan makonda mustaqil mavjud bo‘ladi va maxsus faoliyatni bajaradi. Mazkur ta’rifga ko‘ra, geotizimni o‘zaro bog‘liq komponentlar ning to‘g‘ri va teskari aloqalar orqali birlashgan hamda bir-biri bilan o‘zaro ta’sirda bo‘ladigan tabiat va jamiyat kichik tizimlaridan iborat, moddiy-energetik bir butun yaxlit holdagi hududiy tizim deb qarasak bo‘ladi."
            },
            {
              "id": 9,
              "page": 36,
              "title": "10-§. JAMIYAT VA TABIAT O‘RTASIDAGI MUNOSABATLAR",
              "desc": "Tabiat – bizni o‘rab olgan borliq, olam. Tabiat vaqt va fazoda cheksizdir, to‘xtovsiz ravishda harakatda, rivojlanishda va o‘zgarishda bo‘ladi. Jamiyat ham tabiatning, moddiy olamning o‘ziga xos bir bo‘lagidir. 41 Tabiiy muhit – tabiiy jism va moddalarning, nimanidir yoki kimnidir o‘rab turuvchi, uning hayotiy faoliyati kechadigan tabiiy sharoit yoki tabiiy sharoitlar mujassamligi. Geografi k adabiyotlarda mazkur tushuncha, ko‘pincha, geografi k qobiqning inson va uning xo‘jalik faoliyatini o‘rab turgan qismiga nisbatan ishlatiladi. Geografi k muhit – jamiyatni o‘rab turgan tabiiy sharoit; ijtimoiy ishlab chiqarishning muayyan tarixiy bosqichida tabiatning jamiyat bilan o‘zaro ta’sirda bo‘ladigan bir qismi. Geografi k muhit jamiyat taraqqiyotining doimiy va zaruriy sharoitlaridan biri, u mehnat taqsimotiga va xo‘jalik tarmoqlarining joylashishiga faol ta’sir etadi. O‘z navbatida, jamiyat ham geografi k muhitga ta’sir ko‘rsatadi. Jamiyat rivojlanib borgani sari geografi k muhit doirasi o‘zgarib, kengayib boradi. Texnogen muhit – aholini o‘rab turgan atrof-muhitning bir qismi bo‘lib, inson tomonidan yaratilgan obyektlar, jism va moddalar tushuniladi. Jamiyat rivojlanib borgan sari texnogen muhit takomillashib boradi. Atrof-muhit – aholini o‘rab turgan tabiiy va texnogen muhitni qamrab olgan yashash va mehnat qilish sharoiti."
            }
          ]
        },
        {
          "classId": 4,
          "classLevel": 12,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "Aziz o‘quvchilar! Siz 6- sinfda «Materiklar va okeanlar tabiiy geografiyasi» bilan tanishganingizda Yer yuzining rang-barangligini, har bir materik, okean tabiati betakror ekanini, har bir qit’aning o‘rganilish tarixini bilib oldingiz, geografik komplekslarni o‘rgandingiz. Tabiat bilan inson o‘rtasidagi o‘zaro aloqa va ta’sirlar, insonning tabiatdan foydalanish masalalari, tabiatni muhofaza qilish muammolari bilan tanishdingiz. 7- sinfda Siz mamlakatimiz — O‘zbekiston Respublikasi joylashgan tabiiy geografik o‘lka — O‘rta Osiyo tabiiy geografiyasi bilan Vatanimiz tabiiy geografiyasini o‘rganasiz. O‘rta Osiyoning geografik o‘rni, o‘ziga xos xususiyatlari, geologik tuzilishi, relyefi, foydali qazilmalari, iqlimi, suvlari, tuproqlari, o‘simliklari, hayvonot dunyosi, tabiatdan, uning boyliklaridan oqilona foydalanish masalalari bilan tanishasiz. Shu bilan birga, geografiyani o‘rganishda xaritalardan foydalanishni, xaritalarning qanday ishlanishini, turlarini, topografik xaritalar, ulardan qanday foydalanishni bilib olasiz. Yana vaqt hisobi, soat mintaqalari, iqlim hosil qiluvchi omillar, tuproqlar haqida umumiy tushunchalarga ega bo‘lasiz. O‘rta Osiyo tabiiy geografiyasini o‘rganib bo‘lganingizdan keyin o‘quv yilining ikkinchi yarmidan boshlab, jonajon Vatanimiz — O‘zbekistonning tabiiy geografiyasini chuqur o‘rganishga kirishasiz. Bunda Siz Vatanimizning dunyo geografik xaritasida tutgan o‘rni, ma’muriy bo‘linishi, geologik tuzilishi, relyefi, foydali qazilmalari, iqlim xususiyatlari, ichki suvlari, tuproqlari, o‘simliklari, hayvonot olamini bilib olasiz."
            },
            {
              "id": 2,
              "page": 4,
              "title": "O‘RTA OSIYO TABIIY GEOGRAFIK O‘LKASI HAQIDA TUSHUNCHA ",
              "desc": "O‘rta Osiyo tabiiy o‘lkasi o‘zining tabiiy sharoiti, tabiiy geografik xususiyatlariga ega bo‘lgan, boshqa o‘lkalardan tabiiy chegaralari bilan ajralib turadigan yirik tabiiy geografik kompleksdir. Bolalar, Siz Yevrosiyoning tabiiy xaritasidan O‘rta Osiyo joylashgan yerlarni e’tibor berib ko‘rib chiqing. Shunda O‘rta Osiyo yer yuzasining tuzilishiga ko‘ra uch qismga bo‘linganini ko‘rasiz. O‘lkaning g‘arbiy qismi cho‘llar egallagan keng pasttekisliklar, shimoliy qismi cho‘l, chalacho‘l va dashtlardan iborat qir va tekisliklar ekanini, sharqiy va janubiy qismlarida osmono‘par baland tog‘lar ko‘tarilib turganini ko‘rasiz. (Qanday pasttekislik, past tog‘lar, qirlar, tog‘lar borligini xaritadan aniqlang.)O‘rta Osiyoda butun dunyoga dong‘i ketgan tarixiy me’morchilik yodgorliklari, muzey-shaharlar mavjud. Buxoro, Samarqand, Xiva dunyoga mashhur shaharlardir. O‘rta Osiyo o‘lkasidan jahon fani rivojiga ulkan hissa qo‘shgan Ahmad alFarg‘oniy, Abu Nasr Forobiy, Abu Rayhon Beruniy, Abu Abdulloh Muhammad ibn Muso al-Xorazmiy, Abu Ali ibn Sino kabi olimlar, Jaloliddin Manguberdi, Amir Òemur, Zahiriddin Muhammad Bobur, Muhammad Shayboniyxon kabi sarkardalar, Abdurahmon Jomiy, Alisher Navoiy, Abu Abdulloh Rudakiy, Ahmad Yassaviy, Boborahim Mashrab kabi buyuk shoirlar, Imom al-Buxoriy, Hakim at-Òermiziy, Bahouddin Naqshband kabi hadisshunos mutafakkirlar yetishib chiqqan."
            },
            {
              "id": 3,
              "page": 6,
              "title": "O‘RTA OSIYO TABIIY O‘LKASINING GEOGRAFIK O‘RNI, CHEGARALARI VA O‘ZIGA XOS XUSUSIYATLARI",
              "desc": "O‘rta Osiyo Yevrosiyo materigining o‘rtasida joylashgan. O‘lkaning eng shimoliy nuqtasi 53,8° shimoliy kenglikda, Ayirtov yaqinida, eng janubiy nuqtasi Hindukush tog‘larining g‘arbiy tarmog‘i bo‘lgan Safedko‘h tog‘ tizmasi bilan Nishopur tog‘- 2- §. 7 lari tutashgan joyda (34° shimoliy kenglik), g‘arbiy nuqtasi Kaspiy dengizining Mang‘ishloq yarimorolidagi Òubqarag‘ay burnida (50,3° sharqiy uzunlik) va sharqiy nuqtasi Savir tog‘- larining etagidagi Qora Irtish daryosi vodiysida (85,6° sharqiy uzunlik) joylashgan. Shimoldan janubga 2200 km va g‘arbdan sharqqa 2750 km ga yaqin masofaga cho‘zilgan. O‘rta Osiyo o‘lkasining geografik kengligi Janubiy Yevropa o‘lkasi, Afrikadagi Atlas tog‘lari geografik kengligiga to‘g‘ri keladi. U yerlardagi mamlakatlar iliq mo‘tadil va subtropik tabiatli mamlakatlardir. O‘rta Osiyo yirik materikning o‘rtasida, dengiz va okeanlardan uzoqda joylashganligi sababli juda qurg‘oqchil o‘lkadir. O‘lkaning chegarasi juda murakkab. Janub va sharq tomonlarida chegara tog‘larning suvayirg‘ichidan o‘tkaziladi. Chunki bu tog‘lar iqlimiy va gidrografik chegaralar hisoblanadi. Lekin shimoli-g‘arbiy, shimoliy va shimoli-sharqiy chegaralarni aniqlash ancha murakkab. Bu yerda iqlimiy chegaralar yo‘q desa ham bo‘ladi. Shuning uchun bu yerda tektonik chegaralar asos qilib olinadi. Shunday qilib, O‘rta Osiyo o‘lkasi chegaralarini quyidagicha belgilash mumkin. G‘arb tomonda Kaspiy dengizi qirg‘oqlari chegara bo‘ladi. Shimoli-g‘arbiy chegara Emba daryosining quyar joyidan janubroqdan boshlanib, Ustyurt platosi shimoliy chinklari bo‘ylab o‘tadi va Mug‘ojar tog‘larining janubiy etaklarigacha boradi."
            },
            {
              "id": 3,
              "page": 9,
              "title": "O‘RTA OSIYONING GEOGRAFIK O‘RGANILISH TARIXI",
              "desc": "O‘rta Osiyo tabiatini o‘rganish juda qadim davrlardan boshlangan. Chunki O‘rta Osiyo G‘arb va Sharq davlatlari o‘rtasidagi muhim xalqaro savdo yo‘lida joylashgan. O‘rta Osiyo haqidagi dastlabki ma’lumotlarni Gerodot, Strabon, Arrian, Ptolemey va boshqalarning asarlarida uchratish mumkin. O‘rta Osiyo tabiatini o‘rganish tarixi bir necha bosqichdan iborat. Birinchi bosqich — «Buyuk iðak yo‘li» mavjud bo‘lgan davr. Ipak yo‘li miloddan avvalgi II asrdan milodning XVI asrigacha asosiy savdo yo‘li hisoblangan. Bu davrda O‘rta Osiyo tabiati xitoy, arab va mahalliy olimlar tomonidan o‘rganildi. Xitoy sayyohi Chjan-Syan 13 yil davomida (miloddan avvalgi 138—126- yillar) Issiqko‘l atrofi, Farg‘ona va Xorazm tabiatini, aholisi va xo‘jaligini o‘rgandi. Milodning VII asrida Syuan-Szan 16 yil davomida (629—645- yillar) Òyanshan, Yettisuv, Chu vodiysi, Òoshkent, Samarqand va Pomir tabiatini o‘rganib, muhim geografik asar yozib qoldirgan. O‘rta asrlarda O‘rta Osiyo tabiati arab olimlari tomonidan o‘rganilgan. Arab sayyohlari va olimlari tomonidan O‘rta Osiyo tabiati va uning tabiiy geografik o‘lkalari haqida juda ko‘p geografik ma’lumotlar yozib qoldirilgan. Abul Hasan Ali Ma’sudiy (X asr) O‘rta Osiyo va Kavkaz geografiyasi haqida asar yozgan, Abu Is’hoq Istaxriy (X asr) «Iqlimlar kitobi», Yoqut ibn Abdulla (XII—XIII asrlar) «Mamlakatlarning alifbo tartibida ro‘yxati» nomli asar yozgan. O‘rta Osiyo tabiatini o‘rganishga shu yerlik olimlar ham juda katta hissa qo‘shgan. Muhammad ibn Muso al-Xorazmiy (IX asr) O‘rta Osiyo geografiyasiga asos solgan, uning «Yer tasviri» nomli asari o‘z zamonasida eng mukammal geografik asar bo‘lgan. Bu asar 1878- yilda rus tiliga tarjima qilingan. O‘rta Osiyo tabiati, geologik tuzilishi, foydali qazilmalari, xo‘jaligi, tarixi haqida buyuk olim Abu Rayhon Beruniy (X—XI asrlar) juda qimmatli ma’lumotlar yozib qoldirgan. 3- §. 10 Uning dunyo xaritasida O‘rta Osiyodagi ko‘p joylar va ularning nomlari berilgan. Mahmud Koshg‘ariy (XI asr) ham O‘rta Osiyoni, uning tabiatini o‘rgangan bo‘lib, o‘zining mashhur «Devon-u lug‘otit turk» asarida ko‘p joy nomlari va geografik atamalar haqida yozib qoldirgan. Zahiriddin Muhammad Bobur (XV—XVI asrlar) «Boburnoma» asarida O‘rta Osiyo tabiati, ayniqsa, Farg‘ona vodiysidagi joylar haqida muhim ma’lumotlar keltirgan."
            },
            {
              "id": 4,
              "page": 11,
              "title": "O‘RTA OSIYO AHOLISI VA SIYOSIY XARITASI",
              "desc": "1. Aholisi. O‘rta Osiyoning tub aholisiga o‘zbeklar, tojiklar, qozoqlar, qirg‘izlar, turkmanlar, qoraqalpoqlar, afg‘onlar, forslar kiradi. O‘rta Osiyo xalqlari jahon fani va madaniyatiga, davlatchilik ilmiga katta hissa qo‘shgan buyuk allomalari, sarkardalari bilan faxrlanadi. (Shunday buyuk insonlardan kimlarni bilasiz?) O‘rta Osiyoda tub millatlardan tashqari turli vaqtlarda ko‘- chib kelib, o‘troq yashab qolgan ruslar, tatarlar, yahudiylar, ukrainlar, boshqirdlar, koreyslar, uyg‘urlar, turklar va boshqa millatlar ham mavjud. Hozirgi paytda O‘rta Osiyo aholisi 75 mln kishidan ortiq. O‘rta Osiyo cho‘l va chalacho‘l zonalarida joylashganligidan aholi azaldan vodiylarda, suv manbalari — daryo bo‘ylarida, vohalarda bir-biriga moslashib, yelkadosh bo‘lib yashashga o‘rgangan. O‘rta Osiyo tabiati, hayotning o‘zi bu yerdagi xalqlarni shu ruhda tarbiyalagan. O‘rtaosiyolik ulug‘ alloma-mutafakkirlar — Abdullo Rudakiy, Alisher Navoiy, Maxtumquli, Abay, To‘xtag‘ul xalqlarni mehr-oqibatli, do‘st, birodar bo‘lib yashashga da’vat qilishgan. Bunday da’vat hozirgi vaqtda yanada muhim ahamiyat kasb etadi. 2. Siyosiy xaritasi. Siyosiy xarita deb jahondagi yoki uning qaysidir qismidagi davlatlarning ma’lum bir tarixiy davrdagi holati aks etgan xaritaga aytiladi. Siyosiy xaritalar inqiloblar, urushlar va davlatlarning o‘zaro kelishuvlari asosida o‘zgarib, qayta tarkib topib turadi."
            },
            {
              "id": 5,
              "page": 15,
              "title": "GEOGRAFIK XARITALAR VA ULARNING SHARTLI BELGILARI",
              "desc": "Geografik xaritalarda turli-tuman voqea va hodisalar tasvirlangani uchun ular juda xilma-xil bo‘ladi. Xaritalarni turlarga bo‘lishdan oldin ular to‘g‘risidagi umumiy tushunchalarni ko‘rib chiqamiz. Geografik xaritalarni yaxshi tushunish, ular bilan ishlashni bilish uchun joy plani, xarita, aerosurat, kosmosurat tushunchalari mazmunini yaxshi bilib olish kerak. Joy plani — joyning yirik masshtabda (1:5000 va undan yirikroq) tuzilgan chizmasidir. Planda maydoni uncha katta bo‘lmagan kichik-kichik joylar tasvirlanadi (3- rasm). Xarita — Yerning va boshqa sayyoralar yuzasining kichraytirilib va umumlashtirilib, shartli belgilar bilan tekis yuzaga tushirilgan tasviri. Xaritalarda tabiiy va iqtisodiy-ijtimoiy voqea va hodisalar tasvirlanadi (4- rasm). Aerosurat — Yer yuzasi bir qismining samolyot va boshqa uchuvchi asboblar yordamida olingan tasviri. Kosmosurat — Yerning va boshqa sayyoralarning kosmik kemalar yordamida olingan tasviri. Ular fan va xalq xo‘jaligining turli sohalarida keng qo‘llaniladi (5- rasm). Har bir plan, xarita, aerosurat, kosmosurat ma’lum bir masshtabga ega bo‘ladi (masshtabning nima ekanligini 5- sinf geografiyasidan eslang). Xaritalarning shartli belgilari. Voqea va hodisalar hamma xaritalarda ham ma’lum shartli belgilar bilan tasvirlanadi. Shartli belgilar xaritalarni boshqa geografik ma’lumot manbalaridan, ya’ni aerosurat, kosmosurat, jadval va hokazolardan ajratib turadigan muhim xususiyatlardan biridir. Shartli belgilarga qarab, voqea va hodisalarning joylanishini, miqdorini, sifatini bilib olish mumkin. Shartli belgilar bir necha turga bo‘linadi. Masshtabli shartli belgilar yordamida voqea va hodisalarning haqiqiy o‘lchamlari aks ettiriladi. Ular yordamida qum cho‘llari egallagan maydonni, muz qoplagan yerlar maydonini bilish mumkin. Masshtabsiz shartli belgilar bilan xaritalarning masshtabida ko‘rsatib bo‘lmaydigan voqea va hodisalar tasvirlanadi. Masalan, turli xil shakllar, chizmalar, harfli belgilar, aholi yashaydigan joylar, GESlar, foydali qazilma konlari belgilari  3- rasm. Joy plani. 4- rasm. Mirzacho‘l va Toshkent vohalarining xaritada tasvirlanishi. 17 masshtabsiz bo‘ladi."
            },
            {
              "id": 6,
              "page": 18,
              "title": "XARITALARNING TURLARI VA ULARDAN FOYDALANISH",
              "desc": "Xaritalarning turlari. Xaritalar masshtabiga, ularda tasvirlangan hududning katta-kichikligiga, mazmuni, vazifasi va tuzilishiga ko‘ra bir qancha turlarga bo‘linadi. Xaritalar masshtabiga qarab quyidagi turlarga bo‘linadi: yirik masshtabli — 1:10000 dan 1:200000 gacha, o‘rta masshtabli —1:200000 dan 1:1000000 gacha, mayda masshtabli — 1:1000000 dan kichik. Òurli masshtabli xaritalarda voqea va hodisalar turli xil aniqlikda tasvirlanadi. Xaritalar ularda nima tasvirlanganligi va hududning kattakichikligiga qarab quyidagi turlarga bo‘linadi: yulduzlar xaritasi, sayyoralar va Yer xaritasi, yarimsharlar xaritasi, materiklar va okeanlar xaritalari, tabiiy geografik o‘lkalar va dengizlar xaritasi, mamlakatlar xaritasi, ma’muriy birliklar xaritasi, maxsus hudud (qo‘riqxona, sayohatbop joy)lar xaritasi, shahar, viloyat va tumanlar xaritasi. Mazmuniga ko‘ra xaritalar ikkita yirik guruhga bo‘linadi: umumiy geografik xaritalar va mavzuli xaritalar. Umumiy geografik xaritalarda joy geografik sharoitining asosiy tarkibiy qismlari bir xil aniqlikda tasvirlanadi: relyef, daryo, ko‘l, muzliklar, tuproq va o‘simlik qoplami, aholi yashaydigan joylar, xo‘jalik tarmoqlarining tarkibi, aloqa yo‘llari, chegaralar va h. k. Mavzuli xaritalar, o‘z navbatida, yana ikki guruhga — tabiiy va iqtisodiy xaritalarga bo‘linadi. Òabiiy geografik xaritalarga Yer yuzasi va okean tagi relyefi, iqlim, tuproq, o‘simlik, hayvonlar, landshaft, tabiatni qo‘riqlash, foydali qazilma konlari xaritasi kiradi. Ijtimoiy-iqtisodiy xaritalar iqtisodiy, tarixiy, madaniy-siyosiy, siyosiy-ma’muriy xaritalardan iborat. Vazifasiga ko‘ra xaritalar yana ilmiy, madaniyat va targ‘ibot, texnik, sayohat hamda o‘quv xaritalariga bo‘linadi."
            },
            {
              "id": 7,
              "page": 20,
              "title": "TOPOGRAFIK XARITALAR ",
              "desc": "Òopografik xaritalar haqida tushuncha. Odatda, geografik xaritalarning masshtabi juda kichik bo‘ladi, ularda Yer yuzasi tasviri million marta va undan ko‘proq marta kichraytirib ko‘rsatiladi. Yer yuzasining kichik qismini tasvirlovchi yirik masshtabli (1:200 000 va undan kattaroq) xaritalar topografik xaritalar deb ataladi. Mazmuniga ko‘ra, ular umumiy geografik xaritalar hisoblanadi. Yirik masshtabli (1:25 000, 1:50 000, 1:100 000) topografik xaritalar joyda bajariladigan topografik o‘lchov ishlari hamda aerosuratlar asosida tuziladi. Yirik masshtabli topografik xaritalarda katta maydonlar tasvirlanadigan bo‘lsa, xarita juda kattalashib ketadi. Shuning uchun bunday xaritalar ayrim-ayrim varaqlarga bo‘linadi va ular ko‘p varaqli bo‘ladi. Yirik masshtabli topografik xaritalarning har bir varag‘ida Yer yuzasining kichik qismi tasvirlanadi. Shuning uchun bunday xaritalarda mayda masshtabli xaritalarga nisbatan xatoliklar juda kam bo‘ladi, chunki kichik maydon yuzasi tekislikka yaqin bo‘ladi. Xaritaning masshtabi uning barcha qismida bir xil bo‘ladi. Òopografik xaritaning har bir varag‘i yon tomonlarda meridian, yuqori va past tomonlarda parallellar bilan chegaralanadi. Masalan, masshtabi 1:1000 000 bo‘lgan xaritaning har bir varag‘i har 6° dan o‘tkazilgan meridianlar va har 4° dan o‘tkazilgan parallellar bilan chegaralangan. Natijada, Yer yuzasida uzunligi 6° va kengligi 4° ga teng bo‘lgan trapetsiyalar (trapetsiya shaklidagi hududlar) hosil bo‘ladi."
            },
            {
              "id": 8,
              "page": 24,
              "title": "TOPOGRAFIK XARITALARDAN FOYDALANISH",
              "desc": "Òopografik xaritalar bilan ishlash. Òopografik xaritalarda berilgan joyning koordinatalarini aniqlash juda oson. Xaritaning pastki va yuqorigi ramkalari yoniga geografik uzunlik (y) ham 9- §. 8- rasm. Balandliklar shkalasiga qarab yonbag‘irlar tikligini aniqlash. 25 darajalarda, ham kilometrlarda yozib qo‘yiladi. Yon ramkalari yoniga esa geografik kenglik (x) xuddi shunday yozib qo‘yiladi. Aniqlanishi lozim bo‘lgan nuqta kataklar ichida bo‘lsa, u millimetrlarga bo‘lingan chizg‘ich yordamida aniqlanib, ramka yonida yozilgan raqamlarga qo‘shiladi (6- rasm). Rasmda ko‘rsatilgan xaritadagi M nuqtaning geografik koordinatasini kilometrlarda aniqlash kerak bo‘lsin. Buning uchun masshtab yordamida katakning janubiy va g‘arbiy yonlaridan M nuqtagacha bo‘lgan masofa necha metr ekanligi topiladi. Hosil bo‘lgan raqam tegishli kilometrli chiziqlarning ramka chekkasida ko‘rsatilgan raqamlarga qo‘shiladi. Bunda M nuqtaning koordinatalari x = 65750, y = 13500 qiymatga ega bo‘ladi. Bu M nuqtaning 65 — 13- katakda joylashganini va katakning 65- raqamli gorizontal yonidan 750 m masofada, 13- raqamli vertikal yonidan 500 m masofada ekanini bildiradi. Òopografik xaritalarda yonbag‘irlarning qiyaligi xaritaning pastki ramkasi ostida berilgan balandliklar shkalasi yordamida aniqlanadi (8- rasm). Shu shkala tagida yozib qo‘yilgan raqamlar yonbag‘irlarning necha daraja qiya ekanini bildiradi. Vertikal chiziqlar bo‘ylab qo‘shni gorizontallar orasidagi masofa xarita masshtabiga muvofiq yozib qo‘yilgan. Yonbag‘irning qiyaligi necha daraja ekanligi xaritadagi ikki qo‘shni gorizontal oralig‘ini sirkul bilan o‘lchab, so‘ngra balandliklar shkalasiga qo‘yish bilan aniqlanadi."
            },
            {
              "id": 9,
              "page": 5,
              "title": "VAQT O‘LCHOVI. SOAT MINTAQALARI. ÒAQVIMLAR",
              "desc": "Vaqt o‘lchovi. Vaqt o‘lchovi Yerning o‘z o‘qi va Quyosh atrofida aylanishini kuzatishga asoslangan. Shuning uchun yulduz vaqti, Quyosh vaqti va boshqa vaqtlar ajratiladi. Yulduz vaqtining asosiy birligi yulduz sutkasi hisoblanadi. U, asosan, Yerning o‘z o‘qi atrofida bahorgi tengkunlik nuqtasiga nisbatan aylanish vaqtiga teng. Yulduz vaqtidan foydalanish noqulay, chunki u kun bilan tunning almashinishiga to‘g‘ri kelmaydi. Shuning uchun amalda Quyosh vaqtidan foydalaniladi. Quyosh vaqti Yerning Quyoshga nisbatan harakatiga qarab aniqlanadi. Quyosh vaqti, odatda, yarim tundan boshlab hisoblanadi, bu vaqt o‘rtacha Quyosh vaqti deb ataladi. Òurli meri10- §. 27 dianlarda yarim tun turli paytlarda bo‘ladi, shu sababli turli meridianlarda joylashgan joylarda vaqt bir-biridan farq qiladi. Shuning uchun vaqt o‘lchovidan xalqaro miqyosda foydalanishni osonlashtirish maqsadida mahalliy vaqt, mintaqa vaqti va dunyo vaqti tushunchalari kiritilgan. Vaqt maxsus davlat tashkilotida, vaqt xizmati tomonidan aniq o‘lchab turiladi. Vaqt eng sezgir astronomik asboblar yordamida osmon yoritgichlari (yulduzlar va Quyosh)ga qarab tekshirib turiladi.Mahalliy vaqt. Yer o‘z o‘qi atrofida g‘arbdan sharqqa qarab bir kecha-kunduzda bir marta aylanib chiqadi. Globusda bosh meridiandan boshlab har 15° dan meridianlar o‘tkazilsa, har bir meridian qo‘shni meridiandan bir soat farq qiladi. Bosh meridianda tush payti bo‘lganda, 180° meridianda yarim kecha, bosh meridiandan sharqdagi 90° uzunlikda kechqurun, g‘arbdagi 90° uzunlikda ertalab bo‘ladi. Shimoliy qutbdan Janubiy qutbgacha bitta meridianda joylashgan nuqtalarda vaqt bir xil bo‘ladi, ya’ni bitta meridianning hamma joyida vaqt bir xildir"
            }
          ]
        }
      ]
    },
    {
      "bookId": 3,
      "bookName": "Adabiyot",
      "status": "tavsiya",
      "bookImage": "assets/svg_icon/img.png",
      "classes": [
        {
          "classId": 1,
          "classLevel": 8,
          "mundarija": [
            {
              "id": 1,
              "page": 4,
              "title": "Kirish",
              "desc": "Hayotning rang-barang hodisalarga to‘la ekanini ozmi-ko‘pmi anglab boryapsiz. Har bir odamning u yoki bu hodisaga bergan bahosi bir-biridan anchagina farq qilishini ham ko‘rib-bilib turibsiz. Insoniyat bosib o‘tgan tarixiy yo‘l shu qadar chigal, murakkab hodisalarga boyki, uni dabdurustdan baholashning hech iloji yo‘q. Shu tufayli ham o‘tmish hayot to‘g‘risida har bir ilm sohasi o‘z imkoniyatlaridan kelib chiqib xulosalar yasaydi. Bu rang-baranglik san’at sohalariga ham birdek tegishlidir. Deylik, ushbu mavzuni o‘rganayotganingizda sinf derazalaridan Sizni o‘ziga chorlayotgan kuz faslining tarovatini musavvir mo‘yqalami orqali turfa bo‘yoqlarda tasvirlasa, bastakor ushbu fasl nafasini ohang yordamida ko‘nglingizga olib kiradi. Xuddi shu kabi, agar tarix ilmi voqea-hodisalarning qachon, qayerda, nima sababdan yuz bergani, bu qanday natijalarga olib kelganini chuqur o‘rgansa, adabiyot uchun ushbu hodisalarda ishtirok etgan kishilarning qalbidan o‘tgan kechinmalar muhimroq hisoblanadi. Tarixchi bo‘lib o‘tgan hodisalarning o‘rni, unda ishtirok etgan odamlar ism-u shari , ularning tarjimayi holiga oid faktlarni iloji boricha aniq ifoda etmog‘i lozim. Ijodkor adib esa o‘z g‘oyaviy-badiiy maqsadidan kelib chiqib mazkur hodisalarga biroz erkinroq yondashadi. Masalan, sarkarda Amir Temurning taqdirida muhim o‘rin tutgan «Loy jangi» (1365-yil)ga raqiblar qanday tayyorgarlik ko‘rganlari, bu jangda har ikki tomondan nechtadan askar ishtirok etgani, har bir tomondan qancha odam qurbon bo‘lgani va boshqa tafsilotlarga yozuvchi to‘liq to‘xtalishi shart emas. U mazkur jangning butun dahshati va fojiasini birgina qahramon (u oddiy askar bo‘lishi ham mumkin!) qismati orqali o‘quvchiga anglatadi. "
            },
            {
              "id": 2,
              "page": 9,
              "title": "XALQ OG‘ZAKI IJODI «KUNTUG‘MISH» DOSTONI ",
              "desc": "Muayyan mamlakat, hudud, viloyat, shahar, tuman, mahalla va, hatto, hovlining o‘ziga xosliklaridan biri ularning Yer yuzidagi betakror o‘rnidir. Bular geografik o‘rin deb ataladi. Geografi k o‘rin mohiyatan tabiiy geografi k o‘rin, iqtisodiy geografi k o‘rin va siyosiy geografi k o‘rin tarzida guruhlanadi. Tabiiy geografi k o‘rin, asosan, okean, dengiz, daryo, tog‘, cho‘l, o‘rmon, adir singari yirik tabiiy obyektlarga nisba tan joy lash gan o‘rniga ko‘ra belgilansa, iqtiso diy geo gra fi k o‘rin jahon ning erkin iqtisodiy mintaqa lari, jahon savdo yo‘llari, yirik sav do- sanoat markaz lari va tabiiy boyliklardan foy da lanish imkoniyatlari bilan belgi la nadi. Siyosiy geografi k o‘rin esa muayyan davrda alo hida davlatning harbiy mojarolar ro‘y berayotgan yoki ro‘y berishi mumkin bo‘lgan hudud va davlatlarga nisbatan qanchalik aloqa dorligiga ko‘ra baholanadi. Geografi k obyektlar o‘zaro aloqador bo‘ladi. Ana shu aloqadorlik ko‘lamiga muvofi q geografi k o‘rin mikro, mezo, makro miqyosda namoyon bo‘ladi. Endi Vatanimiz O‘zbekistonning geografi k o‘rnidagi o‘ziga xos jihatlar, uni belgilovchi omillarni ko‘rib chiqaylik. Tabiiy geografi k o‘rni. O‘lkamiz ob-havosi yilning talay qismida ochiq va quruq bo‘ladi. E’tibor qilinsa, O‘zbekiston Respublikasining Davlat madhiyasi «Serqu yosh hur o‘lkam...» deya boshlanadi. Tabiiy geografi k o‘rin sharofati ila serquyosh va issiq kunlarning uzoq davom etishi mamlakatimiz qishloq xo‘jaligi, transport va maishiy hayotda mehnat va moliyaviy sarf-xarajatlarning tejalishiga imkon beradi. Bulutsiz osmonimiz astronomik tadqiqotlarda ham qo‘l keladi. Abu Rayhon Beruniy, Ahmad al-Farg‘oniy, Mirzo Ulug‘bekdek koinot bilimdonlari bizning yurtdan chiqqani bejiz emas. Iqtisodiy geografi k o‘rni. Har qanday davlatning rivojlanishini tashqi iqtisodiy aloqalarsiz tasavvur etib bo‘lmaydi. Tashqi iqtisodiy aloqalar miqyosi esa xalqaro mehnat taqsimoti, qolaversa, iqtisodiy geografik o‘rin imko niyatlariga bog‘liq. Insoniyat taraq qiyotining muayyan bosqichlarida yirik xalqaro savdo yo‘llari muhim omil bo‘lgan."
            },
            {
              "id": 3,
              "page": 14,
              "title": "«KUNTUG‘MISH» DOSTONINING BAYONI",
              "desc": "No‘g‘ay podsholaridan Avliyoyi Qoraxon degan bor ekan, laqablari Qilichxon ekan, shu vaqtning odamlari Avliyo ota deydi. Shul azizning bir yolg‘iz o‘g‘li bor edi, undan boshqa bolasi yo‘q edi. Otini Kuntug‘mish to‘ra der edi. O‘n to‘rtga kirguncha ilm-hunar, kasb-kamolot hosil qilib, o‘n to‘rtdan o‘tgandan keyin, sipohilik ishlariga yuz keltirib, qilich chopmoq, miltiq otmoq, chirishbozlik, ko‘pkaritozlik, nayzadastlik, garovbastlik ishlariga ko‘shish qilib, qirqta yigitni yoniga olib, goh toqqa, goh ovga shikor qilib yurar edi. Shahri Zangar degan shahar podshosining otini Buvraxon der edi. Buvraxonning ikki vaziri bor edi. Birovini otini Shoir vazir der edi, birovini Tohir vazir der edi, ikkovi aka-uka edi. Bular irim qilib niyat qilib edi: «Bizlarga farzand bersa, o‘g‘il bo‘lsa qo‘lqanot bo‘lsin, qiz bo‘lsa do‘st bo‘lsin». Kunlardan bir kun Shoir vazirning xotini qiz tug‘di, Tohir vazirning xotini o‘g‘il tug‘di. Qizning otini Xolbeka qo‘ydi, o‘g‘ilning otini Xolmo‘min qo‘ydi. Lekin Xolmo‘minning enasi qora bosib o‘ldi, o‘g‘li etak ostida qoldi. Xolbekaning enasi emizib katta qildi. Bular shirxo‘ra bo‘lib, nikoh yurmaydigan bo‘lib qoldi. Ikki vazirning avvalgi va’dalarini shaharning odamlari eshit- 15 gan edi. Mardumi shahar: «Xolbeka Xolmo‘minning baxshandasi», – der edi, sut emishganini bilmas edi. Ammo Xolbeka o‘n to‘rtga kirgandan keyin... ovozasi olamga ketdi, dong‘i Dog‘istondan o‘tdi. Xolbekaning tavsif-vasiyatini, husn zeboligini eshitgan podsho va to‘ralar, polvon-botirlar har mamlakatdan, har yurtdan, har diyordan sovchi qo‘ya berdi. Sovchilarga Xolbeka: «Har kim meni olaman deb kelsa, oldiga nard o‘yinini qo‘yaman, o‘ynayman, utsa tegaman, utdirsa so‘yaman», – deb elga shuhrat berdi. "
            },
            {
              "id": 4,
              "page": 39,
              "title": "ISHQIY-QAHRAMONLIK DOSTONLARI",
              "desc": "Doston xalq og‘zaki ijodi va o‘zbek mumtoz adabiyotida keng foydalanib kelinayotgan epik shakllardan biridir. «Doston» so‘zi xilma-xil ma’noni bildirib kelgan. Masalan, «doston» forschada epik asar nomini anglatadigan so‘z bo‘lib, u hatto qissa, romandek katta nasriy asarlarga ham nisbat beriladi. Siz bilan biz o‘rganayotgan doston esa xalq og‘zaki ijodida yaratilgan va yaratilayotgan muayyan kompozitsion yaxlitlikka ega bo‘lgan xalq dostonlaridir. Ular yozma adabiyotdagi «Suhayl va Guldursun», «Farhod va Shirin», «Layli va Majnun» kabi dostonlardan fantaziya ko‘lami, ko‘z ko‘rib, quloq eshitmagan voqealar, aql bovar qilmaydigan qahramonliklar tasviri bilan farq qiladi. To‘g‘ri, yuqorida nomlari tilga olingan dostonlarda ham fantastik unsurlar, mubolag‘ali o‘rinlar mavjud. Biroq ularning birortasi sujet erkinligi, favqulodda qiziq voqealar borasida xalq dostonlari bilan tenglasha olmaydi. Dostonlarimizda xalqimizning baxtli kunlar, ro‘shnoliklar haqidagi orzu-umidlari, faqat yaxshilikka, yorug‘ kunlarga erishish istagi yotadi. E’tibor bersangiz, dostonlar muvaffaqiyatli yakun bilan tugaydi. Asar qahramonlari juda katta fojialarni, qiyinchi- 40 liklarni boshlaridan kechiradilar, og‘ir sinovlarga bardosh beradilar, oxir-oqibat murod-maqsadlariga erishadilar. "
            },
            {
              "id": 5,
              "page": 42,
              "title": "YUSUF XOS HOJIB BOLOSOG‘UNIY (XI asr) ",
              "desc": "Yusuf Xos Hojib XI asrda yashab, turkiy tilda ijod etgan buyuk shoir hisoblanadi. Yusuf – asl ismi. Aynan «Qutadg‘u bilig» dostoni zamon hukmdori tahsiniga sazovor bo‘lgani uchun muallifga «xos hojib», ya’ni eshik og‘asi rasmiy lavozimi berilgan. Shoir buni o‘ziga taxallus qilib olgan. Yusuf qadimiy Bolosog‘un shahrida tug‘ilgan. Bolosog‘uniy deyilishi – shundan. Ba’zi manbalarda bu shahar Quzo‘rda deb ham tilga olinadi. Bizga Yusuf Xos Hojibning birgina «Qutadg‘u bilig» asari yetib kelgan. Shoir hayotiga oid ma’lumotlarni ham faqat shu dostondangina topamiz. Asar hijriy 462, ya’ni milodiy 1069–1070-yili Koshg‘arda yozib tugallangan. Hajmi – 6 ming 409 baytdan iborat. Muallifning o‘zi uni bir yarim yil mobaynida bitganini aytadi: Tegurdi menga algi ellik yoshim, Qug‘u qildi quzg‘un tusitek boshim. Oqir ellik emdi mengar kel teyu, Pusug‘ bo‘lmasa, bordim emdi naru. (Ellik yoshim menga qo‘l tegizdi, Qora quzg‘un tusidek boshimni oq (qush) qildi /ya’ni sochim oqardi/. Ellik /yosh/ endi men tomon kel, deb chorlamoqda, Pistirma /ya’ni nogahoniy o‘lim/ bo‘lmasa, endi u tomon boraman.)"
            },
            {
              "id": 6,
              "page": 46,
              "title": "QUTADG‘U BILIG (Dostondan parcha)",
              "desc": "Elig aydi emdi ayitgu so‘zim, Bu yerda muni emdi aytur o‘zum. 47 (Elig aytdi: mening so‘raydigan so‘zlarim Ushbular edi, endi shularni so‘rayman). To‘rutti ara o‘qlanin bir Bayat, Uluq bir, kichig bir, esiz edi at. (Odam bolasini yolg‘iz Xudo yaratdi, Ular orasida ulug‘, kichik, yomon, yaxshi bor). Biliglik, biligsiz, chiqay bar ya bay, Uqushliq, uqushsiz, otun bir gaday. (Dunyoda ilmli-yu ilmsiz ham, qashshog‘-u boy ham, Uquvli-yu uquvsiz ham, nochor-u gadoy ham bor). Nekutek kerak beg muni baglasi? Javi barsa ati, ishin ishlasa. (Bularga bosh bo‘lish uchun bek qanday bo‘lmog‘i kerak? Toki uning ovozasi yoyilsa, ishlariga rivoj bersa). Etilsa edi qam, bayusa budun, Ati edgu bo‘lsa, ul artar budun. (Eli yashnasa hamda xalq boyisa, Ezgu nom chiqarsa, ulus ko‘paysa). Xazina urunsa kumush ham ag‘i, Yag‘i boyni yanchsa, ketarsa chog‘i. (Xazinani kumush-u javohirlar bilan to‘ldirsa, Yov bo‘ynini yanchsa, adovatga barham bersa). Yumutsa, erat bo‘lsa kuchlug alig, Yuritsa to‘r-u tuz, yetursa bilig. (Lashkar to‘plasa, qo‘li baland bo‘lsa, To‘g‘ri siyosat olib borsa, bilimga amal qilsa). Javiqsa ajunda, yadilsa ati Bedusa kuninga ko‘tursa quti. 48 (Jahonga ovozasi, nomi yoyilsa, taralsa, Kundan-kunga yuksalsa, davlati ziyoda bo‘lsa). Erajin avinsa, yesa el uzun, Butun jan uzulsa, yesa ul ajun. (Rohat-farog‘atda yashasa, uzoq yillar elga bosh bo‘lsa, Bor joni uzilgach, u dunyoligini topsa)."
            },
            {
              "id": 7,
              "page": 74,
              "title": "LUTFIY (1366 – 1465)",
              "desc": "Lutfiy – o‘zbek adabiyotining XV asr ikkinchi yarmigacha bo‘lgan davrlardagi eng mashhur lirik shoiri. Shuning uchun ham zamonasining ahli adabi va ahli fuzalosi uni «malik ul-kalom», ya’ni «so‘z podshosi» deb e’zozlagan. Manbalarda taxallusi oldidan «ulug‘ ustod» ma’nosidagi «Mavlono» sifatining qo‘shib tilga olinishi ham – shundan. Obro‘yi va shuhrati juda yuksak darajaga yetgan edi. Alisher Navoiy uni o‘zining ustozlaridan biri deb biladi. Buni shoirlar haqidagi «Majolis un-nafois» tazkirasidagi bu ulug‘ shoir haqida aytilgan quyidagi iliq so‘zlar ham isbotlaydi: «Mavlono Luty o‘z zamonasining malik ul-kalomi erdi, forsiy va turkiyda naziri yo‘q erdi… va turkcha devoni ham mashhurdur». Navoiyning «Nasoyim ul-muhabbat min shamoyim ul-futuvvat» degan tasavvuf vakillari – shayx-avliyolar to‘g‘risidagi tazkirasida esa Lutyning uzoq umr ko‘rgani va qabri haqida ham qimmatli ma’lumot beriladi: «...To‘qson to‘qqiz yoshida olamdin o‘tdi. Qabri Dehikanordadur, o‘z maskani erdi». Bundan shoir Hirotda tug‘ilib-o‘sgani, o‘zi yashagan Dehikanor degan qishloqda dafn etilganini bilib olamiz. Biroq Mirzo Ulug‘bek davrida Samarqandda yashab, ijod etgan o‘zbek adabiyotshunosi Ahmad Taroziyning keyingi yillarda Amerika Qo‘shma Shtatlaridan topilgan adabiyot nazariyasiga bag‘ishlangan «Funun ul-balog‘a» asarida bu shoir «Lutyi Shoshiy» deya tilga olinganiga asoslanib, olimlar uning Toshkentda tavallud topgan bo‘lishi mumkinligini ham aytishyapti. Сhunki Shosh hozirgi Toshkentning qadimiy nomi bo‘lganini yaxshi bilasiz.  "
            },
            {
              "id": 8,
              "page": 98,
              "title": "ALISHER NAVOIY (1441 – 1501)",
              "desc": "Muhtaram o‘quvchi! Oldingi sinarda siz buyuk o‘zbek shoiri va mutafakkiri, o‘zbek adabiy tilining asoschisi Alisher Navoiy tarjimayi holi, u yozgan o‘lmas asarlar, ulardan ba’zilarining mazmun-mohiyati, badiiy jozibasi bilan atroicha tanishgan edingiz. Yaxshi bilasizki, Alisher Navoiy 1441-yil 9-fevralda temuriylar hukmronligida bo‘lgan Xuroson davlatining poytaxti Hirot shahrida saroy amirlaridan bo‘lmish G‘iyosiddin Kichkina xonadonida tavallud topdi. Kichik yoshidan ta’lim olib, maktabda o‘qib yurgan kezlari forsiy tildagi tasavvuy adabiyotning asoschilaridan biri hisoblanmish Farididdin Attorning mashhur «Mantiq ut-tayr» («Qush nutqi») dostonini sevib, berilib o‘qidi. Ota-onasi mazkur asarga yoshlayin bu qadar mashg‘ul bo‘lib ketganidan qo‘rqib, kitobni undan olib, yashirishdi. «Biroq, – deydi oltmish yoshlarida shu dostonga javob tariqasida yozgan «Lison ut-tayr» («Qush tili») asarida shoir, – men «Mantiq uttayr» matnini to‘liq yodlab olgan edim...» Siyosiy vaziyatlar taqozosi bilan Navoiylar oilasi Mashhad shahriga ko‘chib, bir necha yil o‘sha yerda yashaganidan ham xabardorsiz. 1466–1469-yillari yosh shoir Samarqand shahridagi madrasalarda ta’lim oldi. Davlat ishlarida xizmatda ham bo‘ldi, faol ijod ham qildi. 1469-yilning bahorida do‘sti temuriyzoda Husayn Boyqaro Hirot taxtini egallaganidan so‘ng shoirni yoniga chaqirdi. Ulug‘ qalam sohibi bir necha yil Husayn Boyqaro saroyida oliy martabali lavozimlarda xizmatda bo‘ldi. U buyuk amallardan iste’foga chiqib, erkin ijodiy ishlar bilan mashg‘ul bo‘lgan kezlarida ham ijtimoiy-siyosiy faoliyatdan chetlashgan emas"
            },
            {
              "id": 9,
              "page": 100,
              "title": "G‘AZALLAR",
              "desc": "Alishеr Navoiy – g‘azal mulkining sultoni. Faqat o‘zbеk shе’riyatidagina emas, butun turkiy adabiyotda hеch kim ungacha ham, undan kеyin ham u yaratganchalik ko‘p va xo‘p g‘azal yozmagan. Navoiy – avvalo, lirik shoir. U bolalik chog‘laridan umrining oxirigacha shе’rlar ijod qildi. Shoir eski o‘zbеk va forstojik tillarida o‘zidan boy lirik mеros qoldirdi. Xususan, o‘zbеk lirikasini tamoman yangi bir pog‘onaga olib chiqdi. Shoir lirikasining asosiy janri esa g‘azal edi. Uning lirik shе’rlari jami sakkiz dеvonga jamlangan. Shundan yеttitasi turkiy, bittasi forsiy lirikadan tashkil topgan. 1465–66-yili shoirning muxlislari tomonidan uning ixtiyorisiz tuzilgan dеvon navoiyshunoslikda «Ilk dеvon» nomi bilan yuritiladi. Taxminan 1472–1476-yillar orasida esa bеvosita zamona shohi Husayn Boyqaroning iltimosi bilan Navoiy o‘zining birinchi dеvoni – «Badoyi’ ul-bidoya»ni tuzdi. Bu dеvonga maxsus «Dеbocha» yozib, o‘zining shе’riyatga, xususan, g‘azalga nisbatan qarashlarini, ijodiy qat’iyatlarini bayon etdi. «Dеbocha» Navoiyning turkiy shе’riyatga o‘ta yuksak mеzonlar bilan yondashadigan sohibi qalam sifatida bo‘y ko‘rsata boshlaganidan dalolat bеradi. 1486-yili shoir o‘zining ikkinchi dеvoni – «Navodir un-nihoya» («Bеhad nodirliklar»)ni tuzdi. Navoiy 1493-yili forsiyda bitilgan barcha lirik shе’rlarini yig‘ib, «Dеvoni Foniy»(«Foniy dеvoni»)ni tartib bеrdi. Chunki shoir fors-tojik tilidagi lirik shе’rlarida «Foniy» taxallusini qo‘llagan. Bu dеvonda jami 554 g‘azal mavjud. 1491–92-yildan e’tiboran shoir barcha turkiy shе’rlarini yig‘ib, to‘rt dеvondan iborat «Xazoyin ul-maoniy» («Ma’nolar xazinasi», u «Chor dеvon» nomi bilan ham mashhur) majmuasini tuzishga kirishdi. Bu kеng ko‘lamli va jiddiy ish 1498–1499-yillargacha davom ettirildi. "
            },
            {
              "id": 10,
              "page": 143,
              "title": "NODIRA (1792 – 1842)",
              "desc": "Nodira – XIX asrning birinchi yarmida ijod qilgan taniqli o‘zbek shoirasi. Uning asl ismi Mohlaroyim bo‘lib, Nodira – adabiy taxallusi. Bundan tashqari, Komila taxallusi bilan ham o‘zbekcha she’rlar bitgani ma’lum. Bu qalam sohibasi – zullisonayn (ikki tilda ijod qilgan) shoiralarimizdan. Fors-tojik lisonidagi asarlarini Maknuna taxallusi bilan yozgan. U ijod qilgan davrda Qo‘qon adabiy muhitida o‘zbek va fors-tojik tillarida badiiy asarlar yaratish qariyb teng darajada edi. Nodira 1792-yili Andijonda tavallud topgan. U Andijon hokimi Rahmonqul otaliqning qizi. Nodiraning ota-onasi buyuk Sohibqiron Amir Temur xonadoniga mansub edi. Buni uning ushbu baytlaridan ham bilib olish mumkin: Siyodat xonadoni, shohi Bobur nasli pokimen, Xudoyo, rahmat ayla barcha ajdodi izomimni. Nodiraning onasi – Oyshabegim qizining soliha farzand, komila shaxs bo‘lib yetishuviga ko‘p hissa qo‘shdi. Bo‘lg‘usi shoira zamona xoni oilasiga yaqin qarindosh bo‘lgan xonadonda voyaga yetdi. Rahmonqul otaliq Qo‘qon xoni Olimxonning tog‘asi edi. Shuning uchun 1807-yili Olimxon ukasi Umarxonni tog‘asining qizi Mohlaroyimga uylantirdi. Umarxon Marg‘ilon begi lavozimiga tayinlanganidan keyin oilasini shu shaharga olib ketdi. Oradan uch yil o‘tib, ya’ni 1810-yili Qo‘qon xoni, ya’ni Nodiraning qaynakasi Olimxon qatl etildi. Uning taxtiga ukasi Umarxon o‘tirdi. Shoiraning bundan keyingi hayoti mamlakat poytaxti bo‘lgan shu shaharda – xon saroyida kechdi."
            }
          ]
        },
        {
          "classId": 2,
          "classLevel": 9,
          "mundarija": [
            {
              "id": 1,
              "page": 4,
              "title": "RUHIY kАmоlоt VОSIТАSI ",
              "desc": "Bаdiiy аdаbiyotning аsоsiy ish qurоli so‘zdir. O‘zi ko‘zgа hаm ko‘rinmаydigаn so‘z yordаmidа nаfаqаt аtrоfdаgi nаrsаhоdisаlаr, bаlki bоshdаgi o‘ylаr, ko‘ngildаgi sеzimlаrgаchа ifоdаlаsh mumkin. Shuning uchun hаm sаn’аt turlаri оrаsidа аdаbiyot аlоhidа o‘rin tutаdi. Insоnning o‘y-хаyollаri, istаg-u аrmоnlаri bаdiiy аdаbiyotdа to‘lаrоq аks ettirilаdi. Shuningdеk, bаdiiy аdаbiyotdа tаsvirlаngаn hаyot sеrqirrа vа tа’sirli bo‘lаdi. Таsаvvur qilаylik, siz “Аlpоmish” dоstоnini o‘qiyapsiz. Bilаsizki, аsаrdаgi vоqеаlаr bundаn minglаrchа yillаr оldin qаyеrdаdir, kimlаr bilаndir ro‘y bеrgаn, ehtimоl, hеch qаchоn bo‘lmаgаndir hаm. Аsаr qаhrаmоnlаri sizgа qаrindоsh hаm, yaqin hаm emаslаr. Lеkin ulаrning tаqdiri sizning tаqdiringizgа, tuyg‘ulаri siznikigа qo‘shilib kеtаdi, o‘zingizni ulаrdаn аyri tаsаvvur qilоlmаysiz. Dоstоn qаhrаmоnlаri tаqdirining, umumаn, bаdiiy аsаrning tuyg‘ulаringizgа bunchаlаr qаttiq tа’sir ko‘rsаtishi, sizning sеzimlаringizni bеzоvtа qilishi sаbаbi hаqidа bеiхtiyor o‘ylаb qоlаsiz. Bаdiiy аdаbiyot, umumаn, sаn’аt аsаrlаrining insоn ruhiyati vа tаfаkkurigа tа’siri sаbаbi nimаdа ekаn? Bu sаvоlgа bеrilаdigаn jаvоb tushunаrlirоq bo‘lishi uchun bаdiiy vа ilmiy аdаbiyotlаrni bir-birigа sоlishtirib ko‘rish kеrаk. Siz “Таbiаtshunоslik” vа “Gеоgrаfiya” fаnlаri оrqаli kecha-kunduzning eng go‘zal va so‘lim payti bo‘lmish tоng to‘g‘risidа, yеr gа hаyot bахsh etuvchi Quyosh hаqidа bir talay mа’lumоtlаrga egasiz. Quyosh bo‘lmasa, yerda tiriklik bo‘lishi mumkin emasligi va buning sababi ilmiy tushuntiriladi. Bu ma’lumotlar sizning bilimingizni oshirgan. Ulаr yordаmidа siz tоnggа хоs bеlgilаrning namoyon bo‘lish tarzi haqida ma’lum tushunchaga ega bo‘lgаnsiz. Bu хil bilimlаr, shubhаsiz, sizning tаfаkkuringizni o‘stirgаn-u, аmmо tuyg‘ulаringizgа dеyarli tа’sir qilmаgаn. "
            },
            {
              "id": 2,
              "page": 43,
              "title": "ХаlQ dоstоnlаri vа ulаr ning tur lаri",
              "desc": "Хаlq оg‘zаki ijоdi bаdiiy аdаbiyotning eng qаdimgi shаklidir. Nеgаki, оdаmlаr bаdiiy аsаrlаrni dаstlаb оg‘zаki shаkldа yarаtishgаn vа ulаr оg‘izdаn-оg‘izgа ko‘chib yurgаn. Bu аsаrlаr ulkan tа’sir kuchigа egа bo‘lgаnliklаri uchun hаm хаlqning bаdiiy хоtirаsi tufаyli bizlаrgаcha yеtib kеlgаn. O‘zbеk fоlklоridа хаlq dоstоnlаri аlоhidа o‘rin tutаdi. Оlimlаr ХIХ аsr охiridаn ХХ аsrning ikkinchi yarmigа qаdаr o‘zbеk bахshilаri tоmоnidаn kuylаngаn yuz ellikkа yaqin dоstоn bоrligini аniqlаshgаn vа vаriаntlаri bilаn qo‘shib 44 hisоblаgаndа, ulаrdаn to‘rt yuztаchа аsаr yozib оlingаn. Fоlklоrchi оlimlаrning аytishlаrichа, birginа “Go‘ro‘g‘li” turkumidаgi dоstоnlаr yuzdаn оshаdi, yolg‘iz “Аlpоmish”ning qirqdаn оrtiq yozib оlingаn vаriаnti bоr. “Dоstоn” fоrschа so‘z bo‘lib, qissа, hikоya, sаrguzаsht, tа’rif mа’nоlаrini bildirаdi. Fаvqulоddа хususiyatlаrgа egа qаhrаmоnlаrning bоshidаn o‘tgаn qаltis vоqеаlаr shе’r vа nаsriy yo‘ldа аrаlаsh tаsvirlаngаn yirik hаjmli, muаllifi nоmа’lum epik аsаrlаr хаlq dоstоnlаri dеyilаdi. Хаlq dоstоnlаri оlimlаr tоmоnidаn quyidаgi turlаrgа аjrаtilgаn: 1. Qаhrаmоnlik dоstоnlаri. 2. Jаngnоmа dоstоnlаr. 3. Rоmаntik dоstоnlаr. 4. Таriхiy dоstоnlаr. 5. Кitоbiy dоstоnlаr. Yozmа dоstоnlаr аniq muаllif tоmоnidаn shе’riy yo‘ldа yozilib, birоr pеrsоnаj kеchirgаn hоdisаlаr shоirning histuyg‘ulаri bilаn uyg‘unlikdа tаsvirlаnаdi. Bu хil аsаrlаr аdаbiyotshunоslikdа “pоеmа” dеb hаm yuritilаdi. Shе’r bilаn nаsrning аrаlаsh kеlishi хаlq dоstоnlаrining muhim bеlgisidir. Dоstоnlаrdаgi shе’rlаr, аsоsаn, o‘n bir bo‘g‘inli bo‘lib, bаrmоq vаznidа аytilgаn bo‘lаdi. Qаhrаmоnlаrning o‘y-mulоhаzаlаri, nisbаtаn tinch ruhiy hоlаti tаsviri, o‘zаrо so‘zlаshuvlаri o‘n bir bo‘g‘inli shе’r bilаn ifоdаlаnаdi. Bа’zаn dоstоnlаrdа tаsvir tаlаbigа ko‘rа yеtti, sаkkiz bo‘g‘inli shе’riy ifоdаlаr hаm uchrаydi. Оtlаr chоpishi, jаng mаnzаrаlаri, pеrsоnаjlаrning tеzkоr vа shiddаtli hаrаkаtlаri аks etgаn o‘rinlаr yеtti-sаkkiz bo‘g‘inli shе’rlаr bilаn ifоdаlаnаdi. "
            },
            {
              "id": 3,
              "page": 45,
              "title": "Nosiruddin burhoniddin rabg‘uziy ",
              "desc": "Аdibning hаyoti vа ijоdi hаqidа bizgаchа yеtib kеlgаn mа’lumоt judа kаm. XIII аsrning охiri XIV аsrning bоshlаridа Хоrаzmning Rоbоti o‘g‘uz dеgаn jоyidа yashаb ijоd etgаn. Bizgа uning “Qisаsi Rаbg‘uziy”dаn bоshqа аsаri mа’lum emаs. Маzkur kitоbdа u o‘zi hаqidа musulmоnlаrgа хоs kаmtаrinlik bilаn “...bu kitоbni tuzgаn, tоаt yo‘lidа tizgаn, mа’siyat yobоnin kеzgаn, оz оzuqliq, ko‘p yozuqliq Rоbоti o‘g‘uz qоzisi Burhоn o‘g‘li Nоsiruddin...” dеb yozаdi. Кo‘rinаdiki, аllоmаning оti Nоsiruddin bo‘lib, оtаsi Burhоniddin Rоbоti o‘g‘uzning qоzisi bo‘lgаn. Rаbg‘uziy tахаllusi hаm u yashаgаn jоy nоmi bilаn bоg‘liq. Yеtuk ulаmо vа din аrbоbining оilаsidа tаrbiyalаngаn Nоsiruddinning o‘z zаmоnаsidа tаniqli tаriхchi, yеtuk shоir vа istе’dоdli tаrjimоn sifаtidа tаn оlingаnligidаn dаlоlаt bеruvchi bir tаlаy yordаmchi mаnbаlаr mаvjud. Rаbg‘uziyning qissаlаri mа’nоsini аnglаtuvchi “Qisаsi Rаbg‘uziy” аsаri оlаm vа оdаmning yarаtilishi, insоnning yo‘ldаn оzishi vа kоmillik sаri mаshаqqаtli hаmdа uzоq yo‘l bоsib bоrаyotgаnligi hаqidа g‘оyat mаntiqli vа qiziqаrli tаrzdа hikоya qilinаdi. Ushbu аsаr musulmоn dinini qаbul qilgаn e’tibоrli mo‘g‘ul bеklаridаn Nоsiruddin Тo‘qbug‘аning iltimоsigа ko‘rа, hijriy 709 (milоdiy 1309—1310) yildа yozilgаn. Аsоsаn pаyg‘аmbаrlаr hаyotini hikоya qiluvchi bu аsаrning o‘zigа хоs yarаtilish tаriхi bоr. Мusulmоn Shаrqidа bu mаvzudа “Qisаs ul-аnbiyo” (Pаyg‘аmbаrlаr qissаsi) nоmi bilаn mаshhur ko‘plаb аsаrlаr yarаtilgаn. Lеkin, аsаrdа yozilishichа, ulаrning “bа’zisi mustаqim (to‘g‘ri, hаqiqiy) bоr, bа’zisi nоmustаqim. Bir оnchаsi (bir qаnchаsi) muqаrrаr (puхtа, tugаl) vа bir оnchаsi mubаttаr (nоtugаl) bоr”. Shuning uchun hаm bеk Тo‘qbug‘а аdibdаn “o‘qimоqg‘а kеrаklik, o‘grаnmаkkа yarоg‘liq” pаyg‘аmbаrlаr qissаlаridаn ibоrаt аsаr yozib bеrishini so‘rаgаn edi."
            },
            {
              "id": 4,
              "page": 49,
              "title": "Rаsul аlаyhissаlоm vаfоti so‘zlаri",
              "desc": "Хаbаrdа kеlur, kunlаrdа bir kun Rаsul аlаyhissаlоm tоng nаmоzini o‘tаb minbаrg‘а оg‘ib sаhоbаlаrqа vа’z vа nаsihаt qildi. Аndа kеzin аydi: “Ey mo‘minlаr, kim ersаning mаnim uzа hеch dа’vоsi vа хusumаti bоrmu?” Kim ersа jаvоb аymаdi. Ikinch so‘rdi, kim ersа jаvоb аymаdi. Uchunchidа Ukоshа оtlig‘ sаhоbа qo‘pti1 , аydi: “Yo Rаsulullоh, mаnim bir dа’vоm bоr”. “Аytg‘il”, tеdi. Аydi: “Bir kun siz sаfаrdin kеlurdа siz tеvа2 gа minub, tеvа urur bo‘lub, ul qish qаmchi3 birlа uchаm4qа urdingiz, yavlоq5 оg‘ridi. Yo Rаsulаllоh, uch qurlа аymаsаngiz mаnmа аymаs erdim”, tеdi. Rаsul аlаyhissаlоm hujrаgа kishi izti6 , qаmchi tilаgаli kеldi. Qаmchi tilаdi. Хоtunlаr: “Nа bo‘ldi, nа yеrgа bоrur?” tеb qаzg‘ur7 dilаr. Аydi: “Sаfаrg‘а bоrmаs, yеrgа bоrur?” tеb qаzg‘urdilаr. Аydi: “Sаfаrg‘а bоrmаs, аmmо Ukоshа qisоs8 tilаyur”, tеdi. Хоtunlаr yig‘lаshtilаr. Qаmchini kеlturdi. Rаsul ilkingа оldi. Ukоshаg‘а bеrdi. “Mаn nеtаk urdum ersа sаn tаqi аndаg‘ urg‘il”, tеdi. Ukоshа qаmchi оlib аndаg‘ tеdi: “Bu qаsоs rоst kеlmаs. Ul kun siz tеvа munub bоrur erdingiz, mаn yеrdа аndоg‘ erdim. Ustundin ingаn bеrgа birlа bu rоst kеlurmu?” Rаsul аlаyhissаlоm minbаrdin indi, Ukоshаni minbаrg‘а оg‘dur9di. “Urg‘il”, tеdi. Sаhоbаlаr yig‘lаshtilаr. Ukоshа аydi: “Yo Rаsulullоh, ul kun mаning engim yoling10 erdi, yavlоq оg‘ridi. Тo‘nungni chiqаrgil, qisоs rоst kеlsun”, tеdi. Yig‘i, cho‘g‘i11 sаhоbаlаrdin zоhir bo‘ldi."
            },
            {
              "id": 5,
              "page": 59,
              "title": "Аlishеr Nаvоiy (1441 — 1501)",
              "desc": "Siz quyi sinflаrdаn bеnаzir insоn, buyuk аllоmа, dаhо ijоdkоr Аlishеr Nаvоiy hаyoti vа ijоdi bilаn tаnishib kеlmоqdаsiz. Millаtimiz fахri bo‘lmish bu zоtning аsаrlаri, ulаrning mаzmun-mоhiyati to‘g‘risidа tаsаvvurgа egаsiz. Ushbu sinfdа Siz uning “Хаmsа” аsаri bilаn bаtаfsilrоq tаnishаsiz. Shаrqdа хаmsаchilikning o‘zigа хоs tаriхi vа аn’аnаsi mаvjud. “Хаmsа” yozishni оzаrbаyjоnlik ulug‘ shоir Nizоmiy Gаnjаviy bоshlаb bеrgаn. Lеkin u bu аsаrini аvvаldаn niyat qilib, mа’lum bir rеjа аsоsidа yarаtmаgаn. Nizоmiy 1173—1179- yillаrdа Аrzinjоn hоkimi Fахriddin Bаhrоmshоhgа bаg‘ishlаb “Mахzаn ul-аsrоr” (“Sirlаr хаzinаsi”) nоmli hаmdnоmа yozаdi. 1180—1181- yillаrdа Irоq hukmdоri Тo‘rg‘ul II ning iltimоsigа ko‘rа “Хusrаv vа Shirin” dоstоnini yarаtаdi. 1188- yildа Shirvоnshоhlаrdаn Ахsаtаn I Nizоmiygа “Lаyli vа Mаjnun” dоstоnini yozishni buyurаdi. 1196- yildа hukmdоr Аlоvuddin Ko‘rpа Аrslоnning tоpshirig‘i f bilan Bаhrоm hаqidа “Hаft pаykаr” (“Yеtti go‘zаl”) mаydоngа kеldi. 1196—1201- yillаrdа “Iskаndаrnоmа” yarаtilаdi. Shu tаriqа 1173—1201- yillаr оrаlig‘idа — 28 yil dаvоmidа muаllifning bеsh dоstоni dunyo yuzini ko‘rdi. Shundаn so‘ng аdibdа turli yillаrdа bitilgаn bu dоstоnlаrni jаmlаb, yagоnа bir nоm bilаn аtаsh fikri tug‘ilgаn vа “Pаnj gаnj” (“Bеsh хаzinа”) nоmi bilаn mаshhur bo‘lgаn birinchi “Хаmsа” vujudgа kеlgаn."
            },
            {
              "id": 6,
              "page": 65,
              "title": "“Fаrhоd vа Shiri n” (dоstоndаn pаrchаlаr)",
              "desc": "“Хаmsа”ning bu ikkinchi dоstоni ishqiy-sаrguzаsht хаrаktеridаdir. Hаjmi 5782 bаyt. Аruzning hаzаji musаddаsi mаhzuf vаznidа yozilgаn. Muаllif bu аsаrni “shаvq dоstоni” dеb аtаydi. Sаbаbi undа ishq kuylаnаdi, ishq tаlqin qilinаdi, ishq ulug‘lаnаdi. Bu shundаy ishqki, u insоnni pоklаydi, ezgulik sаri yеtаklаydi, ungа o‘zligini tаnitаdi, bir so‘z bilаn аytgаndа, kоmillik sifаtlаrini tаrbiyalаydi. Chunki u оdаmgа, оlаmgа, butun bоrliqqа mеhr bilаn, muhаbbаt bilаn yo‘g‘rilgаn vа охir bоrib Yarаtgаnning o‘zigа ulаshib kеtаdigаn ishqdir. Binоbаrin, dоstоndа Nаvоiyning kоmil insоn hаqidаgi оrzuo‘ylаri ifоdа etilgаn. Ijоddа o‘zigа хоslikkа intilgаn аdib o‘zigаchа bo‘lgаn bu dоstоn аn’аnаsigа ijоdiy yondаshаdi. Dоstоn Nаvоiygаchа “Хusrаv vа Shirin” shаklidа mаshhur edi. Ulаrdа mаrkаziy оbrаz shоh Хusrаv edi. Lеkin u kоmillikdаn yirоq, ishqdа bеqаrоr, muhаbbаtdаn tоj-tахtni ustun bilguvchi хudbin shахs. Shuning uchun Nаvоiy uni Shirinning muhаbbаtigа hаm, yozilаjаk dоstоnidаgi bоsh оbrаz dаrаjаsigа hаm lоyiq ko‘rmаydi. U Fаrhоdni bоsh оbrаz qilib оldi vа bu bilаn dоstоnning qurilishini, mаzmunini tаmоmilа o‘zgаrtirdi. Mаzkur o‘zgаrish хаmsаchilikkа shоir kiritgаn eng kаttа yangilik edi"
            },
            {
              "id": 7,
              "page": 93,
              "title": "Kоmil insоn",
              "desc": "Таsаvvuf — musulmоn оlаmidа (mаmlаkаtlаridа) kеng tаrqаlgаn, butun dunyodа mаshhur bo‘lgаn islоm dinigа аsоslаnuvchi buyuk tа’limоt. Таsаvvuf оrqаli insоniyat Islоm dinining ichki vа tаshqi go‘zаlligini, uning buyuk insоnpаrvаrlik mоhiyatini аnglаb yеtdi. Таsаvvufning mаqsаdi insоnni ruhiy, mа’nаviy jihаtdаn pоklаsh, ya’ni kоmil insоnni tаrbiyalаshdir. Qаlb pоkligigа erishgаn, yuksаk mа’nаviyatli, аqlаn vа jismоnаn bаrkаmоl shахs kоmil insоndir. Аksаriyat аdаbiyotlаrdа kоmil insоn ruhiy pоklаngаn insоn tushunchаsi bilаn tеnglаshtirilаdi. Dеmаk, ruhni pоklаsh zarur. Pоklаnishning yo‘li esа bittа, u — nаfsni yеngishdir. Nаfs dеgаndа yеmоqlik, ichmоqlik, kiymоqlikdаn tаshqаri yanа jоhillik, ilmsizlik, mаnmаnlik, kibr-u-hаvо, dunyopаrаstlik, zulm, o‘g‘rilik, tаnbаllik, tаmа, ko‘rоlmаslik, bахillik, mаnsаbpаrаstlik, shаhvаt, ko‘ngli tоrlik, g‘аzаb, umumаn, insоn ruhini, qаlbini bulg‘аydigаn, uni Оllоhdаn uzоqlаshtirаdigаn bаrchа illаtlаr yig‘indisi tushunilаdi. Qur’оni kаrimning bir qаtоr оyatlаridа оchiq yoki ishоrа bilаn nаfsni jilоvlаsh, yеngish lоzimligi mаzmunidа hukmlаr bоr. Shuningdеk, pаyg‘аmbаr Muhаmmаd аlаyhissаlоmning hаdislаridа hаm bu bоrаdа ko‘rsаtmаlаr tаlаyginа. Misоl tаriqаsidа Hаzrаti Аligа аytgаn ushbu nаsihаti (hаdisi) ni kеltirish mumkin: “Yo Аli, vаlоyat (аvliyolik) mаqоmigа yеtishgаn zоtlаr ko‘p-ko‘p ibоdаt qilgаnlаridаn emаs, o‘z nаfslаrini yеnggаnliklаridаn bundаy ulug‘ dаrаjаgа erishgаnlаr”. Nаfs insоnning judа qudrаtli, хаvfli dushmаni. Ungа tоbе insоn mа’nаviy vа jismоniy tubаnlikkа, hаlоkаtgа mаhkum. "
            },
            {
              "id": 8,
              "page": 95,
              "title": "Zаhiriddin Мuhаmmаd Bobur (1483–1530)",
              "desc": "Bоbur dunyoni hаyrаtgа sоlgаn yirik dаvlаt vа mаdаniyat аrbоbi, mоhir sаrkаrdа, dоnishmаnd tаriхchi, zаkоvаtli оlim vа tаrjimоndir. Hаyot yo‘li. Bоbur 1483- yili Fаrg‘оnа vilоyatining pоytахti Аndijоndа tug‘ilgаn. Оtаsi ushbu vilоyat hоkimi Umаrshаyх Мirzо Аmir Теmurgа to‘rtinchi аvlоd – evаrа edi. Оnаsi Qutlug‘ Nigоrхоnimning оtаsi Yunusхоn esа o‘n ikki аvlоd bilаn Chingizхоngа ulаnаrdi. Кo‘rinаdiki, Bоbur insоniyat tаriхidаgi ikki buyuk sulоlа tutаshgаn nuqtаdа dunyogа kеlgаn jаhоnning eng mаshhur shахslаridаn biridir. Мurаkkаb vа ziddiyatli hаyoti o‘spirinlikdаn tо umrining охirigаchа jаng-u jаdаllаr, sаrsоn-sаrgаshtаlik, zаfаr vа mаg‘lubiyat, ijоd-u bunyodkоrlik оg‘ushidа kеchdi. 1494- yildа Umаrshаyх Мirzоgа qаrshi uning o‘z аkаsi – Sаmаrqаnd hоkimi Sultоn Аhmаd Мirzо hаmdа qаynоg‘аsi Тоshkеnt hоkimi Маhmudхоn o‘zаrо til biriktirgаn hоldа qo‘shin tоrtib, Fаrg‘оnаgа yurish qilаdilаr. Nihоyatdа qаltis vаziyat vujudgа kеlаdi. Buning ustigа kutilmаgаn fаlоkаt yuz bеrаdi: Аndijоnning g‘аrb tоmоnidаgi jаr yoqаsidа binо bo‘lgаn Ахsi qo‘rg‘оnidа turgаn Umаrshаyх Мirzо kаbutаrхоnаsi bilаn jаrgа qulаb, hаlоk bo‘lаdi. Umаrshаyхdаn uch o‘g‘il vа bеsh qiz qоlgаndi. O‘g‘illаrining kаttаsi – 12 yoshgа qаdаm qo‘ygаn Bоbur tаоmil bo‘yichа tахtgа o‘tirаdi. Yarаtgаnning ko‘mаgi bilаn u tахtni sаqlаb qоlаdi. O‘rаtеpа, Хo‘jаnd vа Маrg‘ilоnni qo‘lgа оlib Quvаgа kirgаn Sultоn Аhmаd qo‘shini shаhаrni kеsib o‘tuvchi Qоrаsuv ko‘prigidа tоshqingа uchrаb, tuya vа оtlаri bоtqоq suvgа cho‘kib, ko‘pi nоbud bo‘lаdi."
            },
            {
              "id": 9,
              "page": 113,
              "title": "Boborаhim Маshrаb (1653–1711)",
              "desc": "Hаyot yo‘li аfsоnаlаrgа qоrishib kеtgаn, surаti-yu siyrаti rivоyatlаrdа bаyon etilgаn, хаlq оrаsidа hаlоllik, to‘g‘rilik, Hаqqа оshiqlikning timsоli bo‘lib gаvdаlаngаn Маshrаbdеk shахsi vа ijоdi mаshhur zоtni tоpish qiyin. Fаrhоd vа Qаys sеviklilаri Shirin-u Lаyligа intilgаni kаbi Маshrаb hаm Yarаtgаnning vаsligа bеqаrоr intilgаn оshiqi аnаlhаqdir. Кishi uning shахsini bilgаni sаyin vа ijоdini o‘rgаnish mоbаynidа o‘zining hаm tоzаrib bоrаyotgаnini tuyadi, buyuk Таngrigа yaqinlikni his qilаdi. Shuning uchun hаm uni o‘qimоq, uqmоq kеrаk. Оldinlаri Маshrаb 1640- yoki 1647- yillаrdа tug‘ilgаn dеb hisоblаnаr vа bu mа’lumоtlаr qаtоr ilmiy mаnbаlаrdа ko‘rsаtilgаn hаm edi. Keyingi mа’lumоtlаrgа ko‘rа, Bоbоrаhim Vаlibоbо o‘g‘li Маshrаb 1653- yildа Nаmаngаndа kоsib оilаsidа tug‘ilgаn. Yodingizdаmi, Nаvоiy “Хаmsа”si qаhrаmоnlаri Fаrhоd vа Qаys tug‘ilmаslаridаn ishq dаrdigа mubtаlо bo‘lgаn edilаr. Хuddi shu hоlаt Bоbоrаhimdа hаm yuz bеrаdi. Shоirning hаyot yo‘li yoritilgаn “Qissаi Маshrаb” аsаridа yozilishichа, u bоlаligidаn mаjnuntаbiаt, so‘fiysurаt, оdаmоvi vа хоmush qiyofаdа yurаdi. Uning g‘аyritаbiiy оdаtlаri, gаpso‘zlаri, yurgаn yo‘lidа аytаdigаn bаyt-u g‘аzаllаri оtа-оnаsi vа хаlоyiqni hаyrоn qоldirаdi."
            },
            {
              "id": 10,
              "page": 130,
              "title": "Мuhаmmаd Rizo Ogаhiy (1809—1874)",
              "desc": "Shоir, tаrjimоn, tаriхnаvis hаmdа dаvlаt vа jаmоаt аrbоbi Мuhаmmаd Rizо Оgаhiy хаlqimiz tаriхidа o‘zigа хоs o‘ringа egа bo‘lgаn sеrqirrа istе’dоd sоhibidir. Аyni pаytdа хаlqimiz o‘tmishini hаqqоniy аks ettirgаn bir nеchа nоdir аsаrlаri bilаn tаriх ilmi tаrаqqiyotigа munоsib hissа qo‘shgаn оlim sifаtidа e’tirоf etilаdi. Shuningdеk, uning judа ko‘plаb tаriхiy vа bаdiiy аsаrlаrni fоrs tilidаn оnа tilimizgа o‘girib, ulаrni хаlqimizning mа’nаviy mеrоsigа аylаntirishdаgi хizmаtlаri tаhsingа lоyiqdir. Оgаhiy 1809- yili 17- dеkаbrdа Хivа yaqinidаgi Qiyot qishlоg‘idа Erniyozbеk mirоb оilаsidа tаvаllud tоpdi. Shu yеrdа bоshlаng‘ich mа’lumоtni оlаdi. Yoshligidа оtаsi vаfоt etib, аdаbiyotimizning yanа bir yorqin siymоsi bo‘lmish аmаkisi Мunisning tаrbiyasidа bo‘ldi. U mаktаb, kеyinchаlik mаdrаsа tаhsili dаvоmidа аrаb vа fоrs tillаrini, tаriх ilmini puхtа o‘rgаndi. 1829- yildа Мunis vаfоt etgаch, hukmdоr Оllоquliхоn uning o‘rnigа Оgаhiyni mirоb (suv ishlаri bоshqаruvchisi) etib tаyinlаydi. Suv tаnqis bo‘lgаn Хоrаzmdа mirоblik nihоyatdа mаs’uliyatli vаzifа bo‘lib, uni ishоnchli vа hаlоl оdаm bоshqаrishi lоzim edi. Shu dаvrdаn Оgаhiyning dаvlаt vа jаmоаt аrbоbi sifаtidаgi fаоliyati bоshlаnаdi. U dаvlаt ishlаri bilаn mаshg‘ul bo‘lаr ekаn, bаdiiy ijоd hаmdа ilmiy fаоliyatini to‘хtаtmаdi. Sаrоy tаriхchisi vаzifаsini hаm оlib bоrаyotgаn Оgаhiy 1839- yildа Мunis bоshlаb qo‘ygаn “Firdаvs ul-iqbоl” (Iqbоl bоg‘i) аsаrini dаvоm ettirib, Хivа хоnligining 1825- yilgаchа bo‘lgаn tаriхini yozib tugаtdi."
            }
          ]
        },
        {
          "classId": 3,
          "classLevel": 10,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "MAHMUDXO‘JA BEHBUDIY",
              "desc": "Mahmudxo‘ja Behbudiy 1875-yil 19-yanvarda Samarqand yaqinidagi Baxshitepa qishlog‘ida tug‘ilgan. Mahmudxo‘ja to- g‘asi Muhammad Siddiqning tarbiyasini olgan. Arab tili gram- matikasini kichik tog‘asi Mulla Odildan o‘rgangan. Behbudiy 1899–1900-yillarda hajga boradi; 1903–1904-yil- larda Moskva, Peterburgga hamda 1906-yili Qozon, Ufa, Nij- niy Novgorod, Misr va Turkiyaga safar qiladi. Behbudiy XX asr o‘zbek adabiyoti tarixida munosib o‘rin- ga ega. Uning hayoti va ijodiy faoliyati jamiyat hayotidagi jiddiy o‘zgarishlar davriga to‘g‘ri keldi. Behbudiy Turkistonda maktab va maorif, matbuot va teatr, jurnalistika sohalarda ijti- moiy-siyosiy, adabiy-ma’rifiy faoliyat olib bordi. Qishloqlarda tashkil qilingan maktablar uchun bir qancha darsliklar yozdi. Behbudiy o‘z zamonasi yoshlariga murojaatida bunday yozadi: «Barchamizga oftob kabi ravshan va ayondirki, ma- kotib1 – taraqqiyning boshlang‘ichi, madaniyat va saodat- ning darvozasidir. Har millat eng avval makotibi ibtidoiysini zamoncha isloh etib ko‘paytirmaguncha taraqqiy yo‘lig‘a kirib madaniyatdan foydalanmas»2"
            },
            {
              "id": 2,
              "page": 18,
              "title": "«PADARKUSH» DRAMASI HAQIDA",
              "desc": "Mahmudxo‘ja Behbudiyning «Padarkush» dramasi 1911-yil-da yozilgan bo ‘ lib, oradan ikki yil o ‘ tgach, ya ’ ni 1913-yilda kitob holida nashr qilinadi. Behbudiy o ‘ zbek adabiyoti tarixida birinchilardan bo ‘ lib dramatik asar yozdi va u Turkiston- ning barcha shaharlarida namoyish etildi. Bu bilan Behbudiy o ‘ zbek teatrining tamal toshini qo ‘ ydi. Dramada jaholat, ilmsizlik, tarbiyasizlikka qarshi ma ’ rifat ulug ‘ lanadi. Muallif « o ‘ qimagan bolaning holi » ni, ayanchli oqibatlarini bayon etishni maqsad qilib oladi. Behbudiy yosh- lar ta ’ lim olishi va kamolga yetishida ijtimoiy va oilaviy muhit alohida o ‘ rin tutishini « Padarkush » dramasi negiziga joylashtiradi. Unda qahramonlardan birining tilidan o ‘ z g ‘ oya- sini: « Bizlarni xonavayron... bevatan va bandi qilg ‘ on tarbi- yasizlik va jaholatdir, bevatanlik, darbadarlik, asorat, faqirlik, zarurat va xorliqlar... hammasi ilmsizlik va betarbiyalikning mevasi va natijasidir... », degan yo ‘ sinda bayon qiladi. Eslab qoling: « padarkush » so ‘ zi lug ‘ aviy jihatdan « ota qotili » degan ma ’ noni anglatadi. Dramada Boy, uning o ‘ g ‘ li Toshmurod, yangi fikrli Domla, ruscha tahsil olgan Ziyoli, boyning mirzasi Xayrullo, boyning qotili bo ‘ lgan Tangriqul va boshqa obrazlar qatnashadi. Dra- maturg ilgari surgan ma ’ rifatparvarlik g ‘ oyasi shu obrazlar- ning o ‘ zaro suhbatlari, bahs-munozaralari jarayonida namoyon bo ‘ ladi. Har bir obraz tabiatiga xos fazilat, xususiyat va qu- surlar ularning gap-so ‘ zlari, xatti-harakati, muallif tomonidan berilgan kichik izohlar yordamida ko ‘ rsatiladi. "
            },
            {
              "id": 3,
              "page": 23,
              "title": "ABDULLA QODIRIY(1894–1938)",
              "desc": "Abdulla Qodiriy adabiy siymosi XX asr o‘zbek adabiyoti tarixida o ‘ ziga xos o ‘ rin tutadi. U o ‘ zbek romanchiligining asoschisi sanaladi. Abdulla Qodiriy 1894-yili 10-aprelda Toshkentda bog ‘ bon oilasida tug ‘ ilgan. Dastlab musulmon maktabida, keyin rus- tuzem maktabi hamda Abulqosim shayx madrasasida ta ’ lim olgan ; Moskvadagi adabiyot kursida o ‘ qigan. 1917-yilgi oktabr oyidagi davlat to ‘ ntarishidan so ‘ ng Eski shahar oziqa qo ‘ mitasining sarkotibi, « Oziq ishlari » gazeta- sining muharriri, « Mushtum » jurnali tashkilotchilaridan biri sifatida ijtimoiy hayotga faol aralashadi. Uning asarlari vaqt- li matbuotda Julqunboy, Ju-boy, Dumbulboy, Dumbulnisa, Kalvak Mahzum, Toshpo ‘ lat tajang, Ovsar kabi o ‘ nlab maxfiy imzolar bilan bosilib turadi. Abdulla Qodiriy 1914-yili Rahbarnisa Rasulmuhammadboy qiziga uylanadi. Ulardan Nazifa (1916), Habibulla (1918), Adiba (1924), Mas ’ ud (1926) hamda Anisa (1928) ismli far- zandlar dunyoga keladi. Abdulla Qodiriy ijodiy faoliyatining boshlanishi 1910-yillar- ning o ‘ rtalariga to ‘ g ‘ ri keladi. Dastlab millatparvarlik, ma ’ ri- fatparvarlik ruhi bilan sug ‘ orilgan « To ‘ y », « Ahvolimiz », « Mil- latimga », « Fikr aylagil » kabi she ’ rlar, « Baxtsiz kuyov » nomli drama hamda « Juvonboz » hikoyasini yozdi. "
            },
            {
              "id": 4,
              "page": 27,
              "title": "O‘TKAN KUNLAR ",
              "desc": "1264 inchi hijriy, dalv oyining o‘n yettinchisi, qishki kunlarning biri, quyosh botgan, tevarakdan shom azoni eshi- tiladir... Darbozasi sharqi-janubiyga qaratib qurilgan bu dongdor saroyni Toshkand, Samarqand va Buxoro savdogarlari egal- laganlar, saroydagi bir-ikki hujrani istisno qilish bilan bosh- qalari musofirlar ila to ‘ la. Saroy ahli kunduzgi ish-kuchlari- dan bo ‘ shab hujralariga qaytganlar, ko ‘ p hujralar kechlik osh pishirish ila mashg ‘ ul, shuning uchun kunduzgiga qaraganda saroy jonliq: kishilarning shaqillashib so ‘ zlashishlari, xoxolab kulishishlari saroyni ko ‘ kka ko ‘ targudek. Saroyning to ‘ rida boshqalarga qaraganda ko ‘ rkamrak bir hujra, anovi hujralarga kiygiz to ‘ shalgani holda bu hujrada qip-qizil gilam, ularda bo ‘ z ko ‘ rpalar ko ‘ rilgan bo ‘ lsa, munda ipak va adras ko ‘ rpalar, narigilarda qora charog ‘ sasiganda, bu hujrada sham ’ yonadir, o ‘ zga hujralarda yengil tabiatlik, serchaqchaq kishilar bo ‘ lganida bu hujraning egasi boshqacha yaratilishda: og ‘ ir tabiatlik, ulug ‘ gavdalik, ko ‘ rkam va oq yuzlik, kelishgan, qora ko ‘ zlik, mutanosib qora qoshlik va endigina murti sabz urgan bir yigit. Bas, bu hujra bino va jihoz yog ‘ idan, ham ega jihatidan diqqatni o ‘ ziga jalb etarlik edi. Qandog ‘ dir bir xayol ichida o ‘ lturguchi bu yigit Tosh- kandning mashhur a ’ yonlaridan bo ‘ lgan Yusufbek hojining o ‘ g ‘ li – Otabek. Saroy darbozasidan ikki kishi kelib kirgach, ulardan birovi darboza yonidagi kimdandir so ‘ radi: – Otabek shu saroyga tushkanmi ? "
            },
            {
              "id": 5,
              "page": 37,
              "title": "Toshkand ustida qonliq bulutlar",
              "desc": "Bu kunlarda Marg‘ilonda shunday xabar chiqib qoldi. « Toshkand hokimi bo ‘ lg ‘ an Azizbek Qo ‘ qong ‘ a qarshi bosh ko ‘ targan. Xon tomonidan xiroj (zakot, soliq) uchun yubo- rilg ‘ an devon beklarini o ‘ ldirgan! » Ikkinchi kun bu xabar tag ‘ i ham boshqacha to ‘ n kiydi: « Musulmonqul Normuham- mad qushbegiga besh ming sipoh qo ‘ shib, Toshkand ustiga jo ‘ natqan! » Bu xabarlar xalq tomonidan juda oddiy, ortiqcha sovuqqon- lik bilan qarshi olindilar. Bu voqeaga hech kim ajabsinmadi va bunda favquloddalik ko ‘ rmadi. Xalq bunga haqli edi, chun- ki bunday tinchsizliklarni endi ko ‘ ra-ko ‘ ra juda ham o ‘ rganib qolgan, bu kun bo ‘ lmasa ertaga o ‘ zining botirboshisining, oftobachisining, xullas, kim bo ‘ lsa ham beklaridan birining shunday tinchsizlik chiqarishiga « mumkin va bo ‘ ladirg ‘ an ish » deb qarar edi. Ammo biz Otabekni bu to ‘ g ‘ rida xalq bilan birgalashtira olmaymiz. Chunki ul bu xabarga sovuqqonlik bilan qaray olmas edi va qaray olmadi. Bu xabarni eshitar ekan, yeb turgani og ‘ zida, yutkani bo ‘ g ‘ zida qoldi: bunday o ‘ zboshimchalik orqasidan o ‘ zining ochiq ko ‘ zi, o ‘ tkir zeh- ni orqalik mudhish, falokatlik manzaralar ko ‘ rar, millatini – xalqini – musulmonini qo ‘ rqunch jar, tegsiz jahannam yo- qasida, yiqilish oldida topar edi-da, seskanib: « O ‘ zing saqla, Tangrim! » – der edi. Bu xabarni eshitkandan so ‘ ng gangib esini yo ‘ qotdi. Yarasi yangilandi: oq bilan qorani ajratolma- gan fuqaroning bir necha g ‘ arazgo ‘ y mustabidlar kayfi yo ‘ lida bir-birisining qoniga tashna bo ‘ lishlari va natijada istiqbolning vahm ko ‘ rinishlari! "
            },
            {
              "id": 6,
              "page": 41,
              "title": "To‘y, qizlar majlisi",
              "desc": "Qutidorning tashqarisiga er mehmonlar, ichkarisiga xo- tin mehmonlar to ‘ lganlar, ular quyuq, suyuq oshlar, holva, nisholdalar bilan izzatlanadirlar. Tashqarida bir qo ‘ sha sozan- dalar dutor, tanbur, g ‘ ijjak, rubob, nay va amsoli sozlar bilan dunyoga jon suvi sepib shaharning mashhur hofizlari ashula aytadirlar. To ‘ y juda ham ruhlik... Ichkarida xotinlar majlisi: onalarcha aytkanda, ular qum- tuproqdek ko ‘ b, biroq majlisning borishida tartib yo ‘ q, havli yuzi va uylar xotinlar bilan to ‘ lgan, qaysi havli yuzida bir tovoq oshni yeb o ‘ lturadir, kim yig ‘ lagan bolasini ovitish bilan ovora, birov yor-yor o ‘ qub, tag ‘ in bittasining quvonchi ichiga sig ‘ may xaxolab dunyoni buzadi, xullas, bag ‘ -bug ‘ yetti qat ko ‘ kdan oshadir... Oftob oyim qayg ‘ uliroq, tusi biroz siniqqansumon... Meh- mon kutib charchaganidanmi, nimadan bo ‘ lsa ham, juda ka- lavlagan, ba ’ zan qiladirgan ishidan ham yanglishib ketkani, masalan, uyga kirmakchi bo ‘ lib tavanxonaga2 kirib qolgani ko ‘ riladir. To ‘ yga kelgan xotinlarning « To ‘ ylar muborak, kuyav o ‘ g ‘ ul muborak! » deb so ‘ rashlariga ham ishonchsiz bir ohangda « Qutlug ‘ bo ‘ lsin », deydir. Oftob oyim donxonaning eshigidan turib xotinlar orasidan kimnidir o ‘ z yoniga chaqirdi. Yoshi ellidan oshgan, kulgusi ichiga to ‘ lib toshgan bir xotinni duvurdan3 chiqib, o ‘ ziga qarab yurganini ko ‘ rgandan keyin donxonaga kirdi. Xotin ham ichkariga kirgach, Oftob oyim eshikni qiya bekladi-da, qayg ‘ ulik bir boqish bilan xotinga qaradi. "
            },
            {
              "id": 7,
              "page": 47,
              "title": "Kutilmagan baxt",
              "desc": "Kumushbibidan vakolat olish ham juda qiyin bo‘ldi. Dom- laning: « Sizkim Kumushbibi Mirzakarim qizi, o ‘ zingizni tosh- kandlik, musulmon Otabek Yusufbek hoji o ‘ g ‘ liga bag ‘ ishla- moq vakolatini amakingiz Muhammadrahim Yo ‘ ldosh o ‘ g ‘ liga topshirdingizmi ? » degan so ‘ rog ‘ i olti, yetti qaytarilgandan ke- yin, shunda ham yangalar qistog ‘ i ostida arang uning rizoligi olindi. Kechki soat beshlarda qutidorning havlisi to ‘ rt ko ‘ z bi- lan kuyav kelishini kutadir. Kuyav uchun palovlar, quyuq- suyuq oshlar, necha turlik ne ’ matlar hozirlanib, bular ham kuyavning intizorida turadirlar. Nihoyat, soat besh yarimlarda kuyav keldi. Yigirma-o ‘ ttiz chog ‘ liq yosh yigitlar – Rahmat- ning o ‘ rtoqlari, ular orasida Otabek – kuyav ko ‘ rindi: boshida simobi shohi salla, ustidan qora movut sirilgan sovsar po ‘ stin, ichida o ‘ zining Shamayda tiktirgani osmoni rang movut kam- zul, movut shim: oyog ‘ ida qalapoy abzali, belida Kumush- bibining usta qo ‘ li bilan tikilgan shohi qiyiq... Yuzlar qizil, og ‘ iz irpaygan, ko ‘ zlar o ‘ ynab allakimni qidiradir. Oshlarini yeb bo ‘ lsalar ham jo ‘ rttaga kuyav ko ‘ rish uchun o ‘ lturgan ma- halla kishilari bir-birlarini turtishib: « Tuzuk-tuzuk, kuyavlikka arzigundek, chaki chakkiga tushmapti, olma-yu anor » deyish- dilar. Tomda kuyav kutib o ‘ lturgan xotinlar ichidan Oftob oyimning egachisi oshiqib singlisi yoniga tushdi-da: « Oftob, darrav isiriq hozirla, kuyavingni yomon ko ‘ zdan o ‘ zi asra- sin! » dedi. Qutidor eshik ostida qo ‘ l qovishtirib mehmonlarni kutib oladir, yer ostidan kuyaviga ko ‘ z qirini tashlab, kishiga sezdirmay o ‘ zicha kulimsirab qo ‘ yadir. Mehmonxona ayvonida oq soqollik, ko ‘ rkam siymo va og ‘ ir tabiatlik domla bilan Ziyo shohichi, Hasanali, qiz vakili va tag ‘ in bir necha kishi- lar o ‘ lturadilar. Yigitlar kuyavni domlalar qarshisiga kelturib to ‘ xtatgandan keyin Otabek vakili bo ‘ lgan Ziyo shohichi bilan Kumush qiz vakili Muhammadrahim oralarida mahr masalasi ochiladir. "
            },
            {
              "id": 8,
              "page": 52,
              "title": "Yusufbek Hoji",
              "desc": "Rayimbek dodxohning yonidagi bizga tanish olabayroq to ‘ nlik kishi Hasanalini ko ‘ rishi hamono: – Ha-a-a, bizning Hasanali-ku! – dedi, – kel, Hasan, ko ‘ ri- shaylik, Otabek esonmi ? Hasanali kelib ko ‘ rishdi, Yusufbek hoji ko ‘ rishar ekan, Azizbekka dedi: – Bu bizning kishimiz, taqsir, Marg ‘ ilondan keladir. Azizbek labini tishlab qoldi. Chunki darboza taqillatib, oti- ni hurkitkan Hasanalini jallodga topshirish niyati, albatta, yo ‘ q emas edi. Yusufbek hojining so ‘ ziga javob bermay yo ‘ lida davom etdi. Hasanali sipohlar orqasidan, Yusufbek hoji Aziz- bek ketidan o ‘ rdaga qarab yurdilar. O ‘ rda darbozasiga yetkan- dan keyin kutib turgan o ‘ rda begi Azizbekning qo ‘ ltig ‘ idan olib otdan tushirdi. Azizbek o ‘ rda ichiga kirmakda ekan, Yusufbek hoji otdan qo ‘ nib so ‘ radi: – Menga ruxsatmi, bek ? Azizbek yo ‘ l ustidan hojiga qaradi: – Ruxsat, ertaga choyni o ‘ rdaga kelib iching. – Yaxshi, taqsir. Yusufbek hoji sipohlardan birining qo ‘ ltiqlashi bilan otiga minib, narida kutib turgan Hasanaliga qarab yurdi. Sipohlar ham o ‘ rda ichiga ot yetaklashib kira boshladilar. Yusufbek hoji Hasanalining vaqtsiz ham Otabekka qay- tishidan tashvishlangan va qanday bo ‘ lsa ham bir falokat yuz berganiga ishongan edi: – Nega vaqtsiz kelding, Otabek sog ‘ mi ? – deb so ‘ radi. Yusufbek hoji Hasanaliga yetmasdanoq bu savolni berdi, Hasanali eshitmadimi yoxud eshitsa ham eshitmaganga solin- dimi, har nechuk javob bermadi. "
            },
            {
              "id": 9,
              "page": 71,
              "title": "HAMID OLIMJON(1909–1944)",
              "desc": "Hamid Olimjon g‘oyat qisqa umr ko‘rgan bo‘lsa ham, XX asr o ‘ zbek adabiyoti tarixida o ‘ zining umrboqiy asarlari bilan o ‘ chmas iz qoldirdi. Shoirning o ‘ n jildlik to ‘ la asarlar to ‘ plamida jam bo ‘ lgan adabiy merosi she ’ riy asarlari bilan birga, ko ‘ plab hikoya va ocherklar, dramalar, publitsistik va adabiy tanqidiy maqolalar hamda tarjimalarni o ‘ z ichiga ol- gan. Bu adabiy merosda shoir she ’ riyatining o ‘ rni alohida. Hamid Olimjon 1909-yil 12-dekabrda Jizzax shahrida tug ‘ ildi. To ‘ rt yoshga yetar-yetmas otasidan yetim qolgan Abdulhamid Azimbobo qo ‘ lida tarbiya topdi. Xat-savodli Azimbobo nevarasida ham o ‘ qish-yozishga havas uyg ‘ otdi. Mashhur xalq shoiri Fozil Yo ‘ ldosh o ‘ g ‘ li ahyon-ahyonda Bu- lung ‘ urdan jizzaxlik do ‘ st-yorlarini yo ‘ qlab kelganida, uning uyida ham to ‘ xtar, shunda Abdulhamid bobosi pinjida o ‘ tirib, ulug ‘ shoirning doston va termalarini jon-u dili bilan tinglar edi. Abdulhamidning onasi Komila aya ham ko ‘ plab ertak va dostonlarni, maqol va matallarni yod bilar edi. Bo ‘ lajak shoir uzun qish kechalarida onasining Oygul bilan Baxtiyor, Tohir va Zuhra, Yoriltosh haqidagi ertaklarini tinglab, bolalik chog ‘ laridanoq xalq og ‘ zaki ijodidan bahramand bo ‘ lib o ‘ sgan. "
            }
          ]
        },
        {
          "classId": 4,
          "classLevel": 7,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "BADIIY SO‘Z QUDRATI",
              "desc": "Ilohiy kitoblarda aytilishicha, so‘z dunyodagi barcha narsalarning asosidir. Rivoyat qiladilarki, Tangri o‘zining qudrati va jamoliga ko‘zgu bo‘ ladigan yaratiq barpo etishni istaydi-yu, kun - larning birida: «Yaral!» (arabchasi «Kun!») – degan so‘zni aytadi. Yaratgan amrining ifodasi bo‘lmish ana shu birgina so‘zning kuchi bilan o‘n sakkiz ming olam va undagi jamiki narsalar dunyoga keldi. Demak, so‘z olam va undagi narsalardan oldin paydo bo‘lgan ekan. So‘zning cheksiz qudratini shundan ham bilsa bo‘ladi. Har qanday inson hayotida juda katta ahamiyat kasb etadigan badiiy adabiyot ana shunday qudratga ega bo‘lgan so‘z bilan ish ko‘radigan san’at turidir. Shuning uchun ham badiiy adabiyot so‘z san’ati deb yuritiladi. Badiiy adabiyot san’atning murakkab va serqirra turi bo‘lib, insonda yuksak ma’naviyatni shakllantirishning eng ta’sirchan vositasidir. Insondagi ismsiz tuyg‘ular, nozik kechinmalar, ko‘z bilan ko‘rib, quloq bilan eshitib, qo‘l bilan ushlab, til bilan totinib, burun bilan iskab bo‘lmaydigan 4 ruhiy holat jilvalarini faqat so‘z yordamida ifoda etish mumkin. Badiiy adabiyot san’atning boshqa turlaridan asosiy ish quroli va materiali so‘z ekanligi bilan ajralib turadi."
            },
            {
              "id": 2,
              "page": 14,
              "title": "Hamza Hakimzoda Niyoziy (1889 –1929)",
              "desc": "amza 1889-yilning 6-martida Qo‘qon shahrida tug‘il gan. Otasi, o‘zining ta’biri bilan aytganda, «Buхoroga borib хalq do‘qtiri bo‘lib qaytgan»- ligi uchun shoir nomiga tabibning o‘g‘li ma’- nosida Hakimzoda qo‘shib aytiladi. Niyoziy shoirning adabiy taхallusi. Hamza o‘z tarjimayi holida o‘n yoshida «o‘zbekcha, forschaga tom savodli» bo‘lganli gini yodga oladi. Ya’ni bu ikki tilda o‘qib, yozib, fi krlay olish iqtidoriga ega bo‘lgan. Shu boisdan bo‘lsa kerak, Hamza o‘n yoshidan Qo‘qondagi madrasalardan birida o‘qiy boshlaydi. 1908-yilda Namangan ga borib, tahsilni davom ettiradi. U yerda Abdulla To‘q mullin degan tatar ma’rifatchisi bilan tanishadi. Shoir tarjimayi holida eslashicha, o‘n yoshlaridan she’r mashq qila boshlagan. To‘qmullin Ham za ning yuz sahifadan ortiqroq hajmdagi ijod namunalarini ko‘rib, unga har jihatdan yordam va maslahat beradi. Namanganda Hamza ning ta shabbusi bilan arab tili kursi ochiladi. Unda o‘n olti kishi ta’lim oladi. Iqtidorli Hamza uch oy ichida bu tilni ma’lum darajada o‘zlashtirib, otasiga arabcha хatlar yoza boshlaydi."
            },
            {
              "id": 3,
              "page": 20,
              "title": "ADАBIYОT – TАRBIYА VОSITАSI",
              "desc": "Аziz o‘quvchi! Siz аstа-sekin bаdiiy аdаbiyot sirlаridаn xabardor bo‘lib, uning хаzinаsidаgi nоdir аsаrlаr bilаn tаnishib bоrmоqdаsiz. Bаdiiy аdаbiyot аrаbchа «аdаb» so‘zi dаn оlingаn bo‘lib, hаyotiy vоqеа-hоdisаlаr, in sоn turmushi, uning хаtti-hаrаkаti, o‘y-fi krlаri, his-tuy g‘ulа rini bаdiiy so‘z vоsitаsidа аks ettiruvchi sаn’аt ekаnligini bilib oldingiz. Hаyotdа bаdiiy аsаr o‘qimаydigаn оdаmlаr kаm bo‘lаdi. Bаdiiy аdаbiyot vаqtni mаzmunli o‘tkаzish, ko‘ngil оchish uchun o‘qilmаydi. Uning аhаmiyati bundаn ko‘rа аnchа katta, vаzifаsi esa sаlmоqli. Bаdiiy аdаbiyot оlаmni vа оdаmni аnglаshning o‘zigа хоs shаklidir. U оrqаli siz insоn hаyotining mаzmuni, mоhiyati, dunyo vоqеliklаri vа hаqiqаtini аnglаb bоrаsiz. Kishi аsl аdаbiyot nаmunаlаrini izchil o‘qib, uqib bоrаr ekаn, o‘zining bоshqа insоnlаr bilаn, o‘rаb turgаn butun bоrliq – tаbiаt vа bulаrning bаrchаsining ijоdkоri bo‘lmish Yarаt gаn bilаn аlоqаsi, munоsаbаtini tushunа bоrаdi."
            },
            {
              "id": 3,
              "page": 22,
              "title": "Sаidа Zunnunоvа (1926 –1977)",
              "desc": "Nоdirа, Uvаysiy, Zulfi yахоnimlаr izdоshi bo‘lgаn, o‘tgаn аsr o‘rtаlаridа o‘zining sаmimiy shе’r lаri, mаzmunli hikоyа vа qissаlаri, bеtаkrоr dоstоnlаri bilаn аdаbiy jаmоаtchilik nаzаrigа tushgаn Sаidа Zunnunоvа o‘zbеk аdаbiyоtidа o‘zigа хоs o‘rnigа egа bo‘lgаn ijоdkоrdir. U аsаrlаridа o‘zbеk qizlаrining tоrtinchоq, hаyо to‘lа tabiatini, аyоllarimizning аndishаgа o‘rаlgаn qiyоfаsini, оnаlаrning chеksiz mеhri vа uning o‘zigа o‘хshаsh аyоllаrgаginа хоs bo‘lgаn mаtоnаtni, sаdоqаtni tаrаnnum etdi. Sаidа Zunnunоvа 1926-yil 15-fevralda Аndijоn shаhridа хizmаtchi оilаsidа dunyоgа kеldi. Otаdаn ertа yеtim qоlgаn shоirа оnаsi vа qаrindоshlаri qo‘lidа ulg‘аydi, kаmоl tоpdi. Аndijоn shаhridаgi 30-mаktаbni tugаtgаch, 1941-yildа Аndijоn o‘qi tuvchilаr insti tutigа o‘qishgа kirib, uni 1943-yildа tаmоm lаdi. Birmunchа muddаt mаktаbdа muаllim lik qildi, vilоyаt gа zеtаsi tahririyatidа ishlаdi. Аdаbiyоtgа muhаbbаt uni O‘rtа Osiyо dаvlаt univеrsitеti (hоzirgi O‘zbеkistоn Milliy univеrsitеti)ning fi lоlоgiyа fаkultеtigа yеtаklаdi, bu yerdа 1947–1952-yillаrdа tаhsil Sаidа Zunnunоvа (1926 –1977) 23 оldi. Oliy o‘quv yurtini tаmоm lаgаch, qizg‘in jurnаlistik fаоliyаtgа sho‘ng‘idi vа bа diiy ijоdgа butun bоrlig‘i bilаn bеrildi. «Gulхаn» jurnа li, «O‘zbеkistоn mаdаniyаti» gаzеtаsidа аdаbiy хоdim, bаdiiy аdаbiyоt nаshriyоtidа muhаrrir hаmdа O‘zbеkistоn Yоzuvchilаr uyush mаsidа аdаbiy mаslаhаtchi bo‘lib ishlаdi."
            },
            {
              "id": 4,
              "page": 29,
              "title": "Shuhrat (1918 –1993)",
              "desc": "Asli ot-u nаsаbi G‘ulom Aminjon o‘g‘li Alimov bo‘lgаn shoir Shuhrаt 1918-yilning 19-аprelidа Toshkent shаhrining Hаstimom (Hazrati Imom) mаhаllаsidа tug‘ilgаn. Bo‘lаjаk ijodkor oldin mаhаllаdаgi otinoyi mаktаbidа, keyin sho‘ro mаktаbidа o‘qigan. Adаbiyot o‘qituvchisi Yunus Lаtifning tа’siridа bаdiiy аdаbiyotgа mehr qo‘yib, she’rlаr yozа boshlаgan. U 1932–1933-yillаrdа trаnsport teхnikumidа, 1934 – 1936-yillаrdа O‘rtа Osiyo trаnsport injenerlаri insti tutidа tаhsil ko‘rаdi. 1936 –1940-yillаrdа Toshkent dаvlаt pedаgogikа ins tituti (hozirgi Toshkent dаvlаt pedаgogikа universiteti)dа tа’lim olаdi. Shuhrаtning birinchi she’ri 1935-yildа 17 yoshidа e’lon qilindi. Kаsbigа ko‘rа trаnsport injeneri bo‘lishigа qаrаmаy, аdаbiyotgа qiziqishi kаttа bo‘lgаnligi sаbаbli Yo zuv chilаr uyushmаsigа ishgа kirdi. Bu yerdа yosh ijodkorning yozuvchishoirlаrgа, аdаbiy muhitgа yaqin bo‘lish istаgi аmаlgа oshdi. U 1930-yillаrning ikkinchi yarmidаn e’tiboran bitgаn she’rlаridа Shuhrat (1918 –1993) 30 «Shuhrаt» tахаllusini qo‘llаy boshlаdi. O‘shа yillаrdа Shuhrаtning «Orzu vа qаsos» dostoni, «Mehrol» nomli ertаkdostoni chop etildi vа o‘quvchilаrning e’tiborini tortdi"
            },
            {
              "id": 5,
              "page": 39,
              "title": "Rasul Hamzatov (1923–2003)",
              "desc": "XX-asr jahon she’riyatining yirik vakili Rasul Hamzatov 1923-yilning 8-sentabrida tu g‘ildi. O‘n uch-o‘n to‘rt yoshlaridan she’rlar yoza boshlagan. Rasul Hamzatov mustaqil hayotga barcha tog‘lik yigitlar singari erta qadam qo‘ydi. O‘n sakkiz yoshidan o‘qituvchi, artist va muxbir sifatida turli jabhalarda mehnat qildi. Shu jarayonda ona xalqining turmush tarzi va o‘ziga xos ruhiy dunyosi bilan yaqindan tanishib bordi. Otasi – Dog‘istonning mashhur shoiri Hamzat Sadasa uni ijodga jiddiy qarashga, hamisha haqiqatni ta’sirchan yo‘sinda kuylashga o‘rgatdi. Uning birinchi kitobi 1943-yilda chop etildi. 1945-yilda Moskvadagi Adabiyot institutida tahsil olishga kirishdi. Rasul Hamzatov (1923–2003) 40 Iste’dodli shoirning dastlabki yozganlariyoq she’riyat shinavandalarining sevimli asarlariga aylandi. Deyarli barcha asarlari yozilishi bilan rus tiliga o‘girila boshlandi. Rus tili orqali jahonning turli tillariga tarjima qilindi. Jahonga taniqli shoir 2003-yilning 3-noyabrida dunyo dan o‘tdi. R.Hamzatovning «Tog‘ qo‘shig‘i», «Mening qalbim tog‘ larda», «Tog‘ qizi», «Dog‘istonim», «Yuksak yulduzlar», «Tug‘ilgan kunim», «Tog‘likning vatani», «Ovuldan xat» singa ri o‘nlab she’riy kitoblari, qator poemalari shoirning nomini jahon she’riyatining eng ilg‘or vakillari qatoriga olib chiqdi. Uning she’rlari o‘z xalqining milliy odatlarini juda yor qin aks ettirishi bilan, bo‘ysunmas, erksevar tog‘ xalqiga xos ruhiy holatlarni haqqoniy tasvirlashi bilan diqqatga sazovordir."
            },
            {
              "id": 6,
              "page": 18,
              "title": "Аsqаd Muхtоr (1920 –1997)",
              "desc": "Asqаd Muхtоr shоir, nоsir, drаmаturg, tаrjimоn, jurnаlist hаmdа jоn kuyаr tаshkilоtchi sifаtidа o‘zbеk аdа bi yоti vа sаn’аtidа yоrqin iz qоldirgаn siymоdir. Аdib 1920-yil ning 23-dеkаbridа Fаrg‘оnа shаh ridа tug‘ildi. Аsqad Muxtorning оilаsi аsli Tаtаristоndаn kеlgаn bo‘lib, fаrg‘оnаlik lаr оrаsigа singishib kеtgаn, o‘zbеkchа urf-оdаtlаrni to‘lа o‘zlаsh tir gаn edi. 1931-yildа bo‘lаjаk аdib o‘n bir yоshdaligida оtаsi vаfоt etаdi. Nоtinch zаmоn dа mоddiy jihаtdаn nоchоr оilа o‘n ikki bоlаning uchinchisi bo‘lmish Аsqаdni yеtimхоnаgа tоpshi rishgа mаjbur bo‘lаdi. U shu yеrdаgi mаktаbni bitirdi vа 1936-yili Tоshkеntgа kеlib, jurnаlistikа kursidа o‘qidi, gаzеtаdа ishlаdi. Аsqаd Muxtor 1938-yili Sаmаr qаnd dаgi O‘zbеkistоn dаvlаt dоrilfununigа kirаdi. Ikkinchi jаhоn urushi bоshlаngаch, Sаmаrqаnd dоrilfununi Tоshkеnt - dаgi O‘rtа Osiyо dаvlаt universitetigа vаqtinchа qo‘shib yubоrilаdi. Shu tаriqа o‘qishni Sаmаrqаnddа bоshlаgаn Аsqаd Muхtоr fi lоlоgiyа fаkultеtini Tоshkеntdа tаmоmlаydi. Uni Аndi - jоngа ishgа yubоrаdilаr. Uch yil dаvоmidа Аndijоn dаvlаt pеdаgоgikа institutidа o‘zbеk аdаbiyоti kаfеdrаsi mudiri bo‘lib ishlаydi."
            }
          ]
        }
      ]
    },
    {
      "bookId": 4,
      "status": "tavsiya",
      "bookName":"Informatika",
      "bookImage": "assets/svg_icon/img.png",
      "classes": [
        {
          "classId": 1,
          "classLevel": 5,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "MUALLIFLARDAN Aziz o‘quvchi! Qo‘lingizdagi yangi avlod darsligi bilim xazinangizni yanada boyitish yo‘lida Sizning eng yaqin hamrohingiz bo‘lishiga ishonamiz. Ma’lumki, zamonaviy ilmiy texnika va axborot texnologiyalari rivojlanishi bilan birga sifatli bilim olish va o‘qitish uslublari ham har tomonlama o‘zgarib bormoqda. Shu jarayonlar natijasida, hukumatimiz har tomonlama oqil, bilimdon, ishbilarmon kelajak yoshlarining o‘sib-ulg‘ayishini ko‘zlamoqda. Buning uchun ta’lim yo‘nalishida jahon standartlariga javob bera oladigan yangi qonun va loyihalar ustida ish olib bormoqda. Aziz o‘quvchi! Siz buyuk kelajakni yaratuvchi, yangi texnologiyalarni hayotga tatbiq etuvchi va koinotni zabt etuvchi shaxssiz. Shuni bilingki, bilim, ko‘nikma va layoqatlarsiz bu maqsadlarga erishib bo‘lmaydi. Ushbu darslik Sizning orzu-niyatlaringiz ro‘yobga chiqishida poydevor vazifasini bajaradi. Hayotimizning ajralmas qismi hisoblanuvchi axborot texnologiyalari, xususan, yangi avlod kompyuterlarida ishlash ko‘nikmasini hosil qilishingizda birinchi qadam bo‘ladi, degan umiddamiz. BU MEHNATTALAB HAMDA QIZIQARLI JARAYONDA SIZGA ULKAN ZAFARLAR TILAB QOLAMIZ!"
            },
            {
              "id": 2,
              "page": 5,
              "title": "KOMPYUTER XONASIDA XAVFSIZLIK TEXNIKASI QOIDALARI VA SANITARIYAGIGIYENA TALABLARI",
              "desc": "Informatika va axborot texnologiyalari” fanini o‘rganish maqsadida maktablarda maxsus kompyuter xonalari tashkil etilgan. Hammaga ma’lumki, barcha elektr asboblari kabi kompyuter ham inson hayoti uchun xavfli bo‘lgan elektr toki yordamida ishlaydi. Bunday qurilmalardan foydalanishda ehtiyot choralarini bilish talab etiladi. O‘quvchi kompyuter xonasidagi tartib-intizom qoidalarini bilmasligi oqibatida, ko‘plab noxush holat va xavfli vaziyatlar yuzaga kelishi mumkin. Natijada, u nafaqat o‘ziga, balki: • atrofdagilar sog‘lig‘iga; • qimmatbaho texnik qurilmalarga zarar yetishiga; • shuningdek, kompyuter xotirasidagi muhim ma’lumotlarning o‘chib ketishiga sababchi bo‘lishi mumkin. HAMMA BILISHI ZARUR BO‘LGAN OLTIN QOIDALAR!Kompyuter xonasiga faqat o‘qituvchining ruxsati bilan kirish. Harakatlanish uchun noqulay, qo‘pol kiyimlar bilan kirmaslik. Kompyuterga faqat o‘qituvchining ruxsati bilan o‘tirish. Kompyuterda faqat o‘qituvchi bergan vazifani bajarish. Kompyuterni sozlash ishlarini o‘zbilarmonlik bilan olib bormaslik. Kompyuter yoqilgan holatida sim, rozetka va ulagichlarga tegmaslik. Kompyuter yaqinida boshqa elektr asboblaridan foydalanmaslik. Kompyuter xonasida tez alangalanuvchi buyum va suyuqliklarni ishlatmaslik. Kompyuter xonasiga ovqat va salqin ichimlik olib kirmaslik. Favqulotda vaziyatlarda tezda o‘qituvchiga xabar berishlik.  KOMPYUTER XONASIDA SANITARIYA–GIGIYENA TALABLARI Inson kompyuterda uzluksiz ishlashi natijasida, o‘zi bilmagan holda, tanasiga shikast yetkazib olishi mumkin. Bunga ish o‘rnida noto‘g‘ri o‘tirish, uzoq vaqt monitorga tikilish, natijada ko‘zlarni zo‘riqtirish sabab bo‘ladi. Agar o‘quvchi sanitariya va gigiyena talablariga og‘ishmay rioya qilsa, shikastlarning oldini olishi, bebaho sog‘lig‘ini butun umri davomida saqlab qolishi mumkin. Eng muhimi, kompyuter oldida to‘g‘ri o‘tirish zarur."
            },
            {
              "id": 3,
              "page": 9,
              "title":"INFORMATIKA FANI HAQIDA",
              "desc": "Informatikaga fan sifatida XX asrning 50-yillarida Fransiyada asos solingan. “Informatika” atamasi fransuzcha informatique va avtomatique so‘zlaridan tashkil topgan. Bu davrda Amerika va Janubiy Yevropa mamlakatlariga inson imkoniyatlaridan bir necha pog‘ona yuqori turgan, axborotni katta tezlikda qayta ishlay oladigan elektron hisoblash mashinalari (EHM) kirib kelgan va inson kundalik faoliyatining ajralmas qismiga aylangan. Yevropa mamlakatlarida bu fan “informatics” sifatida taqdim etilgan. Amerikada u “computer science”, ya’ni kompyuter ilmi nomi bilan mashhur bo‘lgan. XX asrning 70–80-yillariga kelib kompyuter ilmi faqat olimlarni emas, balki butun jahon jamoatchiligini qamrab oldi. Ishlab chiqarish korxonalari hamda jamiyat hayotining turli sohalarida faol qo‘llanila boshlandi. Chunki bu davrda rivojlanish murakkab bosqichga yetdi. Yig‘ilib qolgan ulkan hajmdagi axborotni saqlash, qayta ishlash, uzatish va tezkorlik bilan almashishda jiddiy muammolar yuzaga keldi. O‘z davri ilm-u fanining yangi yo‘nalishi sanalgan “kompyuter ilmi” bu muammollarni o‘rgandi, ularni zamonaviy kompyuter va aloqa texnologiyalari yordamida yechish imkoniyatini yaratdi"},
            {   "id": 4,
              "page": 13,
              "title":"AXBOROT VA RAQAMLI TEXNOLOGIYALAR",
              "desc": "Informatika fanining asosiy ashyosi axborot ekan, demak, uni yanada mukammal o‘rganishimiz hamda “Axborot nima?”, “Inson axborotni qanday qabul qiladi?”, “Axborotning qanday turlari mavjud?”, “Axborot ustida qanday amallar bajarish mumkin?” degan savollarga javob topishimiz zarur. 3-dars. AXBOROT VA RAQAMLI TEXNOLOGIYALAR Olimlarning fikriga ko‘ra, insoniyat 40 ming yildan ziyod vaqtdan beri hayot kechirib, shu vaqt davomida doimiy ravishda sezgi organlari orqali atrof-muhitdan turli ma’lumotlarni qabul qilib kelgan. Jamiyat paydo bo‘lgandan keyin esa odamlar muloqot jarayonida axborot almashinib, uni saqlashga urinishgan. Axborot saqlashning eng qadimiy usullari haqida arxeologlar tomonidan topilgan rasm, belgilar, qadimgi qo‘lyozmalar orqali bilish mumkin. Biz yashab turgan olamni endi televizor, smartfon, internet, kompyuterlarsiz tasavvur etish qiyin. Axir olimlar XXI asrni axborot texnologiyalari asri, deb bejiz aytishmagan. Chunki bu texnologiyalar jamiyatimizdagi asosiy masalalarni yechishda muhim ahamiyat kasb etadi va bu jarayonga axborotli jarayon deyiladi. O‘tgan yuz yillikdan farqli ravishda, hozirgi kunda axborot ustida katta tezlikda izlash, to‘plash, saqlash, qayta ishlash, uzatish, nusxa olish, bloklash, uni maxfiylashtirish, chop etish kabi amallarni bajarish mumkin. Albatta, bunday amallar kompyuterda qayta ishlanadi, raqamli ko‘rinishga o‘tkaziladi va maxsus formatlarda saqlanadi.  "
            },
            {              "id": 5,
              "page": 17,
              "title":". AXBOROTNI KODLASH. AXBOROT O‘LCHOV BIRLIKLARI ",
              "desc": "Biz atrof-muhitdan axborotni qabul qilar ekanmiz, ular bizga nur, tovush, hid kabilar sifatida yetib kelishi mumkin. Yoki boshqacha ko‘rinishlarda: so‘z, belgi, qo‘l harakatlari, imo-ishora bo‘lishi mumkin. Yo‘l harakati qoidalari rasm va shakllarda ifodalansa-da, biz ular orqali qanday harakat qilish kerakligini anglab yetamiz. Qo‘l harakatlari orqali esa eshitib bo‘lmaydigan axborotni so‘zsiz tushunib olamiz. Yuz ifodalari orqali suhbatdoshimizning kayfiyatini, ichki kechinmalarini bilib olishimiz mumkin. Eng buyuk va mashhur musiqiy asarlar 7 ta tovush (nota)ning genial ketmaketligidan vujudga keladi. Yo‘l harakati qoidalari rasm va shakllarda ifodalansa-da, biz ular orqali qanday harakat qilish kerakligini anglab yetamiz. Qo‘l harakatlari orqali esa eshitib bo‘lmaydigan axborotni so‘zsiz tushunib olamiz. Yuz ifodalari orqali suhbatdoshimizning kayfiyatini, ichki kechinmalarini bilib olishimiz mumkin. Eng buyuk va mashhur musiqiy asarlar 7 ta tovush (nota)ning genial ketmaketligidan vujudga keladi. XIX asrning boshlanishida Massachusets shtatidan bo‘lgan amerikalik rassom Samuel Finli Briz Morze telegraf yordamida uzoq masofalarga ma’lumot uzatish usulini o‘ylab topgan. Bu usul maxsus alifbodan tashkil topgan bo‘lib, unda harflarni ifodalash uchun nuqta (·) va tire (–) belgilarining turli kombinatsiyalari xizmat qilgan. Nuqta qisqa, tire esa uzun signal (tovush)ni bildirgan. "
            },
            {              "id": 6,
              "page": 23,
              "title": "AMALIY MASHG‘ULOT ",
              "desc": "Kompyuterda axborotning ikkilik kodlash orqali saqlanish usullari bilan avvalgi darslarda tanishib o‘tdik. Ikkita raqam (2 holat) orqali cheksiz belgi va sonlarni kodlash mumkinligi va ular shu raqamlarning kombinatsiya soniga bog‘liq ekanligini misollardan tushunib oldik. Informatikada bu usul kombinatorika deb ataladi. Uning qo‘llanilishini hozirgi kunda turli sohalarda: ishlab chiqarilayotgan mahsulot, texnik vosita va texnologiyalarda uchratish mumkin. Kompyuter va smartfonlarning klaviaturasida joylashgan belgi, son va harflar, boshqarish tugmachalarining ikkilik kodi bunga misol bo‘la oladi. Bunday kombinatorik amallar yana qayerlarda ishlatilishi mumkin? Buni misollarda ko‘rib chiqamiz. "
            },
            {              "id": 7,
              "page": 24,
              "title": "KOMPYUTER VA UNING TUZILISHI",
              "desc": "Kompyuter — XX asrning eng buyuk kashfiyotlaridan biri. Uning yaratilish tarixi bir necha bosqichdan iborat bo‘lib, davr sinovidan o‘tgan eng yangi avlodi hozirgi kunda inson faoliyatining deyarli barcha sohalarida qo‘llanilib kelmoqda. Kompyuter ingl. computer — hisoblagich so‘zidan olingan bo‘lib, hisob-kitobni amalga oshiruvchi qurilma ma’nosini bildiradi. Dastlab yaratilgan kompyuter, asosan, murakkab hisob-kitoblarni amalga oshirish uchun mo‘ljallangan. Keyinchalik kompyuterda matn, rasm, tovush, video kabi ma’lumotlarni saqlash, ularni qayta ishlash, uzatish kabi ishlarni bajarish imkoniyatlari yaratilgan. Kompyuterning turlari xilma-xil bo‘lib, ular nafaqat o‘lchamlari, balki ma’lum bir imkoniyat va vazifalari bilan ham bir-biridan farq qiladi. Bugungi kunda dastlab yaratilgan kompyuterlar davriga nisbatan ishlab chiqarish texnologiyalari keskin o‘zgarib, takomillashib bormoqda. Kompyuterlarga bo‘lgan ehtiyojning kundan-kunga oshishi esa kompyuter ishlab chiqaruvchi yangi kompaniyalarning paydo bo‘lishiga sabab bo‘lmoqda. Hozirda jahon bozorlarida kompyuter texnikasining 100 dan ortiq modeli sotuvga chiqarilgan bo‘lib, kompyuter savdosi biznes olamidagi serdaromad manbalardan biri hisoblanadi. Kompyuterlar, eng avvalo, o‘lcham hamda ishni bajarish imkoniyatlari bilan bir-biridan farq qiladi. Shuningdek, nima maqsadda qo‘llanilishiga ko‘ra, dasturiy ta’minoti, texnik vosita va qo‘shimcha qurilmalari bilan ham bir-biridan ajralib turadi. Zamonaviy kompyuterlar: Desktop — shaxsiy (personal) kompyuter; • Monoblok — monitor va tizim bloki birlashtirilgan ixcham kompyuter; • Laptop — noutbuk (notebook) – bloknot tipidagi shaxsiy kompyuter; • Tablet — planshetli shaxsiy kompyuter; • Nettop — ixcham qutida joylashgan va Internet ilovalari bilan ishlashga mo‘ljallangan kompyuter; • Palmtop — cho‘ntak kompyuteri, organayzerlarga bo‘linadi"
            },
            {              "id": 8,
              "page": 28,
              "title": "KOMPYUTERNING QO‘SHIMCHA QURILMALARI",
              "desc": "Hozirgi kunda biror ish yurituvchini yoki korxona ish faoliyatini printer, skaner, faks, modem (router), veb-kamera, ovoz kuchaytirgich, quloqchin kabi vositalarsiz tasavvur qilib bo‘lmaydi. Albatta, siz ular haqida eshitgansiz va ulardan foydalanib kelmoqdasiz. Bu qurilma va vositalar kompyuterning asosiy qurilmalari hisoblanmasa-da, insonlarning kundalik hayotida ularga ehtiyoj juda katta. Kompyuterning tashqi qurilmalari yordamchi qurilmalar deb ham yuritiladi. Ularni vazifalariga ko‘ra: 1) ma’lumotlarni kiritish qurilmalari; 2) ma’lumotlarni kompyuterdan chiqarish qurilmalari; 3) ma’lumotni ham uzatish, ham qabul qilish qurilmalariga ajratish mumkin. Kompyuterlar qo‘shimcha qurilmalarsiz ham ishlay oladi, ammo ularsiz axborotni izlash, qayta ishlash, tashqi xotirada saqlash, uni chop etish yoki uzatish amallarini bajarib bo‘lmaydi. Qo‘shimcha qurilmalar orasidan eng ko‘p foydalaniladigan, yaratilgan hujjatlarni chop etishda beqiyos imkoniyatlarga ega qurilma bu — printer. "
            },
            {   "id": 9,
              "page": 32,
              "title": "KLAVIATURA VA SICHQONCHA BILAN ISHLASH KO‘NIKMALARI",
              "desc": "Klaviatura tashqi qurilma hisoblansa-da, foydalanuvchi bilan kompyuter o‘rtasida muloqot o‘rnatishga mo‘ljallangan asosiy qurilmalardan biri hisoblanadi. 1. Alifbo-raqamli tugmachalar lotin, kirill harflari yoki arab raqamlari ko‘rsatilgan tugmachalar guruhidan iborat. Raqamlar: 0 1 2 3 4 5 6 7 8 9 . E’tibor bergan bo‘lsangiz, smartfon va planshet ekrandagi joriy holatni rasmga olish, ya’ni undan nusxa ko‘chirish va uni rasm formatida ularning ichki xotirasida saqlab qo‘yish xizmati mavjud. BUNI BILASIZMI? Print Screen SysRq Bunday xizmat turi kompyuterlarda ham yo‘lga qo‘yilgan. Funksional tugmachalar qatorida joylashgan PrtSc/SysRq (Print Screen) tugmachasini bir soniya bosish orqali ekrandagi joriy tasvir nusxasini xotiraga (buferga) saqlab qo‘yish va uni ixtiyoriy hujjatga yoki qayta ishlash uchun biror grafik muharrirga joylashtirish mumkin. Dastlab sichqonchaning oddiy sharsimon g‘ildirakchali turi ishlatilgan. Keyingi avlod sichqonchalari klaviaturalar kabi simli va simsiz turlarga bo‘linadi. Sichqonchalarning 2 ta — optik va lazerli turlari ommalashgan. "
            },
            {            "id": 10,
              "page": 36,
              "title": " KLAVIATURA TRENAJYORLARI VA “YUMUQ KO‘ZLAR USULIDA MATN TERISH ",
              "desc": " Matnni tez va xatosiz yozish yozuv ixtiro qilingan davrdan boshlab barcha zamonlarda savodxonlik muammosi bo‘lib kelgan. Kompyuterlar davriga kelib esa bunga bo‘lgan talab yanada kuchaydi. Mashqlarni mustaqil bajarish maqsadida ko‘plab kompyuter dasturlari yaratilgan. Ular klaviatura trenajyorlari deb ataladi. Quyida klaviatura trenajyorlari bilan tanishib chiqamiz: 1. To‘liq bepul trenajyor dasturlari: • Klavtren, StarBoom; • Ak, Stamina; • My simula. 2. Windows uchun sinovdan o‘tgan dasturlar: • Typing Master; • Соло на клавиатуре. 3. OnLine trenajyorlar va musobaqalar: • https://solo.nabiraem.ru - • http://urikor.net — kirill alifbosi bo‘yicha chempionat • http://typingzone.com • http://klava.org/ • http://typeracer.com — ingliz tilida yozish • http://typeracer.com — ingliz tili bo‘yicha onlayn musobaqa • (http://klavogonki.ru) – matn terish bo‘yicha onlayn musobaqa. “Yumuq ko‘zlar” yoki “Tezkor terish” darajasiga qanday erishish mumkin? Tez harf terishni o‘rganish uchun maxsus trenajyorlardan boshqa ham ko‘plab usullar mavjud. Bunday usullardan biri “Yumuq ko‘zlar” holatida klaviaturada ishlashdir. Bu usul “10 ta barmoq” usuli deb ham yuritiladi va u foydalanuvchidan sabr va mashaqqatli mehnatni talab etadi. Bu usulda klaviaturaga nazar solmasdan barmoqlarni ishlatishni, ko‘zlar esa faqat monitordagi matnni kuzatib borishni tushunishimiz kerak. Bu mashqlar yordamida 1 daqiqada 150–200 tagacha belgini terish ko‘nikmasini hosil qilish mumkin. "
            }
          ]
        },
        {
          "classId": 2,
          "classLevel": 6,
          "mundarija": [
            {
              "id": 1,
              "page": 4,
              "title": "Kirish",
              "desc": "Aziz o‘quvchilar! Ma’lumki, har bir inson moddiy ne’matlar (oziqovqat, kiyim-kechak, uy anjomlari va hokazo) bilan birga ular haqidagi axborotlar (qanday maqsadda ishlatilishi, shakli, rangi, og‘irligi va hokazolar)ni bilishi ham zarurdir. Siz qo‘lingiz orqali jismning qattiq va tekisligini, tilingiz orqali oziq ta’mini, burun orqali turli hidlarni aniqlaysiz, qulog‘ingiz orqali har xil tovushlarni eshitasiz, ko‘zingiz orqali turli shakllarni, ranglarni yoki manzaralarni ko‘rasiz, ya’ni sezgi o‘rganlaringiz orqali har xil axborotlarni olasiz. Demak, axborotni hayotdan turli ko‘rinishlarda yoki shakllarda olish mumkin ekan: rasm, chizma, fotosurat, yozuv; nur yoki tovushlar; har xil to‘lqinlar; elektr va nerv impulslari; magnit yozuvlari; mimika; hid va ta’m; organizmlardagi hujayralar yadrolarining tarkibi haqidagi axborotlarni saqlovchi xromosomalar va hokazo. Axborotning rasm yoki chizma ko‘rinishi bilan 5-sinfda tanishdingiz. Unda siz rasm yoki chizma chizdingiz, xatolarini tuzatdingiz, saqlab qo‘ydingiz, rasmlarni bo‘laklarga ajratdingiz yoki rasmlarni birlashtirib yangi rasm hosil qildingiz, bir so‘z bilan aytganda rasm yoki chizma ko‘rinishidagi axborotlarni qayta ishladingiz. Siz endi «Informatika» darsida yozuv (matn) ko‘rinishidagi axborotlarni kompyuterda qayta ishlashni o‘rganasiz. "
            },
            {       "id": 2,
              "page": 5,
              "title": "MATN MUHARRIRLARI",
              "desc": "Tarixdan ma’lumki, axborotlarni saqlashning eng qadimiy usullaridan biri yozuv hisoblanadi. Qadimgi odamlar yashagan g‘orlar devorlaridagi rasm va yozuvlar buning yaqqol isbotidir. Yozuv san’ati asrlar davomida deyarli o‘zgarmadi. Faqatgina yozish vositalari takomillashib bordi. Avval toshlarga o‘yib yozilgan bo‘lsa, keyinchalik bo‘yoqlar yordamida yoziladigan bo‘ldi. Hayvon terilariga ishlov berish natijasida toshlar o‘rniga teriga yozila boshlandi. Qog‘oz ixtiro qilinishi bilan yozish yana ham qulaylashdi. Shu bilan birga yozuv quroli ham takomillashib bordi. Qadimda yozish vositasi sifatida toshlar, turli mo‘yqalam, qamish-perolar va g‘oz patlaridan foydalanilgan. Keyinchalik patlar o‘rniga peroli ruchkalar, avtoruchkalar va sharikli ruchkalar hamda yozuv mashinkalari ishlatila boshlandi. Lekin, agar, matnni o‘zgartirish kerak bo‘lsa, uni baribir qayta ko‘chirib yozishga to‘g‘ri kelardi. Bu juda ko‘p vaqt va mehnat talab qilishini siz yaxshi bilasiz. Kompyuterlar ishlab chiqilishi va rivojlanishi yozuv san’atini tubdan o‘zgartirib yubordi. Matnlarni yozish, saqlash, qayta ishlash, qog‘ozga chop etish kabi ishlarni bajarishga mo‘ljallangan ko‘plab dasturlar ishlab chiqildi. Bu dasturlar, asosan, ikki turga bo‘linadi: matn muharrirlari va matn protsessorlari. "
            },
            {        "id": 3,
              "page": 9,
              "title": "MS WORD MATN PROTSESSORI ",
              "desc": "MATN PROTSESSORLARI HAQIDA Matn protsessorlari matnning faqat mazmuni emas, balki tashqi ko‘rinishi ham katta ahamiyatga ega bo‘lganda qo‘llaniladi. Masalan, matnga turli rasm va jadvallarni joylashtirish, belgilarning o‘lchami, rangi va ko‘rinishlarini o‘zgartirish va hokazo. Matn protsessorlari, odatda, rasmiy hujjatlarni tayyorlashda ko‘p qo‘llaniladi. Matn protsessori yordamida tayyorlangan matn hujjat deb yuritiladi. Matn protsessori yordamida hosil qilingan hujjat faqatgina matn emas, balki uning tashqi ko‘rinishi haqidagi (shrift turi, o‘lchami, rangi va hokazo) axborotni ham o‘zida saqlaydi. Turli matn protsessorlarida matnni bezatish uchun turli kodlar qo‘llaniladi. Bunday hollarda hujjatlar har xil formatga ega deyiladi. Shu sababli formatlangan matnli hujjatlarni bir matn protsessoridan boshqasiga olib o‘tishga har doim ham erishib bo‘lmaydi. Yuqorida aytilganlarni hisobga olib matn ko‘rinishidagi axborotlarni qayta ishlash usullari va yo‘l-yo‘riqlarini hozirgi kunda eng mukammal matn protsessorlaridan biri bo‘lgan Microsoft Office 2003 dasturlar majmuasiga kiritilgan Microsoft Office Word 2003 (qisqacha Word) matn protsessori misolida ko‘rib chiqamiz. U juda ko‘p amallarni bajara olishi bilan boshqa matn protsessorlaridan ajralib turadi. "
            },
            {    "id": 4,
              "page": 15,
              "title": "WORDDA MATN YOZISH QOIDALARI",
              "desc": "Matn protsessorlarida matn yozish uchun faqat klavishlarni bosishning o‘zi yetarli emas. Wordda matn avvaldan puxta o‘ylangan reja yoki tartib asosida yoziladi. Masalan, siz avvalgi darsda yozgan «Tarjimayi hol» nomli hujjat ham ma’lum bir savollarga javob berish orqali tayyorlandi. Biror hujjat tayyorlashni rejalashtirishda uning ko‘rinishlarini, matn yozish qoidalarini, hujjatda harakatlanishni, tahrir qilish imkoniyatlarini bilish muhimdir. Oddiy ( ) holat matnni kiritish, tahrir qilish va formatlash uchun mo‘ljallangan. Bu holatda sahifa hoshiyalari, rasmlar ko‘rinmaydi. Bu holatdan matnning mazmuni ko‘proq ahamiyatli bo‘lganda foydalaniladi. Web-hujjat ( ) holati matnni Internet dasturlarida (masalan, Windows tarkibidagi Internet Explorerda) ko‘rsatish uchun tayyorlanganda foydalanishga qulay. Bu holatda fon, rasmlar va matn Internet sahifasidagi ko‘rinishda aks etadi. Sahifa ( ) holati (A-rasm). Bu holatda hujjat alohida sahifalar ko‘rinishida aks etadi. Odatda, bu ko‘rinishda vertikal va gorizontal chizg‘ichlar aks etib turadi. Struktura ( ) holati (B-rasm) matn tarkibini ko‘rib turish, matn qismlarini nusxalash, ko‘chirib o‘tkazish yo‘li bilan matnni qayta tashkil etishda ishlatiladi. O‘qish ( ) holati hujjatni ekranda o‘qish uchun juda qulay. Bu holatda uskunalarning ba’zi panellari aks etmasligi mumkin. To‘liq ekran ( ) holati hujjatni ekranda ko‘zni charchatmasdan ko‘rib chiqish uchun qulay. Bu holatda hujjat sahifasining o‘lchamlari ekran o‘lchamlariga mos o‘zgaradi va ekranda faqat sahifa aks etadi. MATN YOZISH QOIDALARI Wordda matn yozganda quyidagilarni bilish maqsadga muvofiq: • Barcha matn muharrirlarida bo‘lgani kabi Wordda ham matnning bir satrga sig‘magan qismi yangi satrga avtomatik tarzda ko‘chadi. • Yangi abzasga o‘tish uchun Enter klavishini bosish zarur. • Har qanday tinish belgisidan keyin probel (bo‘sh joy) klavishi bosilishi shart, tinish belgisidan oldin probel bosilmaydi. • «Qat’iy probel»ni joylashtirish uchun Ctrl , Shift , probel klavishlari birgalikda bosiladi. Qat’iy tire satr oxirida yozilgan probel qatnashgan jumla (masalan, N. Solihova) ajralib qolmasligi uchun, ya’ni bir satrda joylashishi shart bo‘lganda ishlatiladi. "
            },
            {      "id": 5,
              "page": 19,
              "title": "HUJJATLARNING ASOSIY PARAMETRLARI",
              "desc": "Word matn protsessorida ish boshlaganda, avval hujjatning ko‘rinishini ko‘z oldimizga keltirishimiz kerak. Chunki, hujjatning ko‘rinishiga qarab qog‘oz o‘lchami, sahifa yo‘nalishi, satrlar orasidagi masofa avvaldan belgilab olinadi. HUJJAT PARAMETRLARI Biz hayotimizda turli-tuman hujjatlarga duch kelamiz. Inson tug‘ilishi bilan unga tug‘ilganlik haqida guvohnoma beriladi, salomatlik varaqasi ochiladi va hokazo. Uyda foydalanilgan elektr energiyasi uchun to‘lov Sahifa holati O‘qish holati Oddiy holat 20 kvitansiyasi, biror mavzuda tayyorlangan referat yoki insho ham shular jumlasidandir. Bu ro‘yxatni uzoq davom ettirish mumkin. Ular birbiridan faqat mazmuni bilan emas, balki boshqa jihatlari bilan, jumladan, hujjatlarning o‘lchamida ham farq qiladi. Turli hujjatlar turli o‘lchamdagi qog‘ozga yozilganini ko‘p kuzatgansiz. Bundan tashqari, matn yozilganda sahifaning chap, o‘ng, yuqori va pastki qismidan turlicha masofa qoldiriladi. Turli hujjatlarda satrlar orasidagi masofa ham har xil bo‘lishi mumkin. Matn protsessorlarida tayyorlanayotgan hujjatning turiga qarab sahifa parametrlari va matn parametrlari (shrift, abzas) belgilab olinadi. Ular hujjatlarning parametrlari deb yuritiladi. SAHIFA PARAMETRLARI Biror hujjat tayyorlashda, avvalo u qanday o‘lchamdagi qog‘ozga bosilishi belgilab olinadi. Shunga ko‘ra, sahifa o‘lchamlari tanlanadi. Buning uchun Fayl menyusiga kiriladi. Fayl menyusi amallari ketmaketligidan Sahifa parametrlari ( ) amali tanlanadi. Ekranda Sahifa parametrlari muloqot oynasi paydo bo‘ladi. U uchta ilova (amallar majmuyi)dan iborat. Ulardan Hoshiya ( ) ilovasi ekranda aks etadi. Bu ilovada sahifaning yuqori, pastki, chap va o‘ng tomonlaridan qancha bo‘sh joy qoldirilishi ko‘rsatiladi. Ilovaning Namuna ( ) qismida tanlangan parametrlarga mos sahifa nusxasi aks etib turadi."
            },


            { "id": 6,
              "page": 24,
              "title": "HUJJAT HOSIL QILISH VA SAQLASH",
              "desc":"Wordda matnli hujjat hosil qilish va saqlash usullari ko‘p bo‘lib, ular vaziyatga qarab qo‘llaniladi. Bu usullarni eslab qolishingiz uchun ozgina mashq qilishingiz kifoya. HUJJAT HOSIL QILISH Matnli hujjat tayyorlash uchun, avvalo, yangi sahifa (ishchi maydoni) hosil qilinadi. Microsoft Word matn protsessorida bu quyidagicha amalga oshiriladi: a) ishga tushgan dastur nomi bilan yangi hujjat hosil qilishni taklif etadi; Natijada matn terish uchun yangi sahifa ochiladi. Bu ishni STANDART uskunalar panelidagi Hosil qilish tugmasini bosish bilan ham amalga oshirish mumkin. Shunday qilib matnli hujjat tayyorlash jarayoni boshlanadi. Hosil qilinayotgan matnli hujjatning xususiyatlariga qarab yuqorida aytib o‘tilgan parametrlar mos ravishda o‘rnatiladi. Ma’lumki, matn jumlalardan, jumlalar so‘zlardan, so‘zlar esa harflardan tashkil topadi. Bundan tashqari, matnda tinish belgilari va maxsus belgilar ham ishlatiladi. Bu belgilarning hammasi klaviaturada mavjud. Shu sababli mazkur klavishlarning klaviaturada joylashish tartibini qanchalik yaxshi bilsangiz, matn terish shunchalik oson bo‘ladi. Buning uchun kerakli belgili klavishlarni ketma-ket bosish kifoya. Bosilgan klavishga mos belgi ishchi maydonining yurgich (kursor) ko‘rsatib turgan joyiga yoziladi va yurgich bir o‘rin o‘ngga suriladi. Yodingizda bo‘lsa, yurgichning harakatini boshqaruvchi yana bir necha klavishlar bor. Ulardan eng muhimi Enter klavishidir. Enter klavishi bosilganda yurgich keyingi qator boshiga ko‘chadi. Bu esa matnda abzas tugab, yangi abzas boshlanganini bildiradi. Yurgichni «Chapga», «O‘ngga», «Yuqoriga», «Pastga» yo‘nalish klavishlari mos ravishda chap, o‘ng, yuqori va pastga siljitadi. Alifboning kichik harflari «quyi registr», katta harflari «yuqori registr» belgilari deyiladi. Kompyuter ishga tushirilganda klaviatura, odatda, quyi registr holatida bo‘ladi. Yuqori registr belgilarini ekranga chiqarish uchun kerakli klavish Shift klavishi bilan birgalikda bosiladi. Demak, yuqori registr Shift klavishi bosib turilgan vaqtda ishlaydi. Shift klavishi qo‘yib yuborilishi bilan klaviatura quyi registr holatiga qaytadi. Ba’zan matnning biror qismini faqat bosh harflarda yozishga to‘g‘ri keladi. Bunday holda, odatda, Caps Lock klavishidan foydalaniladi. Bu klavish bosilganda klaviaturaning o‘ng yuqori qismida Caps Lock indikatori yonadi va klaviatura yuqori registr holatiga o‘tadi. Caps Lock klavishi qaytadan bosilsa, Caps Lock indikatori o‘chadi va klaviatura quyi registr holatiga qaytadi."
            },
            { "id": 7,
              "page": 28,
              "title": "HUJJATLARNI TAHRIR QILISH",
              "desc":"Qo‘lda yoki yozuv mashinkasida yozilgan matnga tuzatish kiritish mushkul. Aksariyat hollarda tuzatish kiritilgan matn qaytadan oqqa ko‘chiriladi. Matn muharrirlari va matn protsessorlari esa matnlarga ixtiyoriy tuzatishlar kiritish imkoniyatini beradi. Matnli hujjatga tuzatishlar kiritish hujjatni tahrir qilish deyiladi. Masalan, hujjatni tahrir qilish jarayonida biror belgi o‘chiriladi, almashtiriladi yoki joylashtiriladi, matnning ma’lum qismi o‘chiriladi, nusxasi ko‘- chiriladi yoki joyi almashtiriladi.Matn yozilganda xatoliklarga yo‘l qo‘yilgan bo‘lishi mumkin. Yozish jarayonida tez-tez fikr o‘zgarib turishi mumkin. Bu holda umuman bexato yozilgan matnga ham qo‘shimchalar va tuzatishlar kiritiladi. Matnni tahrir qilishda eng ko‘p bajariladigan ishlardan biri bu ortiqcha belgini o‘chirish yoki tushib qolgan belgini oraga joylashtirishdir. Matnga yangi belgilarni kiritish quyidagicha bajariladi: 1. Yurgich matnning kerakli belgilar kiritilishi lozim bo‘lgan joyiga o‘rnatiladi. 2. Kerakli belgilar klaviaturada teriladi. Matnda belgilangan biror qism blok deyiladi. Odatda, blok qora fonda oq belgi ko‘rinishida (masalan, ) tasvirlanadi. Blok ustida turli amallar (o‘chirish, nusxalash, ko‘chirib o‘tkazish, formatlash va boshqalar)ni bajarish mumkin. Matnda blok ajratish klaviatura yoki sichqoncha yordamida amalga oshirilishi mumkin. Klaviatura yordamida blok ajratish uchun yurgich kerakli qismning (belgi, so‘z, satr yoki abzas, sahifa) birinchi belgisi oldiga joylashtiriladi. So‘ng Shift klavishini bosib turgan holda → yoki ↓ yo‘nalish klavishi kerakli matn qismi belgilanguncha bosib turiladi. Hujjatni to‘liq ajratish uchun Ctrl klavishini bosib turgan holda A lotin harfi ham bosiladi. Sichqoncha yordamida blok ajratish ko‘p usulda amalga oshiriladi. Masalan: • yurgichni belgilanishi kerak bo‘lgan qism oldiga joylashtirib sichqonchaning chap tugmasini bosgan holda harakatlantirish; • so‘zni belgilash uchun yurgichni so‘z ustiga olib borib sichqonchaning chap tugmasini ikki marta bosish; • abzasni belgilash uchun yurgichni abzas ustiga olib borib sichqonchaning chap tugmasini uch marta bosish; • abzasni belgilash uchun sichqoncha ko‘rsatkichini abzas oldidagi hoshiyaga olib borib, chap tugmasini ikki marta bosish; • jumlani belgilash uchun yurgichni uning ustiga olib borib Ctrl klavishini bosib turgan holda sichqonchaning chap tugmasini bir marta bosish; • satrni belgilash uchun sichqoncha ko‘rsatkichini satr oldidagi hoshiyaga olib borib, chap tugmasini bir marta bosish; • matnni to‘liq belgilash uchun sichqoncha ko‘rsatkichini biror satr oldidagi hoshiyaga olib borib, chap tugmasini uch marta bosish; • matnning to‘g‘ri to‘rtburchak shaklidagi qismini Alt klavishini bosib turib sichqonchaning chap tugmasini bosib turgan holda belgilash; • dasturning Holat satrida joylashgan yozuvli tugmaga sichqoncha ko‘rsatkichini yo‘naltirgan holda chap tugmasi ikki marta bosilsa, matnda belgilash tartibiga o‘tiladi va matn belgilanadi, so‘ng yana matn kiritish tartibiga o‘tkazish uchun sichqoncha ko‘rsatkichini yozuvli tugmaga yo‘naltirib chap tugmasi ikki marta bosiladi."
            },

            { "id": 8,
              "page": 32,
              "title": "HUJJATNI FORMATLASH",
              "desc":"Avval aytilganidek, matn protsessorlarida hujjatning tashqi ko‘rinishi chiroyli chiqishi uchun shrift turi, o‘lchami, rangi va abzas tekislanishi, chegara chizish kabi bezaklar bilan boyitilishi mumkin. Bu kabi amallarni bajarish formatlash deyiladi. Formatlash shrift, matn yoki abzasga nisbatan qo‘llanilishi mumkin. Bu darsda formatlashga oid amallar bilan tanishasiz. MATNNI FORMATLASH Matndagi shriftning rangi, chizma ko‘rinishi, o‘lchami, yozuv shakli quyidagicha tanlanadi: 1. Formatlanishi kerak bo‘lgan qism belgilanadi, ya’ni blokka olinadi. 2. Format menyusidan Shrift ( ) bo‘limi tanlanadi. 3. Blokka biror yozuv shaklini berish uchun Shrift shaklini tanlash darchasidan kerakli yozuv shakli tanlanadi. 4. Shrift uchun kerakli rang, o‘lcham, chizma ko‘rinishi va boshqa o‘zgarishlar mos darchalardan tanlanadi. 5. Shriftdagi o‘zgarishlarni ko‘rib turish darchasida kerakli natija ko‘zga tashlanganda OK tugmasi tanlanadi yoki Enter klavishi bosiladi. ABZASNI FORMATLASH Yodingizda bo‘lsa, abzas quyidagi xususiyatlarga ega edi: • abzas kengligi; • sahifada tekislanish usuli (chap yoki o‘ng chegara, markazga tomon va sahifa kengligi bo‘yicha); • abzasning bosh satri va keyingi satrlarning chap va o‘ng hoshiyadan chekinishi; • intervali (satrlar orasining kengligi). Abzasni formatlash uchun: 1) yurgichni shu abzasga joylashtiriladi; 2) Format menyusidan Abzas ( ) bo‘limi tanlanadi; 3) zarur formatlash amallari bajariladi va abzasdagi o‘zgarishlarni ko‘rib turish darchasida kerakli natija aks etganda OK tugmasi tanlanadi yoki Enter klavishi bosiladi. Matnni yoki abzasni formatlashni yuqoridagi rasmda aks etgan FORMATLASH uskunalar paneli yordamida bajarish ancha qulay. Bunda amallar ko‘rgazmali shaklda aks etadi. Umuman, formatlashni matn terish jarayonida yoki matn terib bo‘lingandan keyin ham bajarish mumkin. Matnning belgilangan qismini formatlash. Formatlash uchun matnning qismi blokka olinadi. FORMATLASH uskunalar panelidan «chap tomonga», «o‘rtaga», «o‘ng tomonga» va «sahifa kengligi bo‘yicha» joylashtirish tugmalaridan biri bosiladi. Matnning belgilangan qismidagi yozuv ko‘rinishini o‘zgartirish uchun matnning kerakli qismi blokka olinadi. FORMATLASH uskunalar panelidan «qalin», «og‘ma» va «ostiga chizish» tugmalaridan biri bosiladi. Matnning belgilangan qismidagi shrift o‘lchamini o‘zgartirish uchun matnning kerakli qismi blokka olinadi. FORMATLASH uskunalar panelidan «o‘lcham» ( ) tugmasidagi uchburchak belgisi bosiladi va taklif etilgan o‘lchamlardan biri tanlanadi yoki klaviaturradan ixtiyoriy o‘lcham qiymati kiritiladi. Matnning belgilangan qismidagi shrift rangini o‘zgartirish. Shrift rangini o‘zgartirish uchun matnning kerakli qismi blokka olinadi. FORMATLASH uskunalar panelidan shrift rangi ( ) tugmasidagi uchburchak belgisi bosiladi va taklif etilgan ranglardan kerakligi tanlanadi."
            },
            { "id": 9,
              "page": 34,
              "title": "HUJJATNI TAHRIR QILISH VA FORMATLASHGA OID MASHQLAR",
              "desc":" Word dasturida Respublikamiz Davlat bayrog‘i tavsifi to‘g‘risida matn yozing, shu nomda saqlang, tahrir qiling va formatini o‘zgartiring. 2. Wordda «Mening maktabim» mavzusida kichik hikoya yozing, shu nomda saqlang, tahrir qiling va formatini o‘zgartiring. 3. Quyidagi mavzulardan biriga mos matn yozing, formatini o‘zgartiring va saqlang: a) «Ona vatan — O‘zbekistonim!»; b)«Assalom, Navro‘z!»; d)«Oltin kuz»; e) «Suv — hayot manbayi»; 35 f) «Kitob — bilim chirog‘i»; g) «Maktab — bilim o‘chog‘i»; h)«Sog‘lom tanda — sog‘ aql». "
            },
            {"id": 10,
              "page": 35,
              "title": "HUJJATLARDA RASMLAR BILAN ISHLASH",
              "desc":" Ayrim hujjatlarni tayyorlashda jadval va rasmlardan ham foydalaniladi. Gazeta, jurnal yoki kitob sahifalarida bunday holatni ko‘p uchratgansiz. Jumladan, qo‘lingizdagi darslik sahifalarida ham turli rasm va jadvallar mavjud. Turli chizma va rasmlar hujjatlarni ko‘rgazmali, qiziqarli va tushunarli bo‘lishiga xizmat qiladi. MS WORD RASMLAR KOLLEKSIYASIDAGI RASMNI HUJJATGA JOYLASHTIRISH Hujjatlarga rasmlarni turli usullar yordamida joylashtirish mumkin. Shulardan biri faylda saqlanayotgan tayyor rasmlarni matnli hujjatga joylashtirishdir. Word matn protsessori bu vazifani qanday amalga oshirishini ko‘rib chiqamiz. Word matn protsessori dasturiy ta’minotiga 100 dan ziyod rasmlar kirgan bo‘lib, ulardan turli hujjatlarni bezatishda foydalanish mumkin. Buning uchun yurgich matnning rasm joylashtirilishi kerak bo‘lgan joyiga o‘rnatiladi. So‘ngra Joylashtirish menyusining Rasm ( ) bo‘limidan Rasmlar ( ) bandi tanlanadi. Natijada ekranga Kli plar kolleksiyasi ( ) nomli muloqot oynasi chiqadi. U Izlash (Èñêàòü), Ko‘rib chiqish (Ïðîñìàòðèâàòü), Obyektlarni izlash (Èñêàòü îáúåêòû) bandlari hamda mavjud rasmlar aks etib turuvchi maxsus oynadan iborat."
            }
          ]
        },
        {
          "classId": 3,
          "classLevel": 7,
          "mundarija": [
            {
              "id": 1,
              "page": 3,
              "title": "Kirish",
              "desc": "Aziz o‘quvchilar! Siz avvalgi sinflarda zamonaviy axborot texnologiyalari vositalaridan biri bo‘lgan kompyuterdan foydalanish bo‘yicha dastlabki ko‘nikma va malakalarga ega bo‘ldingiz. Shu bilan birga, kompyuter – o‘qitish, hisoblash, tasvirlash, tahrirlash, dam olish hamda axborot bilan ishlash vositasi ekanligi haqida ma’lumot oldingiz. Ushbu darslik yordamida Siz axborotni to‘plash, uzatish, saqlash va qayta ishlash qonunlarini, usullarini hamda tezkor kompyuterlar va boshqa zamonaviy vositalar ko‘magidan foydalanishni o‘rganasiz. Hozirgi kunda axborotning qimmatbaho mahsulotga aylanib borayotgani informatika fanining nufuzi va ahamiyati o‘sib borayotganidan dalolatdir. Sizga taqdim etilayotgan ushbu darslik Sizni informatika olamiga olib kiradi, uning sirlarini o‘rganishda muhim ko‘makchi bo‘ladi, deb umid qilamiz. O‘ylaymizki, informatika fani sizlarda kompyuter doimiy ko‘makchi va mehnatingizni yengillashtiruvchi vosita ekanligi haqida tasavvur qoldirishi bilan birga, o‘z amaliy ishingizda yangi qirralarning ochilishiga turtki bo‘lib xizmat qiladi."
            },
            {
              "id": 2,
              "page": 4,
              "title": "INFORMATIKA FANI NIMANI O‘RGANADI",
              "desc": "“Informatsiya” so‘zi turli tillarda ishlatilib, ma’nosi turlicha talqin qilinsa ham ularning asosida lotincha informatio so‘zi yotadi. U «ma’lumot», «tushuntirish», «tavsiflash» degan ma’noni anglatadi. O‘zbek tilida informatsiya so‘zi axborot deb tushuniladi. Informatika fan sifatida XX asrning 50- yillarida yangi fan – informatikaga asos solindi. Informatika termini (fransuzcha: informatique) fransuzcha information (axborot) va automatique (avtomatika) so‘zlari negizida hosil bo‘lgan. Uning tarjimasi “axborotli avtomatika” degan ma’noni bildiradi. Bu terminning inglizcha varianti ham bor bo‘lib, u “Ñomputer science”, ya’ni “kompyuter ilmi” deb ataladi. Informatika – kompyuter texnikasini qo‘llashga asoslanib inson faoliyatining turli sohalarida axborotlarni izlash, to‘plash, saqlash, qayta ishlash va undan foydalanish masalalari bilan shug‘ullanuvchi fandir. Qisqa qilib aytganda, informatika kompyuter texnikasi asosida axborotlar ustida bajariladigan amallar va ularni qo‘llash usullarini o‘rganadigan fandir. Demak, informatika uchun asosiy ashyo axborot bo‘lib, u asos tushunchadir. Informatika fanini kompyutersiz tasavvur qilib bo‘lmagani kabi sizga tanish bo‘lgan kompyuterning Hardware (Texnik yoki qattiq qism) va Software (Dasturiy yoki yumshoq qism) tushunchalari birgalikda qaraladi. Texnik vositalar – kompyuterning qurilmalaridir."
            },
            {
              "id": 3,
              "page": 8,
              "title":"AXBOROTNING KO‘RINISHLARI, XUSUSIYATLARI VA TURLARI",
              "desc": " Inson hayotini axborotsiz tasavvur qilib bo‘lmaydi. Axborotning esa hayotda har xil ko‘rinishlari va turlari bor. Masalan, axborotning rasm, chizma, matn yoki jadval kabi ko‘rinishlari sizga tanish. Shu bilan birga biror ko‘rinishdagi axborotdan foydalana olishimiz uchun u qanday xususiyatlarga ega bo‘lishi zarurligi ham g‘oyatda muhimdir. Axborotning ko‘rinishlari Ma’lumki, har bir inson moddiy ne’matlar (masalan, oziq-ovqat, kiyim-kechak, uy anjomlari) bilan birga ular haqidagi axborotlarni (qanday maqsadda ishlatilishi, shakli, rangi, og‘irligi kabilarni) ham bilishi zarurdir. Inson qo‘li orqali jismning qattiq va tekisligini, tili orqali oziq ta’mini, burun orqali turli hidlarni sezadi, qulog‘i Axborotning ko‘rinishlari, xususiyatlari va turlari 9 orqali har xil tovushlarni eshitadi, ko‘zi orqali turli shakllarni, ranglarni yoki manzaralarni ko‘radi, ya’ni sezgi a’zolari orqali turli axborotlar oladi. Bundan ko‘rinib turibdiki, axborotni hayotdan har xil ko‘rinishlarda yoki shakllarda olish mumkin ekan. Masalan: rasm, chizma, fotosurat, yozuv; nur yoki tovushlar; har xil to‘lqinlar; elektr va nerv impulslari; magnit yozuvlari; mimika; hid va ta’m; organizmlarning sifat va xususiyatlarini saqlovchi xromosomalar va hokazo. Informatika fanida axborotni yuqoridagi ko‘rinishlardan ba’zilari orqali tasvirladingiz, ba’zilarini hayotda ko‘rgansiz, ba’zilari bilan esa boshqa fanlar orqali tanishasiz. Hayotda bir xil axborotni turli ko‘rinishlarda tasvirlash mumkin. Masalan, Bugun do‘stlarim bilan ... . Informatikada narsalar, jarayonlar, moddiy va nomoddiy xususiyatli hodisalar ularning axborot berish xususiyatlaridan kelib chiqib axborot obyektlari deb ataladi. Axborotning asosiy xususiyatlari Axborotdan hayot faoliyatida foydalana olish uchun, asosan quyidagi uchta muhim xususiyatga ega bo‘lish lozim: · Axborot ma’lum darajada qimmatli bo‘lishi kerak, aks holda undan foydalanish ehtiyoji tug‘ilmaydi. Qimmatli axborot vaqt o‘tishi bilan o‘z qimmatini yo‘qotishi mumkin. Masalan, “30 sentabr kuni tantana o‘tkaziladi” degan axborot 1 noyabrda o‘z qimmatini yo‘- qotadi."
            },
            {              "id": 4,
              "page": 13,
              "title":"AXBOROTLAR USTIDA BAJARILADIGAN AMALLAR",
              "desc": "Avvalgi darslarda axborotni aniqlash va undan foydalanishga oid mashqlarni bajardingiz. Bunda Siz berilgan qonuniyatlarga ko‘ra axborot oldingiz, ya’ni axborot to‘pladingiz (hosil qildingiz), olingan axborotni daftaringizga qayd etdingiz, ya’ni saqlab qo‘ydingiz, shu axborotga asosan o‘ylab ko‘rib xulosa chiqardingiz, ya’ni qayta ishladingiz va berilgan vazifani hal etdingiz, ya’ni axborotni ishlatdingiz. Mashqni bajarish jarayonida axborotni eslab qolish va boshqa ko‘rinishga o‘tkazishga to‘gri keldi. Bu darsda shu kabi axborotlar ustida bajariladigan amallardan asosiylarini ko‘rib chiqamiz. Axborotli jarayonlar Axborot ustida hosil qilish, to‘plash, izlash, saqlash, uzatish, qabul qilish, o‘lchash, ishlatish, qayta ishlash, nusxalash, his etish, eslab qolish, boshqa ko‘rinishga o‘tkazish, tarqatish, bo‘laklarga ajratish, soddalashtirish, birlashtirish, formallashtirish, kodlash, buzish kabi amallarni bajarish mumkin. Axborotlar ustida bajariladigan amallar bilan bog‘liq barcha jarayonlar axborotli jarayonlar deb ataladi. Axborotlar ustida bajariladigan amallarning ko‘plari Sizga tanish. Masalan, axborotni to‘plash, birlashtirish, saqlash, his etish, eslab qolish, ishlatish bilan fanlarni o‘zlashtirish jarayonida, boshqa ko‘rinishga o‘tkazish yoki formallashtirish amallaridan matematika va fizika darslarida formulalar, tenglamalar va jadvallar tuzib, nusxalash amalidan esa Paint va Word dasturlarida ko‘p foydalandingiz. Keyingi darslarimizda axborotlar ustida bajariladigan kodlash va kodni buzish amallari bilan tanishasiz. To‘plangan axborotlardan kerak bo‘lganda foydalanish uchun ularni saqlab qo‘yish kerak. Axborotlar turli xil vositalarda, masalan, kitoblarda, gazetalarda, magnitli tasmalarda, kompyuterlarning esa maxsus vositalarida saqlanadi. Ular axborot tashuvchi vositalar deb ataladi. "
            },
            {              "id": 5,
              "page": 18,
              "title":". AXBOROTNI KODLASH ",
              "desc": "Inson axborotlarni yig‘ish, saqlash va qayta ishlashda qulay hamda qisqa ko‘rinishda bo‘lishi uchun turli belgilashlardan foydalanadi. Bunga tovushlarni harf va raqamlar orqali, musiqa tovushlarini notalar orqali, matematik, fizik, biologik qonuniyatlarni formulalar orqali ifodalanishini misol qilish mumkin. Axborotlar ustida amallar bajarish qulay bo‘lishi uchun aniq bir qoidalar asosida boshqa ko‘rinishga o‘tkazish jarayoni axborotni kodlash deyiladi. Axborotlarni kodlash insoniyat tomonidan faqat amallar bajarish qulay bo‘lishi uchun emas, balki axborotni maxfiy saqlash uchun ham qo‘llanilgan. Kodlashning bu ko‘rinishi shifrlash deb ataladi. Qadimda axborotlarni kodlash Hayotda axborotni kodlashning ko‘pdan-ko‘p usullari mavjud. Birinchi kodlashni qo‘llagan inson qadimgi Gretsiya Axborotlarni kodlash a(bc(d)) a * * b c d e * f 1) a(b(e(h)k)c(df)) 2) a(b(c(de(fg(k))))) 3) a(b(c(d))) 4) a(b(c(d))f(g(h))) 5) a(b(cdf(g)h(k))) a * b c * d a(b(e)cd(f)) a b c d a b e d f c 19 sarkardasi Lisandro hisoblanadi. U axborotni maxfiy saqlash, ya’ni kodlash uchun ma’lum bir qalinlikdagi “Ssital” tayoqchasini o‘ylab topgan. Kodlashning bu usuli o‘rin almashtirish usuli deb ataladi. Qadimda axborotlarni kodlash VAOANNT - A Matn: “VATAN-ONA” Kodlash natijasi: “Ssital” tayoqchasi Qadimgi rim imperatori Yuliy Sezar ham axborotning maxfiyligini saqlash uchun matnni kodlash usulini o‘ylab topgan. “Sezar shifri”da matndagi harf alifboda o‘zidan keyin kelgan uchinchi harfga almashtiriladi. Bunda alifbo doiraviy yozilgan hisoblanadi. Bu kodlash usul alifboni surish usuli deyiladi. Sezar usulidan foydalanganda belgini istalgancha surish mumkin. Axborotlarni kodlash usullaridan biri Morze kodlash usuli ham mavjud. Semyuel Morze 1837-yilda elektromagnit telegraf qurilmasini ixtiro qilgan va 1838-yilda shu qurilma uchun telegraf kodini ishlab chiqqan. Unda turli harf va raqamlar nuqta va tirelarning maxsus ketmaketligi ko‘rinishida ifodalangan, ya’ni, axborot uchta belgi yordamida kodlanadi: “uzun signal” (tire yordamida ifodalanadi), “qisqa signal” (nuqta yordamida ifodalanadi), “signalsiz” (bo‘shliq, pauza bilan ifodalanadi). Mazkur kodlash usuli hozirgi kunda ham qo‘llanib kelinmoqda. "
            },
            {              "id": 6,
              "page": 22,
              "title": "SANOQ SISTEMALARI HAQIDA",
              "desc": "Hozirgi kunda ishlatilib kelayotgan 1, 2, 3, . . ., 9, 0 raqamdan iborat o‘nlik sanoq sistemasi axborotni kodlashning yana bir usuli hisoblanadi. Yurtdoshimiz Muhammad al-Xorazmiy 0 raqamini kiritib bu arab (to‘g‘rirog‘i, hind) raqamlarining sondagi turgan o‘rniga bog‘liq holda amallar bajarish tartibini yagona tizimga birlashtirgan. Shuning uchun ham bu kodlash sistemasi ustida qo‘shish, ayirish, ko‘paytirish va bo‘lish kabi arifmetik amallarni bajarish juda oson. Tarixiy ma’lumotlar Odamlar o‘rtasida muomala vositasi bo‘lmish til kabi sonlarning ham o‘z tili mavjud bo‘lib, u ham o‘z alifbosiga ega. Bu alifbo raqamlar va sonlarni ifodalash uchun qo‘llaniladigan belgilardan iboratdir. Masalan, kundalik hayotimizda qo‘llanadigan arab raqamlari 1, 2, . . ., 9, 0 yoki rim raqamlari I, II, V, X, L, C, M, H, . . ., sonlar alifbosining elementlari hisoblanadi. Turli davrlarda turli xalqlar, qabilalar raqamlar va sonlarni ifodalashda turlicha belgilardan foydalanganlar. Qadimda ba’zi xalqlar ishlatadigan sonlar alifbosi beshta (qadimgi Afrika qabilalarida), o‘n ikkita (masalan, inglizlarning sonlar alifbosida), yigirmata (XVI–XVII asrlarda Amerika qit’asida yashagan astek, mayya qabilalarida; eramizdan avvalgi II asrda G‘arbiy Yevropada yashagan keltlarda; fransuzlarda), ba’zilari oltmishta (qadimgi bobilliklarda) belgini o‘z ichiga olgan. Ular mos ravishda besh raqamli (qisqacha beshlik) sanoq sistemasi, o‘n ikki raqamli (o‘n ikkilik) sanoq sistemasi, yigirmata raqamli (yigirmalik) sanoq sistemasi yoki oltmishlik sanoq sistemasi deb nomlanadi. "
            },
            {              "id": 7,
              "page": 29,
              "title": "IKKILIK SANOQ SISTEMASIDA AMALLAR BAJARISH",
              "desc": "Kompyuterlar ishlab chiqarila boshlanganda kompyuterlarning ishlash prinsi pi bilan bog‘liq bo‘lgan axborotlarni ikkilik sanoq sistemasida kodlash va amallar bajarish masalasi yuzaga keldi. Chunki, kompyuterga biror amalni bajarishni o‘rgatish uchun inson shu amalni qanday bajarilishini tasavvur qilishi zarurdir. Demak, kompyuterlarning ishlash prinsi pini o‘rganish uchun ikkilik sanoq sistemasida amallar qanday bajarilishini bilishingiz maqsadga muvofiqdir. Ikkilik sanoq sistemasida arifmetik amallar Kundalik hayotimizda ishlatiladigan o‘nlik sanoq sistemasidagi sonlar ustida arifmetik amallar bajarish Sanoq sistemalari haqida 30 usullarini bilamiz. Mazkur usullar boshqa barcha pozitsiyali sanoq sistemalari uchun ham o‘rinlidir. O‘nlik sanoq sistemasida qo‘shish amalini ko‘rsak, biz avval birliklarni, so‘ng o‘nliklarni, keyin yuzliklar va hokazolarni o‘zaro qo‘shib boramiz."
            },
            {              "id": 8,
              "page": 34,
              "title": "AXBOROTLARNING KOMPYUTERDA TASVIRLANISHI",
              "desc": "Ma’lumki, kompyuterlar elektr toki asosida ishlaydi. Kompyuter maxsus qurilmada tokning bor bo‘lishini 1 ga teng, aks holda, ya’ni tok bo‘lmaganda 0 ga teng axborot deb oladi. Ikkinchi tomondan, axborotlarni kodlash uchun kodlash sistemasi ikkita belgidan iborat bo‘lishi yetarli bo‘ladi. Endi belgilarni ikkita belgi orqali qanday kodlash mumkinligini ko‘rib chiqamiz. Axborotni ikkita belgi yordamida kodlash Kompyuter raqamlarning o‘zini emas, balki shu raqamlarni ifodalovchi signallarni farqlaydi. Bunda raqamlar signalning ikki qiymati bilan (magnitlangan yoki magnitlanmagan; ulangan yoki ulanmagan; ha yoki yo‘q va h.k.) ifodalanadi. Bu holatning birinchisini 1 raqami bilan, ikkinchisini esa 0 raqami bilan belgilash qabul qilingan bo‘lib, axborotni ikkita belgi yordamida kodlash (qisqacha, ikkilikda kodlash) nomini olgan. Masalan: A - 01000001 H - 01001000 M - 01001101 T - 01010100 B - 01000010 K - 01001011 O - 01001111 V - 01010110 D - 01000100 I - 01001001 R - 01010010 N - 01001110 Kompyuterlarda har bir belgiga 0 va 1 belgilarining ketma-ketligidan iborat 8 ta belgi mos qo‘yiladi. 8 ta nol va birlarning turli o‘rin almashtirishidan foydalanib, turli xildagi belgilarni kodlashimiz mumkin. 0 va 1 dan iborat raqamlar yordamida ularni 8 tadan ajratsak, bu o‘rin almashtirishlar soni 28 =256 ga teng bo‘ladi, ya’ni ular yordamida 256 ta harflar, raqamlar, turli boshqa belgilarni kodlash mumkin bo‘ladi. "
            },
            {            "id": 9,
              "page": 39,
              "title": "AMALIY MASHG’ULOT",
              "desc": "Misol. Bir kitobda 250 ta sahifa bo‘lib, har bir sahifa 30 ta satrdan va har bir satr 75 ta belgidan iborat bo‘lsa, kitobdagi axborot hajmini hisoblang. Yechish. Dastlab, bitta sahifada nechta belgi borligini hisoblaymiz: 75x30 = 2250 ta. Endi kitobdagi belgilarning umumiy sonini hisoblaymiz: 2250x250 = 562500 ta. Demak, kitobdagi axborot hajmi 562500 x 8 = 4500000 bit yoki 562500 bayt yoki 562500 : 1024 H ≈ 549 KB yoki 549 : 1024 H ≈ 0,54 MB yoki 0,54 : 1024 H ≈ 0,0005 GB ekan. Misoldan ko‘rinadiki, GB ancha katta hajmni ifodalovchi o‘lchov birligi ekan."
            },
            {            "id": 10,
              "page": 42,
              "title": " AXBOROT TEXNOLOGIYALARI",
              "desc": " “Texnologiya” so‘zi yunoncha “techne” – san’at, mohirlik, hunar va “logos” – fan so‘zlaridan tashkil topgan bo‘lib, u aniq maqsadga erishish uchun zaruriy vositalar, usul va sharoitlardan foydalangan holda muayyan amallarning ketma-ket bajarilishini ko‘zda tutadi. Axborot texnologiyalari haqida Ixtiyoriy jarayonni to‘liq o‘rganishda, u to‘g‘risida to‘plangan ma’lumotlar hajmi, ma’lumotlarning o‘zaro bog‘- liqligi darajasi shunchalik murakkab bo‘ladiki, ularni biror vosita yordamisiz to‘liq qayta ishlash amalda mumkin emas. Fan va texnikaning rivojlanishi axborotlarni to‘plash, qayta ishlash va uzatish kabi jarayonlarni samarali amalga oshirish mumkinligini ko‘rsatdi. Bunda asosiy o‘rinni texnik vositalar – kompyuter va boshqa turdagi vositalar egallaydi. Ular yordamida ishni tashkil etish orqali axborotlar almashinuvini tezlatishdan tashqari kerakli axborotni izlash, qayta ishlash va undan foydalanishni osonlashtirish hamda axborotning avval ko‘rsatib o‘tilgan barcha xususiyatlarini saqlashga erishiladi. Insoniyat tomonidan axborotlarni izlash, to‘plash, saqlash, qayta ishlash va undan foydalanish usullari va vositalari axborot texnologiyasi deb yuritiladi. Axborot texnologiyasi ikki ichki va tashqi omillardan iboratdir. Ichki omillarga – usullar, tashqi omillarga – vositalar kiradi. Bundan kelib chiqadiki, axborot texnologiyasi o‘z ichiga quyidagilarni oladi: qalam, ruchka, daftar, qog‘oz, mel, doska, proyektor, ekran, kodoskop, sinf, stol, stul, o‘quvchi, o‘qituvchi, farrosh, direktor, kitob, kompyuter, suhbat jarayoni, dars o‘tish jarayoni, test o‘tkazish jarayoni, savol-javob o‘tkazish jarayoni, dars o‘tish usuli va metodikasi, plakat yoki boshqa didaktik materiallar va hokazo. Demak, axborot texnologiyalari sanoatda, savdo-sotiqda, boshqaruvda, bank, ta’lim va soliq sistemasida, tibbiyot va fanda, transport va aloqada, qishloq xo‘jaligi va ijtimoiy xizmat tizimida, turmushda qo‘llanilar ekan."
            }
          ]
        }
      ]
    },
    {
      "bookId": 6,
      "bookName": "Matematika",
      "status": "tez",
      "bookImage": "assets/svg_icon/img.png",
      "classes": []
    },
    {
      "bookId": 7,
      "bookName": "Astronomiya",
      "status": "tez",
      "bookImage": "assets/svg_icon/img.png",
      "classes": []
    },
    {
      "bookId": 8,
      "bookName": "Metafizika",
      "status": "tez",
      "bookImage": "assets/svg_icon/img.png",
      "classes": []
    }
  ]
}